Функция ВосстановитьEmailСессииConsqueryCloud() Экспорт 
	Возврат ВосстановитьЗначение("Consquery_cloud_email");
КонецФункции // ВосстановитьEmailСессииConsqueryCloud()

Процедура СохранитьИдентификаторСессииConsqueryCloud(ИдентификаторСессии)
	СохранитьЗначение("Consquery_cloud_ИдентификаторСессии", ИдентификаторСессии);
Конецпроцедуры // гСохранитьИдентификаторСессииConsqueryCloud()

Процедура СохранитьEmailConsqueryCloud(email)
	СохранитьЗначение("Consquery_cloud_email", email);
Конецпроцедуры // гСохранитьEmailConsqueryCloud()

Процедура ОсновныеДействияФормыРегистрация(Кнопка)
	лСоединение = гВосстановитьИдентификаторСессииConsqueryCloud();
	Результат   = гЗарегистрироватьВОблаке(лСоединение, email, пароль);
	Если Результат.Статус = "OK" Тогда 
		СтрокаСостояния = Результат.Информация;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Зеленый;
	Иначе
		СтрокаСостояния = Результат.ТекстОшибки;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыИзменитьПароль(Кнопка)
	лСоединение = гВосстановитьИдентификаторСессииConsqueryCloud();
	Результат = гЗарегистрироватьВОблаке(лСоединение, email, пароль, Истина);
	Если Результат.Статус = "OK" Тогда 
		СтрокаСостояния = Результат.Информация;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Зеленый;
	Иначе
		СтрокаСостояния = Результат.ТекстОшибки;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Красный;
	КонецЕсли;
КонецПроцедуры

Процедура ФлажокПоказатьПарольПриИзменении(Элемент)
	ЭлементыФормы.пароль.РежимПароля = Не ФлажокПоказатьПароль;
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ЭлементыФормы.пароль.РежимПароля = Не ФлажокПоказатьПароль;	
КонецПроцедуры

Процедура ОсновныеДействияФормыВойти(Кнопка)
	
	лСоединение = гВосстановитьИдентификаторСессииConsqueryCloud();
	
	Результат = гПодключитьКОблаку(лСоединение, email, пароль);
	Если Результат.Статус = "OK" Тогда 
		СтрокаСостояния = Результат.Информация;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Зеленый;
		СохранитьИдентификаторСессииConsqueryCloud(Результат.Соединение);
		СохранитьEmailConsqueryCloud(email);
		Оповестить("ОбновитьИмяПользователяВОблаке", Новый Структура("ИмяПользователя", email));
		Закрыть(Истина);
	Иначе
		СтрокаСостояния = Результат.ТекстОшибки;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыПроверить(Кнопка)
	
	лСоединение = гВосстановитьИдентификаторСессииConsqueryCloud();
	
	Результат = гПодключитьКОблаку(лСоединение, email, пароль, Истина);
	Если Результат.Статус = "OK" Тогда 
		СтрокаСостояния = Результат.Информация;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Зеленый;
	Иначе
		СтрокаСостояния = Результат.ТекстОшибки;
		ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(email) Тогда 
		email = ВосстановитьEmailСессииConsqueryCloud();
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыВыйти(Кнопка)
	лСоединение = гВосстановитьИдентификаторСессииConsqueryCloud();
	Если Не ЗначениеЗаполнено(лСоединение) Тогда 
		ПоказатьПредупреждение(, "Вы еще не входили.", 10, "Ошибка выхода из сервиса");
	Иначе
		Результат = гОтключитьсяОтОблака(лСоединение);
		СохранитьИдентификаторСессииConsqueryCloud(Неопределено);			
		Если Результат.Статус = "OK" Тогда 
			СтрокаСостояния = Результат.Информация;
			ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Зеленый;
			Оповестить("ОбновитьИмяПользователяВОблаке", Новый Структура("ИмяПользователя", Неопределено));
		Иначе
			СтрокаСостояния = Результат.ТекстОшибки;
			ЭлементыФормы.СтрокаСостояния.ЦветТекстаПоля = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
