&НаКлиенте
Процедура РезультатЗапросаВДеревоПриИзменении(Элемент)
	Оповестить("РезультатЗапросаВДеревоПриИзменении", РезультатЗапросаВДерево);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПередВыполнениемПриИзменении(Элемент)
	Оповестить("СохранитьПередВыполнениемПриИзменении", СохранитьПередВыполнением);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВременныеТаблицыПриИзменении(Элемент)
	Оповестить("ПоказыватьВременныеТаблицыПриИзменении", ПоказыватьВременныеТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЗапросыПакетаПриИзменении(Элемент)
	Оповестить("ПоказыватьЗапросыПакетаПриИзменении", ПоказыватьЗапросыПакета);
КонецПроцедуры

&НаКлиенте
Процедура РежимТестированияВыполненияЗапросаПриИзменении(Элемент)
	Оповестить("РежимТестированияВыполненияЗапросаПриИзменении", РежимТестированияВыполненияЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьБыстрыйВыборВПараметрахПриИзменении(Элемент)
	Оповестить("ОтключитьБыстрыйВыборВПараметрахПриИзменении", ОтключитьБыстрыйВыборВПараметрах);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("СохранитьПередВыполнением", СохранитьПередВыполнением) Тогда 
		СохранитьПередВыполнением = Ложь;
	КонецЕсли;
	
	Если Не Параметры.Свойство("РезультатЗапросаВДерево", РезультатЗапросаВДерево) Тогда 
		РезультатЗапросаВДерево = Ложь;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ПоказыватьВременныеТаблицы", ПоказыватьВременныеТаблицы) Тогда 
		ПоказыватьВременныеТаблицы = Ложь;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ПоказыватьЗапросыПакета", ПоказыватьЗапросыПакета) Тогда 
		ПоказыватьЗапросыПакета = Ложь;
	КонецЕсли;
	
	Если Не Параметры.Свойство("РежимТестированияВыполненияЗапроса", РежимТестированияВыполненияЗапроса) Тогда 
		РежимТестированияВыполненияЗапроса = Ложь;
	КонецЕсли;    
	
	Если Не Параметры.Свойство("ОтключитьБыстрыйВыборВПараметрах", ОтключитьБыстрыйВыборВПараметрах) Тогда 
		ОтключитьБыстрыйВыборВПараметрах = Ложь;
	КонецЕсли;    
	
КонецПроцедуры // ПриСозданииНаСервере()
