Процедура ДействияФормыСохранить(Кнопка)
	лПараметрыЗакрытия = гСтруктураНастроекПрокси();
	ЗаполнитьЗначенияСвойств(лПараметрыЗакрытия, ЭтаФорма);
	Оповестить("ОбновитьНастройкиПрокси", лПараметрыЗакрытия);
	Закрыть();
КонецПроцедуры // ДействияФормыСохранить()

Процедура ПриОткрытии()
	ДоступностьВидимость();
КонецПроцедуры // ПриОткрытии()

Процедура ДоступностьВидимость()
	ЭлементыФормы.ПанельНастройки.Доступность = Использовать;
	Если Использовать Тогда 
		ЭлементыФормы.Пользователь.Доступность = Не ИспользоватьАутентификациюОС;
		ЭлементыФормы.Пароль.Доступность = Не ИспользоватьАутентификациюОС;
	КонецЕсли;
КонецПроцедуры // ДоступностьВидимость()

Процедура ИспользоватьАутентификациюОСПриИзменении(Элемент)
	ДоступностьВидимость()
КонецПроцедуры // ИспользоватьАутентификациюОСПриИзменении()

Процедура ИспользоватьПриИзменении(Элемент)
	ДоступностьВидимость();
КонецПроцедуры
