&НаКлиенте
Процедура РезультатЗапросаВДеревоПриИзменении(Элемент)
	Оповестить("РезультатЗапросаВДеревоПриИзменении", РезультатЗапросаВДерево);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПередВыполнениемПриИзменении(Элемент)
	Оповестить("СохранитьПередВыполнениемПриИзменении", СохранитьПередВыполнением);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВременныеТаблицыПриИзменении(Элемент)
	Оповестить("ПоказыватьВременныеТаблицыПриИзменении", ПоказыватьВременныеТаблицы);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("СохранитьПередВыполнением", СохранитьПередВыполнением) Тогда 
		СохранитьПередВыполнением = Ложь;
	КонецЕсли;
	Если Не Параметры.Свойство("РезультатЗапросаВДерево", РезультатЗапросаВДерево) Тогда 
		РезультатЗапросаВДерево = Ложь;
	КонецЕсли;
	Если Не Параметры.Свойство("ПоказыватьВременныеТаблицы", ПоказыватьВременныеТаблицы) Тогда 
		ПоказыватьВременныеТаблицы = Ложь;
	КонецЕсли;
КонецПроцедуры

