
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка   // Если форма открывается не из главной формы.
		МоментВремени 	= ЗначениеИзСтрокиВнутр(Параметры.Значение);
		Дата 			= МоментВремени.Дата;
		Ссылка			= МоментВремени.Ссылка;
	Исключение
		ЗаполнитьЗначения(Параметры.Значение);
	КонецПопытки;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ВыгрузитьМоментВремениСервер();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ОбъектОбработки()
	Возврат Новый ("ВнешняяОбработкаОбъект.consquery");
КонецФункции

&НаКлиенте
Процедура ВыгрузитьМоментВремениСервер()
	Закрыть(); 
	Владелец					= ЭтотОбъект.ВладелецФормы;
	Владелец.Модифицированность = Истина;
	
	Оповестить("СохранитьЗапросыВРеквизиты", РезультатВСтрокуВнутр());
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЗначения(Значение)
	
	МоментВремени = ЗначениеИзСтрокиВнутр(Значение);
	Если ТипЗнч(МоментВремени) <> Тип("МоментВремени") Тогда 
		Возврат;
	КонецЕсли;
	
	Дата 	= МоментВремени.Дата;
	Ссылка 	= МоментВремени.Ссылка;
КонецПроцедуры	

&НаСервере
Функция РезультатВСтрокуВнутр()
	
	Возврат ЗначениеВСтрокуВнутр(Новый МоментВремени(Дата, Ссылка))

КонецФункции // РезультатВСтрокуВнутр()()

#КонецОбласти

Функция ЗначениеИзСтроки(СтрокаJSON, ИмяФайла = "")
	
	Если ПустаяСтрока(СтрокаJSON) Тогда 
		Возврат "";
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Если ЗначениеЗаполнено(ИмяФайла) Тогда 
		ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	Иначе
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	КонецЕсли;

	Ошибка = "";
	Попытка
		ПроизвольноеЗначение = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);	
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;

	Если ПустаяСтрока(Ошибка) Тогда 
		ЧтениеJSON.Закрыть();
		Возврат ПроизвольноеЗначение
	КонецЕсли;
	
	#Если Сервер Тогда
	ПроизвольноеЗначение = ЗначениеИзСтрокиВнутр(СтрокаJSON);
	
	Возврат ПроизвольноеЗначение;
	#Иначе
	ВызватьИсключение Ошибка;
	#КонецЕсли
		
КонецФункции // ЗначениеИзСтроки()
