// Консоль запросов 1С от Евгения Лавелина
// e-mail:support@consquery.ru
// http: www.consquery.ru

#Область ОписаниеПеременных

Перем гГлобальныеПеременные Экспорт;      // структура для использования в алгоритмах (в режиме предприятия)

Перем гRegExp Экспорт;                    // Com объект VBScript.RegExp. Используется для обычных форм
Перем гСтруктураКЭШ Экспорт;           // структура для хранения данных в рамках текущего сеанса
Перем гДопСтруктураСПараметрами Экспорт;  // соответствие [Идентификатор строки параметра, Значение параметры] - 
                                          // хранит данные типов не доступные для хранения в табличном поле
                                          // (таблица значений, момент времени, граница)

#КонецОбласти

Функция ВерсияОбработки()
	Возврат "3.1.423";
КонецФункции // ВерсияОбработки()

#Область ПрограммныйИнтерфейс

#Область Работа_с_режимом_отладки

Функция гНайтиФайлыСЗапросамиДляОтладки() Экспорт
	
	Возврат НайтиФайлы(КаталогВременныхФайлов(),"*." + гСтроковыеКонстанты("РасширениеФайлаДанныхДляОтладки"), Ложь);
	
КонецФункции

Функция СериализованныеПараметры(ПараметрыЗапроса)
	ЕстьТабличныеЧасти = Ложь;
	Для Каждого КлючЗначение Из ПараметрыЗапроса Цикл
		Если ЭтоТипТабличнаяЧасть(ТипЗнч(КлючЗначение.Значение)) Тогда 
			ЕстьТабличныеЧасти = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьТабличныеЧасти Тогда 
		Возврат ПараметрыЗапроса
	Иначе
		НовыеПараметрыЗапроса = Новый Структура();
		Для Каждого КлючЗначение Из ПараметрыЗапроса Цикл
			Если ЭтоТипТабличнаяЧасть(ТипЗнч(КлючЗначение.Значение)) Тогда 
				НовыеПараметрыЗапроса.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение.Выгрузить());
			Иначе
				НовыеПараметрыЗапроса.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		Возврат НовыеПараметрыЗапроса;
	КонецЕсли;
КонецФункции // СериализованныеПараметры()

Функция Отладка(Запрос) Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ФормаДляОтладки = ПолучитьФорму("Форма");
		ФормаДляОтладки.ЗапросДляОтладки = Запрос;
		ФормаДляОтладки.Открыть();
		Возврат "Форма с данными запроса открыта."
	#Иначе
		Если Запрос.МенеджерВременныхТаблиц <> Неопределено Тогда 
			Для Каждого ВременнаяТаблица Из Запрос.МенеджерВременныхТаблиц.Таблицы Цикл
				//#рефакторинг !!!!!!!! Проверить на валидность имя таблицы для добавления в структура параметров и на отсутствие параметра с таким именем
				//гПолучитьСледующееУникальноеИмя(ИсходноеИмя, СписокПараметров, "Имя")
				Запрос.Параметры.Вставить(ВременнаяТаблица.ПолноеИмя, ВременнаяТаблица.ПолучитьДанные().Выгрузить()); 
			КонецЦикла;
		КонецЕсли;
		
		ДанныеДляОтладки = Новый Структура;
		ДанныеДляОтладки.Вставить("ТекстЗапроса"    , Запрос.Текст);
		ДанныеДляОтладки.Вставить("ПараметрыЗапроса", СериализованныеПараметры(Запрос.Параметры));
		ДанныеДляОтладки.Вставить("ПараметрыИБ"     , СтрокаСоединенияИнформационнойБазы());
		
		лИмяФайла = ПолучитьИмяВременногоФайла(гСтроковыеКонстанты("РасширениеФайлаДанныхДляОтладки"));
		
		Попытка
			
			ЗначениеВФайл(лИмяФайла, ДанныеДляОтладки);
			
			ИмяСервера = ПолучитьИмяСервераПоСтрокеСоединения();
			
			Возврат "Данные для отладки выгружены в файл: """ + лИмяФайла + ?(ИмяСервера = Неопределено, "", """ ( на сервере """ + ИмяСервера + """ )");
			
		Исключение
			Возврат "Ошибка выгрузки данных: " + ОписаниеОшибки();
		КонецПопытки; 
	#КонецЕсли
	
КонецФункции // Отладка()

Функция ПомощьПоОтладке(ПутьКФайлуСОбработкойНаСервере = "%ПутьКФайлуСОбработкойНаСервере%") Экспорт
	
	ТекстСообщения = 
		"Варианты использования обработки в режиме отладки:
		|   0* -> %ТекстСозданияОбработки%.%ИмяМетода0%
		|   1* -> %ТекстСозданияОбработки%.%ИмяМетода1%
		|   2* -> %ТекстСозданияОбработки%.%ИмяМетода2%
		|   3* -> %ТекстСозданияОбработки%.%ИмяМетода3%
		|   4* -> %ТекстСозданияОбработки%.%ИмяМетода4%
		|
		|Инструкция к использованию:
		|   1. Установить точку останова в конфигураторе (например, для отладки запроса перед строкой ""Запрос.Выполнить()"". 
		|   2. Запустить 1С Предприятие в режиме отладки (меню конфигуратора: Отладка - Начало отладки - [выбрать необходимый режим отладки управляемого приложения])
		|   3. Когда отладка остановится в точке останова, нажать комбинацию клавиш ""Shift + F9"" (меню конфигуратора: Отладка - Вычислить выражение).
		|   4. В поле ввода ""Выражение"" ввести один из вариантов использования обработки (см. выше первый блок данного текста и комментарии к каждому варианту использования ниже) 
		|   5. Нажать кнопку ""Рассчитать"".
		|   6. Подождать вычисления
		|   7. Следовать инструкциям появившимся в результате вычисления
		|
		|Комментарии к вариантам использования:
		|   1. Отладка запроса:
		|      1.1 Пример запуска: %ТекстСозданияОбработки%.%ИмяМетода1%
		|            где ""Запрос"" - это имя переменной, со значением запроса, который предстоит отладить;
		|            если имя переменной запроса другое, необходимо заменить ""Запрос"" на соответствующее имя переменной с запросом
		|      1.2 Если в пункте 6 инструкции не произошло ошибок, то необходимо дождаться окончания отладки и в режиме предприятия запустить консоль запросов и нажать на кнопку ""Загрузить данные для отладки"".
		|            при этом в список запросов добавится новый запрос(или несколько новых запросов) с заполненными параметрами
		|   2. Печать произвольной коллекции:
		|      2.1 Пример запуска: %ТекстСозданияОбработки%.%ИмяМетода2%
		|            где ""Коллекция"" - это произвольная коллекция одного из следующих типов {ТаблицаЗначений|ДеревоЗначений|СтрокаДереваЗначений|РезультатЗапроса}
		|                ""ДополнительныеПараметры"" - это Необязательный параметр типа структура со следующими необязательными ключами: 
		|                   - ТипФайлаТаблицы              : значение по умолчанию ТипФайлаТабличногоДокумента.MXL (ANSITXT, DOCX, HTML, HTML3, HTML4, HTML5, MXL, MXL7, ODS, PDF, TXT, XLS, XLS95, XLS97, XLSX)
		|                   - ПутьДляВыгрузкиПечатнойФормы : значение по умолчанию - %ПрефиксФайлаСПечатнойФормой% + результат выполнения стандартной функции ПолучитьИмяВременногоФайла() с расширением ""MXL""
		|                                                    ВАЖНО! По префиксу %ПрефиксФайлаСПечатнойФормой% происходит выборка сформированных печатных форм для открытия их в режиме предприятия (см следующий пункт)
		|      2.2 Для загрузки сохраненных файлов в режиме предприятия необходимо нажать на кнопку обработки ""Загрузить сохраненные печатные формы""
		|   3. Сохранение пакета файлов для создания СКД с заданной схемой, заполненными настройками и внешними наборами данных.
		|      Выгружаются следующие файлы: Схема компоновки данных(XML), Настройки компоновки данных(XML), внешние набор данных(DAT)
		|      3.1 Пример запуска: %ТекстСозданияОбработки%.(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ВнешниеНаборыДанных);
		|            где ""СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки()"" - стандартные составляющие СКД
		|                ""ВнешниеНаборыДанных"" - стандартная структура с внешними наборами данных {ИмяНабора|Набор}
		|      3.2 Для загрузки сохраненных файлов в режиме предприятия необходимо нажать на кнопку обработки ""Загрузить сохраненные файлы СКД""
		|      3.3 Сохраненные файлы можно загружать следующими способами:
		|                3.3.1 Схемы и настройки штатными средствами (""загрузить схему из файла"" и ""загрузить настройки из файла""). 
		|                3.3.2 Структура с внешними наборами данных выгружается методом 1С ЗначениеВФайл(ИмяФайла).
		|                      Соответственно для восстановления этих данных необходимо использовать метод ""ЗначениеИзФайла()"".
		|                      Для анализа СКД удобно использовать универсальные обработки - стенды СКД, например эту: https://infostart.ru/public/179939/.
		|                      В аналогичные консоли несложно добавить функционал загрузки внешних наборов данных из сохраненного консолью запросов файла.
		|   4. Сериализация объекта в файл XML:
		|      Указанный объект выгружается во временный каталог в указанный файл. Если файл не указан, то имя файла сформируется автоматически.
		|      4.1 Пример запуска: %ТекстСозданияОбработки%.СохранитьОбъектВФайл(Объект, ""Документ.xml"")
		|      4.2 Для загрузки сохраненных файлов в режиме предприятия необходимо нажать на кнопку обработки ""Загрузить сериализованные объекты""
		|";
	
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПрефиксФайлаСПечатнойФормой%"   , """" + гСтроковыеКонстанты("ПрефиксФайлаСПечатнойФормой") + """");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяМетода0%"                    , "ПомощьПоОтладке()");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяМетода1%"                    , "Отладка(Запрос)");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяМетода2%"                    , "СформироватьПечатнуюФормуКоллекции(Коллекция, Новый Структура(""ТипФайлаТаблицы"", ТипФайлаТабличногоДокумента.XLSX))");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяМетода3%"                    , "СохранитьСКДВФайл(СхемаКомпоновкиДанных, НастройкиКомпоновщикаДанных, ВнешниеНаборыДанных)");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяМетода4%"                    , "СохранитьОбъектВФайл(Объект, ИмяФайла)");
	
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ТекстСозданияОбработки%"        , "ВнешниеОбработки.Создать(""%ПутьКФайлуСОбработкойНаСервере%"", Ложь)");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПутьКФайлуСОбработкойНаСервере%", ПутьКФайлуСОбработкойНаСервере);
	
	Возврат ТекстСообщения;
	
КонецФункции // ПомощьПоОтладке() 

Функция ИмяФайлаКонсолиЗапросовНаСервере(ПутьКФайлуСОбработкойНаКлиенте)
	
	лФайлЛокально  = Новый Файл(ПутьКФайлуСОбработкойНаКлиенте);
	лФайл          = Новый Файл(ПолучитьИмяВременногоФайла(лФайлЛокально.Расширение));

	Возврат лФайл.Путь + лФайлЛокально.Имя;
	
КонецФункции // ИмяФайлаКонсолиЗапросовНаСервере()

Функция СкопироватьОбработкуДляОтладкиНаСервере(Адрес, ПутьКФайлуСОбработкойНаКлиенте) Экспорт
	
	ФайлСОбработкой = ПолучитьИзВременногоХранилища(Адрес);
	лПутьКФайлу     = ИмяФайлаКонсолиЗапросовНаСервере(ПутьКФайлуСОбработкойНаКлиенте);
	
	Попытка
		ФайлСОбработкой.Записать(лПутьКФайлу);
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки; 
	
	Возврат лПутьКФайлу;
	
КонецФункции  // СкопироватьОбработкуДляОтладкиНаСервере()

Функция гСписокФайловНаСервереПоПрефиксу(КаталогВременныхФайлов, ИмяСервера, Префикс) Экспорт
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ИмяСервера             = ИмяКомпьютера();
	
	лМаскаПоиска   = гСтроковыеКонстанты(Префикс) + "*";
	лПечатныеФормы = НайтиФайлы(КаталогВременныхФайлов, лМаскаПоиска, Ложь);	
	
	лСписокПечатныхФорм = Новый Массив;
	Для Каждого ФайлПечатнойФормы Из лПечатныеФормы Цикл
		лСписокПечатныхФорм.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлПечатнойФормы.Имя, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ФайлПечатнойФормы.ПолноеИмя), Новый УникальныйИдентификатор)));
	КонецЦикла;
	
	Возврат лСписокПечатныхФорм;
	
КонецФункции // гСписокФайловНаСервереПоПрефиксу()

#Область ДляРежимаУправляемыхФорм

// для совместимости с другими релизами
Функция ВыгрузитьДанныеДляОтладки(Запрос) Экспорт
	
	Возврат Отладка(Запрос);
	
КонецФункции // ВыгрузитьДанныеДляОтладки() 

Функция СформироватьПечатнуюФормуКоллекции(Коллекция, ДополнительныеПараметры = Неопределено) Экспорт
	
	Перем ЗаголовокКолонки, ФормаПрогрессора, ПутьДляВыгрузкиПечатнойФормы, ТипФайлаТаблицы;
	
	Если ДополнительныеПараметры = Неопределено Тогда 
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	лТипКоллекции = ТипЗнч(Коллекция);
	
	Если НЕ (лТипКоллекции = Тип("РезультатЗапроса") ИЛИ лТипКоллекции = Тип("ТаблицаЗначений") ИЛИ лТипКоллекции = Тип("ДеревоЗначений") ИЛИ лТипКоллекции = Тип("СтрокаДереваЗначений")) Тогда 
		лТекстОшибки = "Операция не доступна для типа %ТипКоллекции%. Доступные типы: {ТаблицаЗначений|ДеревоЗначений|СтрокаДереваЗначений|РезультатЗапроса}.";
		лТекстОшибки = СтрЗаменить(лТекстОшибки, "%ТипКоллекции%", лТипКоллекции);
		Возврат лТекстОшибки
	КонецЕсли;

	Если ТипЗнч(Коллекция) = Тип("РезультатЗапроса") Тогда
		ИсточникДанных = Коллекция.Выгрузить();
	Иначе
		ИсточникДанных = Коллекция;
	КонецЕсли;
	
	ЭтоСтрокаДерева = (ТипЗнч(ИсточникДанных) = Тип("СтрокаДереваЗначений"));
	
	Если ТипЗнч(ИсточникДанных) = Тип("ДеревоЗначений") ИЛИ ЭтоСтрокаДерева Тогда 
		КоличествоСтрок = ИсточникДанных.Строки.Количество();
	Иначе
		КоличествоСтрок = ИсточникДанных.Количество();
	КонецЕсли;
	
	Если КоличествоСтрок = 0 Тогда
		Возврат "Нет данных в коллекции.";
	Иначе
		
		Если ЭтоСтрокаДерева Тогда 
			КолонкиИсточника = Новый Массив;
			Попытка
				ИндексКолонки = 0;
				Пока ИндексКолонки < 1000 Цикл
					ИмяТекущейКолонки      = "Поле" + Формат(ИндексКолонки, "ЧГ=0");
					ЗначениеТекущейКолонки = ИсточникДанных[ИндексКолонки];
					КолонкиИсточника.Добавить(Новый Структура("Имя, Заголовок, Ширина", ИмяТекущейКолонки, ИмяТекущейКолонки, 10));
					ИндексКолонки = ИндексКолонки + 1;
				КонецЦикла;
			Исключение	
			КонецПопытки;
		Иначе
			КолонкиИсточника = ИсточникДанных.Колонки;
		КонецЕсли;
		
		КоличествоКолонок = КолонкиИсточника.Количество();
		
		ТабДок = Новый ТабличныйДокумент;
		
		ДетальнаяСтрока = ТабДок.ПолучитьОбласть(1,,1);
		
		ОбластьОбщихИтогов = ТабДок.ПолучитьОбласть(1,,1);
		ОбластьОбщихИтогов.Область().Шрифт = Новый Шрифт(ОбластьОбщихИтогов.Область().Шрифт,,, Истина);
		
		ОбластьИерархическихЗаписей = ТабДок.ПолучитьОбласть(1,, 1);
		ОбластьИерархическихЗаписей.Область().Шрифт = Новый Шрифт(ОбластьИерархическихЗаписей.Область().Шрифт,,, Истина);
		
		ОбластьГрупповыхЗаписей = ТабДок.ПолучитьОбласть(1,,1);
		ОбластьГрупповыхЗаписей.Область().Шрифт = Новый Шрифт(ОбластьГрупповыхЗаписей.Область().Шрифт,,, Истина);
		
		ОбластьЗаголовка = ТабДок.ПолучитьОбласть(1,, 1);
		
		Для ИндексКолонки = 0 По КоличествоКолонок - 1 Цикл
			Область       = ОбластьЗаголовка.Область(1, ИндексКолонки + 1);
			текКолонка    = КолонкиИсточника[ИндексКолонки];
			Область.Текст = ?(текКолонка.Заголовок = "", текКолонка.Имя, текКолонка.Заголовок);
			Область.ШиринаКолонки = текКолонка.Ширина;
			Если Область.ШиринаКолонки = 0 Тогда 
				Область.ШиринаКолонки = 10
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьЗаголовка);
		
		ОбластьЗаголовка = ТабДок.Область(1, 1, 1, КоличествоКолонок);
		
		ОбластьЗаголовка.Шрифт        = Новый Шрифт(ОбластьЗаголовка.Шрифт, , , Истина, , ,);
		ОбластьЗаголовка.ЦветФона     = Новый Цвет(255, 255, 0);
		ОбластьЗаголовка.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		
		
		#Если НаКлиенте Тогда
		Если ДополнительныеПараметры.Свойство("ФормаПрогрессора", ФормаПрогрессора) Тогда 
			ФормаПрогрессора.Открыть();
			ФормаПрогрессора.ЭлементыФормы.ИндикаторПроцесса.МаксимальноеЗначение = КоличествоСтрок;
			ФормаПрогрессора.НадписьСостоянияИндикатораОбщая = "Формирование печатной формы:";
			ФормаПрогрессора.ЗначениеИндикатора = 1;
			Инд = 1;
		КонецЕсли;
		#КонецЕсли
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДетальнаяСтрока"            , ДетальнаяСтрока);
		СтруктураПараметров.Вставить("ОбластьОбщихИтогов"         , ОбластьОбщихИтогов);
		СтруктураПараметров.Вставить("ОбластьИерархическихЗаписей", ОбластьИерархическихЗаписей);
		СтруктураПараметров.Вставить("ОбластьГрупповыхЗаписей"    , ОбластьГрупповыхЗаписей);
		СтруктураПараметров.Вставить("ОбластьЗаголовка"           , ОбластьЗаголовка);
		СтруктураПараметров.Вставить("КоличествоКолонок"          , КоличествоКолонок);
		
		Если ФормаПрогрессора <> Неопределено Тогда 
			СтруктураПараметров.Вставить("ФормаПрогрессора", ФормаПрогрессора);
		КонецЕсли;
		
		ПечатьКоллекции(ИсточникДанных, ТабДок, СтруктураПараметров);
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		#Если НаКлиенте Тогда
		Если ФормаПрогрессора <> Неопределено Тогда 
			ФормаПрогрессора.Закрыть();
		КонецЕсли;
		#КонецЕсли
		
		ТабДок.ОтображатьСетку = True;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		
		
		#Если НаКлиенте Тогда
		ТабДок.Показать("Результат запроса");
		#Иначе
		Если Не ДополнительныеПараметры.Свойство("ТипФайлаТаблицы", ТипФайлаТаблицы) Тогда 
			ТипФайлаТаблицы = ТипФайлаТабличногоДокумента.MXL;
		КонецЕсли;
		Если Не ДополнительныеПараметры.Свойство("ПутьДляВыгрузкиПечатнойФормы", ПутьДляВыгрузкиПечатнойФормы) Тогда 
			лФайлПечатнойФормы = Новый Файл(ПолучитьИмяВременногоФайла(Строка(ТипФайлаТаблицы)));
			ПутьДляВыгрузкиПечатнойФормы = лФайлПечатнойФормы.Путь + гСтроковыеКонстанты("ПрефиксФайлаСПечатнойФормой") + лФайлПечатнойФормы.Имя;
		КонецЕсли;	
		Попытка
			ТабДок.Записать(ПутьДляВыгрузкиПечатнойФормы, ТипФайлаТаблицы);
			ТекстСообщения = "Коллекция выгрузилась в файл: " + ПутьДляВыгрузкиПечатнойФормы + " на сервер " + ИмяКомпьютера();
		Исключение
			ТекстСообщения = "Ошибка. Коллекция не выгрузилась: " + ОписаниеОшибки();
		КонецПопытки;
		
		Возврат ТекстСообщения
		#КонецЕсли
		
	КонецЕсли;
	
КонецФункции // гСформироватьПечатнуюФормуКоллекции()

Функция СохранитьСКДВФайл(СхемаКомпоновкиДанных, Настройки = Неопределено, ВнешниеНаборыДанных = Неопределено, ПутьКФайлу = Неопределено) Экспорт
	
	Если ПутьКФайлу = Неопределено Тогда 
		лИмяФайла = Новый Файл(ПолучитьИмяВременногоФайла("xml"));
	Иначе
		лИмяФайла = ПутьКФайлу;
	КонецЕсли;
	
	лИмяФайлаСхемы = лИмяФайла.Путь + гСтроковыеКонстанты("ПрефиксФайлаСоСхемойСКД") + лИмяФайла.ИмяБезРасширения + "_схема_" + лИмяФайла.Расширение;
	
	Попытка
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(лИмяФайлаСхемы);
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СхемаКомпоновкиДанных);
		ЗаписьXML.Закрыть();
		
		лТекстИменаФайлов = лИмяФайла.Путь + ": " + лИмяФайлаСхемы;

		Если Настройки <> Неопределено Тогда 
			
			лИмяФайлаНастройки = лИмяФайла.Путь + гСтроковыеКонстанты("ПрефиксФайлаСоСхемойСКД") + лИмяФайла.ИмяБезРасширения + "_настройка_" + лИмяФайла.Расширение;
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.ОткрытьФайл(лИмяФайлаНастройки);
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Настройки);
			ЗаписьXML.Закрыть();
			
			лТекстИменаФайлов = лТекстИменаФайлов + ", " + лИмяФайлаНастройки;
		КонецЕсли;
		
		Если ВнешниеНаборыДанных <> Неопределено Тогда 
			
			лИмяФайлаВНД = лИмяФайла.Путь + гСтроковыеКонстанты("ПрефиксФайлаСоСхемойСКД") + лИмяФайла.ИмяБезРасширения + "_внд_.dat";
			
			ЗначениеВФайл(лИмяФайлаВНД, ВнешниеНаборыДанных);
			
			лТекстИменаФайлов = лТекстИменаФайлов + ", " + лИмяФайлаВНД;
		КонецЕсли;		
		
		ИмяСервера = ПолучитьИмяСервераПоСтрокеСоединения();
		
		Возврат "Данные для отладки выгружены в файл(ы): """ + лТекстИменаФайлов + ?(ИмяСервера = Неопределено, "", """ ( на сервере """ + ИмяСервера + """ )");
		
	Исключение
		Возврат "Ошибка выгрузки данных: " + ОписаниеОшибки();
	КонецПопытки; 

КонецФункции // СохранитьСКДВФайл() 

Функция СохранитьОбъектВФайл(СериализуемыйОбъект, ИмяФайла = "") Экспорт
	
	лФайл = Новый Файл(ПолучитьИмяВременногоФайла("xml"));
	
	ПутьКФайлу = лФайл.Путь + гСтроковыеКонстанты("ПрефиксФайлаССериализованнымОбъектом") + ?(ЗначениеЗаполнено(ИмяФайла), ИмяФайла, лФайл.Имя);
	
	Попытка
		
		ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(СериализуемыйОбъект);
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.ОткрытьФайл(ПутьКФайлу); ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
		ЗаписьXML.Закрыть();
		
		ИмяСервера = ПолучитьИмяСервераПоСтрокеСоединения();
		
		Возврат "Объект выгружен в файл: """ + ПутьКФайлу + ?(ИмяСервера = Неопределено, "", """ ( на сервере """ + ИмяСервера + """ )");
	Исключение
		Возврат "Ошибка выгрузки данных: " + ОписаниеОшибки();
	КонецПопытки;	

КонецФункции // СохранитьОбъектВФайл()

#КонецОбласти

#Область ДляРежимаОбычныхФорм

// для совместимости с другими релизами
Функция ОткрытьФормуДляОтладки(Запрос) Экспорт
	
	Возврат Отладка(Запрос);
	
КонецФункции // ОткрытьФормуДляОтладки(Запрос)

// для совместимости с другими релизами
Функция гОткрытьФормуДляОтладки(Запрос) Экспорт
	
	Возврат ОткрытьФормуДляОтладки(Запрос);
	
КонецФункции // гОткрытьФормуДляОтладки(Запрос)

#КонецОбласти

#КонецОбласти

#Область Обработка_ошибок

Процедура гВывестиОшибкуВыполненияКода(лТекстОшибки, КодДляВыполнения) Экспорт
	
	Сообщить("Текст ошибки: " + лТекстОшибки, СтатусСообщения.Важное);		
	
	Если Найти(лТекстОшибки, "Переменная не определена (ТаблицаРезультата") > 0 Тогда 
		Сообщить("Комментарий к ошибке: в коде используется устаревшая переменная 'ТаблицаРезультата...'. 
		|Замените ее на функцию 'РезультатЗапроса()'", СтатусСообщения.Информация);
	ИначеЕсли Найти(лТекстОшибки, "Переменная не определена (РезультатЗапроса") > 0 Тогда 
		Сообщить("Комментарий к ошибке: в коде используется устаревшая переменная 'РезультатЗапроса...'. 
		|Замените ее на функцию 'РезультатЗапроса()'", СтатусСообщения.Информация);
	КонецЕсли;
	
	Если Найти(КодДляВыполнения, "мФормаПараметров.Параметры.") > 0 Тогда 
		Сообщить("Информация: в коде используется устаревший код 'мФормаПараметров.Параметры.Найти(""..."", ""ИмяПараметра"").ЗначениеПараметра;'. 
		|Замените его на код 'мФормаПараметров.ПараметрыСписок.Найти(""..."", ""Имя"").Значение;'", СтатусСообщения.Информация);
	КонецЕсли;
	
	Если Найти(лТекстОшибки, ": Ошибка при вызове метода контекста (Найти): Неверное имя колонки") > 0 И Найти(КодДляВыполнения, """ИмяПараметра"").Значение") > 0 Тогда
		Сообщить("Комментарий к ошибке: возможно в коде используется устаревший код 'мФормаПараметров.ПараметрыСписок.Найти(""..."", ""ИмяПараметра"").Значение'. 
		|Замените его на код 'мФормаПараметров.ПараметрыСписок.Найти(""..."", ""Имя"").Значение'", СтатусСообщения.Информация);
	КонецЕсли;
	
	Если Найти(лТекстОшибки, ": Поле объекта не обнаружено (ЗначениеПараметра)") > 0 И Найти(КодДляВыполнения, ").ЗначениеПараметра") > 0 Тогда 
		Сообщить("Комментарий к ошибке: возможно в коде используется устаревший код получения значения параметра запроса ').ЗначениеПараметра'. 
		|Замените его на код ').Значение'", СтатусСообщения.Информация);
	КонецЕсли;
	
	Если Найти(лТекстОшибки, "Переменная не определена (гПолучитьЗначениеСпискаБезУчетаРегистра)") > 0 Тогда 
		Сообщить("Комментарий к ошибке: в коде используется устаревший вызов функции 'гПолучитьЗначениеСпискаБезУчетаРегистра'.
		|Замените ее на функцию 'гПолучитьПараметр'", СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры // гВывестиОшибкуВыполненияКода()

#КонецОбласти

#Область Работа_с_облаком

Функция НеИспользуется__СтруктураURI(Знач СтрокаURI)
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере    = "";
	ИмяСкрипта       = "";
	ПараметрыСкрипта = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
		Позиция = Найти(ПутьНаСервере, "?");
		Если Позиция > 0 Тогда
			ИмяСкрипта       = Лев(ПутьНаСервере, Позиция - 1);
			ПараметрыСкрипта = "&" + Сред(ПутьНаСервере, Позиция + 1);
		КонецЕсли;
	КонецЕсли;
	
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема"           , Схема);
	Результат.Вставить("Логин"           , Логин);
	Результат.Вставить("Пароль"          , Пароль);
	Результат.Вставить("ИмяСервера"      , ИмяСервера);
	Результат.Вставить("Хост"            , Хост);
	Результат.Вставить("Порт"            , ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере"   , ПутьНаСервере);
	Результат.Вставить("ИмяСкрипта"      , ИмяСкрипта);
	Результат.Вставить("ПараметрыСкрипта", ПараметрыСкрипта);
	
	Возврат Результат;
	
КонецФункции

Функция гПоискВОблаке(соединение, строкаПоиска, искатьВЗапросах, искатьВАлгоритмах, искатьВНазвании, искатьВТексте, началоПоиска, НастройкиПрокси) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/find.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&str=" + строкаПоиска + "&inText=" + ?(искатьВТексте, 1, 0) + "&inName=" + ?(искатьВНазвании, 1,0) + "&inCode=" + ?(искатьВАлгоритмах, 1,0) + "&inQuery=" + ?(искатьВЗапросах, 1,0) + "&startRecord=" + началоПоиска + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка подключения к сервису", 
			"Ошибка подключения к сервису: 
				|Произошла сетевая ошибка. (" + ОписаниеОшибки() + ")
				|Попробуйте еще раз через некоторое время.");
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);

		Результат.Вставить("Статус"              , лДанные.status);
		Результат.Вставить("ДанныеИзОблака"      , лДанные.data);
		Результат.Вставить("МожноПродолжитьПоиск", лДанные.isEnd = 0);
		Результат.Вставить("ТекстОшибки"         , лДанные.errors);
	Исключение
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"     , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки", ТекстОшибки);
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПоискВОблаке()

Функция гПоискВFastСode(СтрокаПоиска, НастройкиПоиска, НастройкиПрокси) Экспорт 
	
	HTTPСоединение = ПолучитьHTTPСоединение("fastcode.im", НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	//Формируем строку: {"V8DataVersion":"2","Request":"{\"SearchString\":\"АктуальныеСимволыПрепроцессора\"}"}
	//{"ApiKey":null,"ClientVersion":"5.14.7580.23769","ConfVersion":null,"PlatformVersion":null,"V8DataVersion":"2","Request":"{\"SearchString\":\"РѕР±РјРµРЅРґР°РЅРЅС‹РјРёРІРјРѕРґРµР»РёСЃРµСЂРІРёСЃР°\",
	//\"Favorites\":true,\"Bsp\":true,\"Edu\":false,\"Store\":true,\"Sandbox\":false,\"Qa\":false}"}
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,,,,,,Истина)); // экранируем одинарные кавычки

	ЗаписьJSON1 = Новый ЗаписьJSON;
	ЗаписьJSON1.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON1.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,,,,,,Истина)); // экранируем одинарные кавычки
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("SearchString", СтрокаПоиска);
	ПараметрыЗапроса.Вставить("Bsp"         , НастройкиПоиска.Bsp);
	//ПараметрыЗапроса.Вставить("Favorites"   , НастройкиПоиска.Favorites);
	//ПараметрыЗапроса.Вставить("Store"       , Истина);
	//ПараметрыЗапроса.Вставить("Edu"         , Истина);
	//ПараметрыЗапроса.Вставить("Sandbox"     , Истина);
	//ПараметрыЗапроса.Вставить("Qa"          , Истина);

	//СтруктураПоиска = Новый Структура("V8DataVersion", "2");
	//СтруктураПоиска.Вставить("Request", ПараметрыЗапроса);
	
	ЗаписатьJSON(ЗаписьJSON1, ПараметрыЗапроса, Новый НастройкиСериализацииJSON);
	ЗаписатьJSON(ЗаписьJSON, Новый структура("V8DataVersion, Request", "2", ЗаписьJSON1.Закрыть()), Новый НастройкиСериализацииJSON);
	
	СтрокаПоискаJSON = СтрЗаменить(ЗаписьJSON.Закрыть(), "\r\n", "");
	СтрокаПоискаJSON = СтрЗаменить(СтрокаПоискаJSON, Символы.ВК, "");
	СтрокаПоискаJSON = СтрЗаменить(СтрокаПоискаJSON, Символы.ПС, "");

	HTTPЗапрос = Новый HTTPЗапрос("/Api/Search", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&InputData=" + СтрокаПоискаJSON;
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка подключения к сервису", 
			"Ошибка подключения к сервису: 
				|Произошла сетевая ошибка. (" + ОписаниеОшибки() + ")
				|Попробуйте еще раз через некоторое время.");
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	
	Попытка
		
		лДанные = ПрочитатьJSON(ОтветJSON);
		
		JSONСДаннымиСервиса = Новый ЧтениеJSON;
		JSONСДаннымиСервиса.УстановитьСтроку(лДанные.Content);
		лДанныеСервиса = ПрочитатьJSON(JSONСДаннымиСервиса);
		
		Результат.Вставить("Статус", лДанные.StatusCode);
		Результат.Вставить("Данные", лДанныеСервиса);
	Исключение
		
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"     , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки", ТекстОшибки);
	КонецПопытки; 
	
	Возврат Результат;	
	
КонецФункции // гПоискВFastСode()

Функция гВосстановитьНастройкиПараметровПодключения() Экспорт

    Перем СохраненноеЗначение;

    ключОбъекта      = "Обработка.consquery83";
    ключНастроек     = "Обработка.consquery83.ФормаПодключенияПоследниеЗначения";
    описаниеНастроек = "ПоследниеЗначения";
    имяПользователя  = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;

    ЗначениеНастроек = ХранилищеОбщихНастроек.Загрузить(ключОбъекта, ключНастроек, описаниеНастроек, имяПользователя);
    Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
        СохраненноеЗначение = ЗначениеНастроек.Получить("ФормаПодключенияПоследниеЗначения");
    КонецЕсли;

    Возврат СохраненноеЗначение

КонецФункции // ВосстановитьНастройкиПараметровПодключения()

#Если ТолстыйКлиентОбычноеПриложение Тогда
Функция гВосстановитьИдентификаторСессииConsqueryCloud() Экспорт 
	Возврат ВосстановитьЗначение("Consquery_cloud_ИдентификаторСессии");
КонецФункции // гВосстановитьИдентификаторСессииConsqueryCloud()

&НаКлиенте
Функция гВосстановитьНастройкиПрокси() Экспорт 
	лИмяКонстанты = "Consquery_cloud_НастройкиПрокси";
	лСохраненныеНастройкиПрокси = ВосстановитьЗначение(лИмяКонстанты);	
	Если лСохраненныеНастройкиПрокси = Неопределено Тогда 
		Возврат гСтруктураНастроекПрокси();
	Иначе
		Возврат лСохраненныеНастройкиПрокси;
	КонецЕсли;
КонецФункции // гВосстановитьНастройкиПрокси

#Иначе
Функция гВосстановитьИдентификаторСессииConsqueryCloud() Экспорт 
	
	Перем лИдентификаторСессии;
	лСохраненныеЗначения = гВосстановитьНастройкиПараметровПодключения();
	Если ТипЗнч(лСохраненныеЗначения) = Тип("Структура") Тогда 
		лСохраненныеЗначения.Свойство("ИдентификаторСессии", лИдентификаторСессии);
	КонецЕсли;
	
	Возврат лИдентификаторСессии;
	
КонецФункции // гВосстановитьИдентификаторСессииConsqueryCloud()

Функция гВосстановитьНастройкиПрокси() Экспорт 
	
	Перем лНастройкиПрокси;
	//#рефакторинг
	// добавить механизм восстановления настроек прокси
	//лСохраненныеЗначения = гВосстановитьНастройкиПараметровПодключения();
	// если ТипЗнч(лСохраненныеЗначения) = Тип("Структура") Тогда 
	//	лСохраненныеЗначения.Свойство("Consquery_cloud_НастройкиПрокси", лНастройкиПрокси);
	// конецЕсли;
	
	Возврат лНастройкиПрокси;
	
КонецФункции // гВосстановитьНастройкиПрокси

#КонецЕсли

Функция гПолучитьЗапросыИзОблака(соединение, идПакетаВОблаке, идЗапроса, идСтрокиКода, включатьПодчиненные, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/getQuerys.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&idPackage=" + идПакетаВОблаке + "&idQuery=" + идЗапроса + "&idCode=" + идСтрокиКода + "&addChilds=" + ?(включатьПодчиненные, "1", "0") + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки, НеобходимоПереподключиться", "Ошибка подключения к сервису", 
			"Ошибка подключения к сервису: 
				|Произошла сетевая ошибка. (" + ОписаниеОшибки() + ")
				|Попробуйте еще раз через некоторое время.", Истина);
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);

		Результат.Вставить("Статус"                    , лДанные.status);
		Результат.Вставить("Данные"                    , лДанные.data);
		Результат.Вставить("ТекстОшибки"               , лДанные.errors);
		Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);		
	Исключение

		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"                    , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки"               , ТекстОшибки);
		Результат.Вставить("НеобходимоПереподключиться", Истина);		
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПолучитьЗапросыИзОблака()

Функция гПолучитьДанныеДляПревьюИзОблака(соединение, идПакетаВОблаке, идЗапроса, идСтрокиКода, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/getPreview.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&idPackage=" + идПакетаВОблаке + "&idQuery=" + идЗапроса + "&idCode=" + идСтрокиКода + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка подключения к сервису", 
			"Ошибка подключения к сервису: 
				|Произошла сетевая ошибка. (" + ОписаниеОшибки() + ")
				|Попробуйте еще раз через некоторое время.");
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ДанныеИзОблака, ТекстОшибки", лДанные.status, лДанные.data, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гПолучитьДанныеДляПревьюИзОблака()

Функция гДобавитьНовыйПакетЗапросовВОблако(соединение, ИмяПакета, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/addPackage.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&name=" + ИмяПакета + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ИдФайлаВОблаке, ТекстОшибки, ", лДанные.status, лДанные.errors, лДанные.idPackage);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гДобавитьНовыйПакетЗапросовВОблако()

Функция гОпубликоватьВОблаке(соединение, email, идПакетаВОблаке, идЗапроса, идСтрокиКода, включатьПодчиненные, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/createLink.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&sharedUser=" + email + "&idPackage=" + идПакетаВОблаке + "&idQuery=" + идЗапроса + "&idCode=" + 
		идСтрокиКода + "&addChilds=" + ?(включатьПодчиненные, "1", "0") + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ТекстОшибки, ", лДанные.status, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гОпубликоватьВОблаке()

Функция гУдалитьФайлыСЗапросамиВОблаке(соединение, списокИдВОблаке, НастройкиПрокси = Неопределено) Экспорт // #рефакторинг Переименовать гУдалитьФайлыСЗапросамиВОблаке и аналогичные в соответственно гУдалитьПакетыСЗапросамиВОблаке и пр.
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/delPackages.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&idList=" + списокИдВОблаке + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, Информация, ТекстОшибки", лДанные.status, лДанные.info, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гУдалитьФайлыСЗапросамиВОблаке()

Функция гУдалитьЭлементыПоСпискуВОблаке(соединение, идПакета, списокИдЗапросовВОблаке, списокИдКодаВОблаке, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/delList.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&idPackage=" + идПакета + "&idListQuerys=" + списокИдЗапросовВОблаке + "&idListCodes=" + списокИдКодаВОблаке + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, Информация, ТекстОшибки", лДанные.status, лДанные.info, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гУдалитьЭлементыПоСпискуВОблаке()

Функция гСохранитьФайлСЗапросомВОблаке(соединение, идВОблаке, имя, обновлятьВсеЗаписи, Знач данные, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/savePackage.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = 
		"&idConnection=" + соединение + 
		"&idPackage=" + ?(идВОблаке = гИдентификаторНовогоОбъектаВОблаке(), "", идВОблаке)+ 
		"&name=" + имя + 
		"&data=" + данные + 
		"&updateALL=" + ?(обновлятьВсеЗаписи, "1", "0") + 
		"&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ИдФайлаВОблаке, ТекстОшибки", лДанные.status, лДанные.idPackage, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гСохранитьФайлСЗапросомВОблаке()

Функция гСохранитьЗапросыВОблаке(соединение, идПакета, идРодительскогоЗапроса, ИдЗапроса, имя, включатьПодчиненныеЗапросы, Знач данные, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/saveQuery.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + 
		"&idPackage=" + идПакета + 
		"&idQuery=" + ?(ИдЗапроса = гИдентификаторНовогоОбъектаВОблаке(), Новый УникальныйИдентификатор, ИдЗапроса) + 
		"&idParentQuery=" + ?(ЗначениеЗаполнено(идРодительскогоЗапроса), идРодительскогоЗапроса, null) + 
		"&saveWithHierarchy=" + ?(ВключатьПодчиненныеЗапросы, "1", "0") + 
		"&data=" + данные + 
		"&V8x=""OK""";
	
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ТекстОшибки", лДанные.status, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гСохранитьЗапросыВОблаке()

Функция гСохранитьКодВОблаке(соединение, идПакета, ИдЗапроса, ИдКода, Имя, текст, НастройкиПрокси = Неопределено) Экспорт
	
	данные = СтрЗаменить(данные, "%", "\u0025");
	данные = СтрЗаменить(данные, "+", "\u002B");
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/saveCode.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + 
		"&idPackage=" + идПакета + 
		"&idQuery=" + ИдЗапроса + 
		"&idCode=" + ?(ИдКода = гИдентификаторНовогоОбъектаВОблаке(), Новый УникальныйИдентификатор, ИдКода) + 
		"&name=" + имя + 
		"&text=" + текст + 
		"&V8x=""OK""";
	
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;                                                                                   
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		лДанныеИзОблака = Новый Структура("Статус, ТекстОшибки", лДанные.status, лДанные.errors);
	Исключение
		лДанныеИзОблака =  Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
	Возврат лДанныеИзОблака
	
КонецФункции // гСохранитьКодВОблаке()

Функция гПолучитьСписокПакетовИЛИЗапросовВОблакеПоИсторииИспользования(соединение, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/getLastUseQuerys.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		Если лДанные.Свойство("listPackages") Тогда 
			Результат.Вставить("Статус"                    , лДанные.status);
			Результат.Вставить("СписокПакетов"             , лДанные.listPackages);
			Результат.Вставить("ТекстОшибки"               , лДанные.errors);
			Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);
			Результат.Вставить("ЭтоСписокПакетов"          , Истина);
		ИначеЕсли лДанные.Свойство("list") Тогда 
			Результат.Вставить("Статус"                    , лДанные.status);
			Результат.Вставить("Список"                    , лДанные.list);
			Результат.Вставить("ПутьКРодителю"             , лДанные.path);
			Результат.Вставить("идПакета"                  , лДанные.idPackage);
			Результат.Вставить("ИмяПакета"                 , лДанные.packageName);
			Результат.Вставить("ТекстОшибки"               , лДанные.errors);
			Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);
			Результат.Вставить("ЭтоСписокПакетов"          , Ложь);
		Иначе
			Результат.Вставить("Статус"                    , "Ошибка получения списка объектов в облаке");
			Результат.Вставить("ТекстОшибки"               , лДанные.errors);
			Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);
		КонецЕсли;
	Исключение
		
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"                    , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки"               , ТекстОшибки);
		Результат.Вставить("НеобходимоПереподключиться", Истина);		
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПолучитьСписокПакетовИЛИЗапросовВОблакеПоИсторииИспользования()

Функция гПолучитьСписокПакетовВОблаке(соединение, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/getListPackages.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		
		Результат.Вставить("Статус"                    , лДанные.status);
		Результат.Вставить("СписокПакетов"             , лДанные.listPackages);
		Результат.Вставить("ТекстОшибки"               , лДанные.errors);
		Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);
	Исключение
		
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"                    , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки"               , ТекстОшибки);
		Результат.Вставить("НеобходимоПереподключиться", Истина);		
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПолучитьСписокПакетовВОблаке()

Функция гПолучитьСписокЗапросовВОблаке(соединение, идПакета, идРодителя, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/getListQuerys.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&idPackage=" + идПакета + "&idParent=" + идРодителя + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);                                                                                                                                                                                                
		
		Результат.Вставить("Статус"                    , лДанные.status);
		Результат.Вставить("Список"                    , лДанные.list);
		Результат.Вставить("ПутьКРодителю"             , лДанные.path);
		Результат.Вставить("идПакета"                  , лДанные.idPackage);
		Результат.Вставить("ИмяПакета"                 , лДанные.packageName);
		Результат.Вставить("ТекстОшибки"               , лДанные.errors);
		Результат.Вставить("НеобходимоПереподключиться", лДанные.errConnect = 1);
	Исключение
		
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"                    , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки"               , ТекстОшибки);
		Результат.Вставить("НеобходимоПереподключиться", Истина);
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПолучитьСписокЗапросовВОблаке()

Функция гПолучитьИмяПодключенногоПользователяВОблаке(соединение, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/testConnection.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Сетевая ошибка", "Произошла сетевая ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		Возврат Новый Структура("Статус, ИмяПользователя, ТекстОшибки", лДанные.status, лДанные.user, лДанные.errors);
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
КонецФункции // гПолучитьИмяПодключенногоПользователяВОблаке()

Функция гЗарегистрироватьВОблаке(соединение, email, пароль, УстановкаНовогоПароля = Ложь, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/register.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&email=" + email + "&password=" + пароль + "&resetpassword=" + ?(УстановкаНовогоПароля, 1, 0) + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		Возврат Новый Структура("Статус, Информация, ТекстОшибки", лДанные.status, лДанные.info, лДанные.errors);
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
КонецФункции // гЗарегистрироватьВОблаке()

Функция гПодключитьКОблаку(соединение, email, пароль, тестирование = Ложь, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/login.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&email=" + email + "&password=" + пароль + "&test=" + ?(тестирование, 1, 0) + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	
	Результат = Новый Структура();
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		
		Результат.Вставить("Статус"     , лДанные.status);
		Результат.Вставить("Информация" , лДанные.info);
		Результат.Вставить("ТекстОшибки", лДанные.errors);
		Результат.Вставить("Соединение" , лДанные.idConnection);				
	Исключение
		
		ТекстОшибки = "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">";
		
		Результат.Вставить("Статус"     , "Ошибка чтения JSON");
		Результат.Вставить("ТекстОшибки", ТекстОшибки);
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции // гПодключитьКОблаку()

Функция гОтключитьсяОтОблака(соединение, НастройкиПрокси = Неопределено) Экспорт
	
	HTTPСоединение = ПолучитьHTTPСоединение(ПутьКОблаку(), НастройкиПрокси);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPЗапрос = Новый HTTPЗапрос("/logout.php", ЗаголовкиHTTP);
	лПараметрыЗапроса = "&idConnection=" + соединение + "&V8x=""OK""";
	HTTPЗапрос.УстановитьТелоИзСтроки(лПараметрыЗапроса);
	
	Попытка
		HTTPОтвет =  HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);        	
	Исключение
		Сообщить("Произошла сетевая ошибка! (" + ОписаниеОшибки() + ")");
		ВызватьИсключение;
	КонецПопытки;
	
	лТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветJSON = Новый ЧтениеJSON;
	ОтветJSON.УстановитьСтроку(лТелоОтвета);
	Попытка
		лДанные = ПрочитатьJSON(ОтветJSON);
		Возврат Новый Структура("Статус, Информация, ТекстОшибки", лДанные.status, лДанные.info, лДанные.errors);
	Исключение
		Возврат Новый Структура("Статус, ТекстОшибки", "Ошибка чтения JSON", "Ошибка чтения ответа от сервиса: " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: <" + Лев(лТелоОтвета, 999) +">");
	КонецПопытки; 
	
КонецФункции // гОтключитьсяОтОблака()

#КонецОбласти

#Область РаботаСВерсиями

Функция гСравнитьВерсии(Знач СтрокаВерсии1 = Неопределено, СтрокаВерсии2) Экспорт
	
	Если СтрокаВерсии1 = Неопределено Тогда 
		лСистемнаяИнформация = Новый СистемнаяИнформация();
		СтрокаВерсии1        = лСистемнаяИнформация.ВерсияПриложения;
	КонецЕсли;
	
	Если Метаданные.РежимСовместимости <> Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда 
		Возврат -1;
	КонецЕсли;
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = гРазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение гПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = гРазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение гПодставитьПараметрыВСтроку(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	РезультатСравнения = 0;
	Для Разряд = 0 По 3 Цикл
		РезультатСравнения = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если РезультатСравнения <> 0 Тогда
			Возврат РезультатСравнения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатСравнения;
	
КонецФункции // гСравнитьВерсии()

#КонецОбласти

#Область РаботаСМеню

Функция гНажатиеНаКнопкуВыборМенюИнформация(ИмяКнопки, ТолькоВернутьКоманду = Ложь) Экспорт
	
	Если ИмяКнопки = "ИнформацияСайтАвтора" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://www.lavelin.ru";
	ИначеЕсли ИмяКнопки = "ИнформацияСписокИзменений" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://lavelin.ru/changelog.html";
	ИначеЕсли ИмяКнопки = "ИнформацияОтправитьОтзыв" Тогда
		ТекстКоманды = "mailto:1c@lavelin.ru?subject=" + ПреобразоватьВUniCode(гНазваниеОбработки());
	ИначеЕсли ИмяКнопки = "ИнформацияRSS" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://lavelin.ru/rss_1c.html";
	ИначеЕсли ИмяКнопки = "ИнформацияДругиеРазработкиАвтора" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://lavelin.ru/other_my_programs.html";
	ИначеЕсли ИмяКнопки = "ИнформацияDonate" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://lavelin.ru/paid.html";		
	ИначеЕсли ИмяКнопки = "ИнформацияFugueIcons" Тогда
		ТекстКоманды = "RunDll32.exe url.dll, FileProtocolHandler http://p.yusukekamiyamane.com/";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТолькоВернутьКоманду Тогда 
		Возврат ТекстКоманды
	Иначе
		ЗапуститьПриложение(ТекстКоманды)
	КонецЕсли;
	
КонецФункции // гНажатиеНаКнопкуВыборМенюИнформация()

&НаКлиенте
// ПРОЦЕДУРА ДУБЛЬ(!!!)
Функция гЗаполнитьМенюПоДереву(Родитель, Знач Индекс, ДеревоМенюКнопки) Экспорт
	
	Для каждого ТекСтрока Из ДеревоМенюКнопки.Строки Цикл
		
		Если Родитель.Кнопки.Найти(ТекСтрока.Имя) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Индекс = Неопределено Тогда 
			лКомандаДобавленияКнопки = "Родитель.Кнопки.Добавить(";
		Иначе
			лКомандаДобавленияКнопки = "Родитель.Кнопки.Вставить(Индекс, ";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Действие) Тогда
			Кнопка = Вычислить(лКомандаДобавленияКнопки + "ТекСтрока.Имя, ?(ЗначениеЗаполнено(ТекСтрока.Название), ТипКнопкиКоманднойПанели.Подменю, ТипКнопкиКоманднойПанели.Разделитель), ТекСтрока.Название, )");
		Иначе
			Кнопка = Вычислить(лКомандаДобавленияКнопки + "ТекСтрока.Имя, ТипКнопкиКоманднойПанели.Действие, ТекСтрока.Название, Новый Действие(ТекСтрока.Действие))");
		КонецЕсли;
		
		Если ТекСтрока.СочетаниеКлавиш <> Неопределено Тогда
			Кнопка.СочетаниеКлавиш = ТекСтрока.СочетаниеКлавиш;
		КонецЕсли;
		
		Если ТекСтрока.Картинка <> Неопределено Тогда 
			Кнопка.Картинка = ТекСтрока.Картинка;
		КонецЕсли;
		
		Кнопка.Текст = ТекСтрока.Название;
		
		Если ТекСтрока.Строки.Количество() > 0 Тогда
			гЗаполнитьМенюПоДереву(Кнопка, Неопределено, ТекСтрока)
		КонецЕсли;	
		
	КонецЦикла; 
	
	Возврат Кнопка
	
КонецФункции // гЗаполнитьМенюПоДереву()

Функция ПолучитьКолонкиМеню()
	
	лКолонки = Новый Массив;
	лКолонки.Добавить("Имя");
	лКолонки.Добавить("Название");
	лКолонки.Добавить("Действие");
	лКолонки.Добавить("СочетаниеКлавиш");
	лКолонки.Добавить("Картинка");
	
	Возврат лКолонки
	
КонецФункции // ПолучитьКолонкиМеню()
 
Функция ПолучитьМенюСписком(ДеревоМеню, Список = Неопределено) Экспорт
	
	Если Список = Неопределено Тогда 
		Список = Новый СписокЗначений;
	КонецЕсли;
	
	лКолонкиДереваМеню = ПолучитьКолонкиМеню();
	Для каждого ВеткаМеню Из ДеревоМеню.Строки Цикл
		лПунктМеню = Новый Структура;
		Для каждого ИмяКолонки Из лКолонкиДереваМеню Цикл
			лПунктМеню.Вставить(ИмяКолонки);
		КонецЦикла; 
		ЗаполнитьЗначенияСвойств(лПунктМеню, ВеткаМеню);
		Список.Добавить(лПунктМеню);
		ПолучитьМенюСписком(ВеткаМеню, Список)
	КонецЦикла; 
	
	Возврат Список

КонецФункции // ПолучитьМенюСписком()

// Функция возвращает дерево для формирования меню с действиями над результатом запроса
//
// Параметры
//  ИмяМеню - Булево  - 
//  ДляУправляемойФормы - Булево
//
// Возвращаемое значение:
//   <ДеревоЗначений> - 
//
Функция гПолучитьМеню(ИмяМеню, ДляУправляемойФормы, ВВидеСписка, ПутьКАртинке = Неопределено) Экспорт
	
	лМеню = Новый ДеревоЗначений;
	лМеню.Колонки.Добавить("Имя");
	лМеню.Колонки.Добавить("Название");
	лМеню.Колонки.Добавить("Действие");
	лМеню.Колонки.Добавить("СочетаниеКлавиш");
	лМеню.Колонки.Добавить("Картинка");
	
	Если ИмяМеню = "ПредустановленныйКод" Тогда
		
		КореньМеню           = лМеню.Строки.Добавить();
		КореньМеню.Название = "Предустановленный код";
		КореньМеню.Имя      = "КнопкаМенюПредустановленныйКод";
		КореньМеню.Картинка = Новый Картинка(ПолучитьМакет("Картинка_ПредустановленныйКод"), Истина);
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Редактировать регистр сведений";
		НоваяСтрока.Имя      = "ПредустановленныйКодРедактироватьРегистрСведений";
		НоваяСтрока.Действие = "ПредустановленныйКодРедактироватьРегистрСведений";
		НоваяСтрока.Картинка = БиблиотекаКартинок.РегистрСведений;
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Редактировать документы";
		НоваяСтрока.Имя      = "ПредустановленныйКодРедактироватьДокументы";
		НоваяСтрока.Действие = "ПредустановленныйКодРедактироватьДокументы";
		НоваяСтрока.Картинка = БиблиотекаКартинок.Документ;
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Редактировать справочники";
		НоваяСтрока.Имя      = "ПредустановленныйКодРедактироватьСправочники";
		НоваяСтрока.Действие = "ПредустановленныйКодРедактироватьСправочники";
		НоваяСтрока.Картинка = БиблиотекаКартинок.Справочник;
		
		Если Не ДляУправляемойФормы Тогда 
			
			НоваяСтрока          = КореньМеню.Строки.Добавить();
			НоваяСтрока.Название = "Подключить базу";
			НоваяСтрока.Имя      = "ПредустановленныйКодПодключитьБазу";
			НоваяСтрока.Действие = "ПредустановленныйКодПодключитьБазу";
			НоваяСтрока.Картинка = Новый Картинка(ПолучитьМакет("Картинка_ПодключитьБазу"), Истина);
			
		КонецЕсли;
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Вставить цикл";
		НоваяСтрока.Имя      = "ПредустановленныйКодВставитьЦикл";
		НоваяСтрока.Действие = "ПредустановленныйКодВставитьЦикл";
		НоваяСтрока.Картинка = Новый Картинка(ПолучитьМакет("Картинка_ВставитьЦикл"), Истина);
		
		Если Не ДляУправляемойФормы Тогда 			
			НоваяСтрока          = КореньМеню.Строки.Добавить();
			НоваяСтрока.Название = "Перенумеровать справочник";
			НоваяСтрока.Имя      = "ПредустановленныйКодПеренумероватьСправочник";
			НоваяСтрока.Действие = "ПредустановленныйКодПеренумероватьСправочник";
			НоваяСтрока.Картинка = Новый Картинка(ПолучитьМакет("Картинка_ПеренумероватьСправочник"), Истина);
			
			НоваяСтрока          = КореньМеню.Строки.Добавить();
			НоваяСтрока.Название = "Добавить результат запроса в параметр";
			НоваяСтрока.Имя      = "ПредустановленныйКодДобавитьРезультатЗапросаВПараметр";
			НоваяСтрока.Действие = "ПредустановленныйКодДобавитьРезультатЗапросаВПараметр";
			НоваяСтрока.Картинка = Новый Картинка(ПолучитьМакет("Картинка_ДобавитьПараметрТЗ"), Истина);
			
			НоваяСтрока          = КореньМеню.Строки.Добавить();
			НоваяСтрока.Имя      = "ПредустановленныйКодРазделитель";
			
			НоваяСтрока          = КореньМеню.Строки.Добавить();
			НоваяСтрока.Название = "Выбрать значение параметра";
			НоваяСтрока.Имя      = "ПредустановленныйКодВыбратьЗначениеПараметра";
			НоваяСтрока.Действие = "ПредустановленныйКодВыбратьЗначениеПараметра";
		КонецЕсли;
		
	ИначеЕсли ИмяМеню = "Сервис" Тогда
		
		МенюСервис = лМеню.Строки.Добавить();
		МенюСервис.Название = "Сервис";
		МенюСервис.Имя = "КнопкаМенюСервис";
		
		// Пункт "Сервис - Действие с результатом запроса"
		НоваяСтрока = МенюСервис.Строки.Добавить();
		НоваяСтрока.Название = "Действие с результатом запроса";
		НоваяСтрока.Имя = "СервисДействиеСРезультатомЗапроса";
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Провести документы";
		Уровень2.Имя      = "СервисПровестиДокументы";
		Уровень2.Действие = "КнопкаМенюСервисПровестиДокументы";
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Отменить проведение";
		Уровень2.Имя      = "СервисОтменитьПроведение";
		Уровень2.Действие = "КнопкаМенюСервисОтменитьПроведение";
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Установить пометку удаления";
		Уровень2.Имя      = "СервисУстановитьПометкуУдаления";
		Уровень2.Действие = "КнопкаМенюСервисУстановитьПометкуУдаления";
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Снять пометку удаления";
		Уровень2.Имя      = "СервисСнятьПометкуУдаления";
		Уровень2.Действие = "КнопкаМенюСервисСнятьПометкуУдаления";
			
		Если Не ДляУправляемойФормы Тогда 
			Уровень2     = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя = "КнопкаМенюДействиеСРезультатомЗапросаРазделитель1";
			
			Уровень2                 = НоваяСтрока.Строки.Добавить();
			Уровень2.Название        = "Перейти к следующему значению";
			Уровень2.Имя             = "СервисПерейтиКСледующемуЗначению";
			Уровень2.Действие        = "КнопкаМенюСервисСервисПерейтиКСледующемуЗначению";
			Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F3, Истина,Истина);						
		КонецЕсли;
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Выгрузить результат запроса в параметр";
		Уровень2.Имя      = "СервисВыгрузитьРезультатЗапросаВПараметр";
		Уровень2.Действие = "КнопкаМенюСервисВыгрузитьРезультатЗапросаВПараметр";
		
		Если Не ДляУправляемойФормы Тогда 
			
			Уровень2                 = НоваяСтрока.Строки.Добавить();
			Уровень2.Название        = "Выполнить код";
			Уровень2.Имя             = "СервисВыполнитьКод";
			Уровень2.Действие        = "КнопкаМенюСервисВыполнитьКод";
			Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F5);			
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Печать результата запроса";
			Уровень2.Имя      = "СервисПечатьРезультатаЗапроса";
			Уровень2.Действие = "КнопкаМенюСервисПечатьРезультатаЗапроса";
			
			Уровень2                 = НоваяСтрока.Строки.Добавить();
			Уровень2.Название        = "Печать данных таблицы";
			Уровень2.Имя             = "СервисПечатьДанныхТаблицы";
			Уровень2.Действие        = "КнопкаМенюСервисПечатьДанныхТаблицы";
			Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.P,,Истина);			
			
			Уровень2     = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя = "СервисДействиеСРезультатомЗапросаРазделитель2";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Поиск ссылок на объекты";
			Уровень2.Имя      = "СервисПоискСсылок";
			Уровень2.Действие = "КнопкаМенюСервисПоискСсылок";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Поиск ссылок на объекты (в глобальную структуру)";
			Уровень2.Имя      = "СервисПоискСсылокВСтруктуру";
			Уровень2.Действие = "КнопкаМенюСервисПоискСсылокВСтруктуру";
			
		КонецЕсли;
		
		Уровень2     = НоваяСтрока.Строки.Добавить();
		Уровень2.Имя = "СервисДействиеСРезультатомЗапросаРазделитель3";
			
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Выгрузить в DBF";
		Уровень2.Имя      = "СервисВыгрузкаВDBF";
		Уровень2.Действие = "КнопкаМенюСервисВыгрузкаВDBF";
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Выгрузить объекты в XML";
		Уровень2.Имя      = "СервисВыгрузкаВXML";
		Уровень2.Действие = "КнопкаМенюСервисВыгрузкаВXML";
			
		Если Не ДляУправляемойФормы Тогда 
			
			Уровень2     = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя = "СервисРазделитель1";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Показать диаграмму";
			Уровень2.Имя      = "СервисПоказатьДиаграмму";
			Уровень2.Действие = "КнопкаМенюСервисПоказатьДиаграмму";
			
			// Пункт "Сервис - Настройки колонок"
			НоваяСтрока          = МенюСервис.Строки.Добавить();
			НоваяСтрока.Название = "Настройки колонок";
			НоваяСтрока.Имя      = "СервисНастройкиКолонок";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Запомнить ширину колонок";
			Уровень2.Имя      = "СервисЗапомнитьШиринуКолонок";
			Уровень2.Действие = "КнопкаМенюСервисЗапомнитьШиринуКолонок";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Просмотреть текущие ширины колонок";
			Уровень2.Имя      = "СервисПросмотретьТекущиеШириныКолонок";
			Уровень2.Действие = "КнопкаМенюСервисПросмотретьТекущиеШириныКолонок";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Сохранить текущие ширины колонок по умолчанию";
			Уровень2.Имя      = "СервисСохранитьТекущиеШириныКолонокПоУмолчанию";
			Уровень2.Действие = "КнопкаМенюСервисСохранитьТекущиеШириныКолонокПоУмолчанию";
			
			Уровень2     = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя = "СервисНастройкиКолонокРазделитель1";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Восстановить ширины колонок по умолчанию";
			Уровень2.Имя      = "СервисВосстановитьШириныКолонокПоУмолчанию";
			Уровень2.Действие = "КнопкаМенюСервисВосстановитьШириныКолонокПоУмолчанию";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Очистить значения ширины колонок по умолчанию";
			Уровень2.Имя      = "СервисОчиститьЗначенияШириныКолонокПоУмолчанию";
			Уровень2.Действие = "КнопкаМенюСервисОчиститьЗначенияШириныКолонокПоУмолчанию";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Просмотреть значения ширины колонок по умолчанию";
			Уровень2.Имя      = "СервисПросмотретьЗначенияШириныКолонокПоУмолчанию";
			Уровень2.Действие = "КнопкаМенюСервисПросмотретьЗначенияШириныКолонокПоУмолчанию";
			
			Уровень2     = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя = "СервисНастройкиКолонокРазделитель2";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Установить всем одну ширину";
			Уровень2.Имя      = "СервисУстановитьВсемКолонкамРезультатаЗапросаОднуШирину";
			Уровень2.Действие = "КнопкаМенюСервисУстановитьВсемКолонкамРезультатаЗапросаОднуШирину";
		КонецЕсли;
			
		НоваяСтрока          = МенюСервис.Строки.Добавить();
		НоваяСтрока.Имя      = "СервисРазделитель2";
		
		НоваяСтрока = МенюСервис.Строки.Добавить();
		НоваяСтрока.Название = "Загрузить из буфера в таблицу с результатом";
		НоваяСтрока.Имя      = "СервисЗагрузитьИзБуфераВТаблицуСРезультатом";
		НоваяСтрока.Действие = "КнопкаМенюСервисЗагрузитьИзБуфераВТаблицуСРезультатом";
		
		Если Не ДляУправляемойФормы Тогда 
			НоваяСтрока                 = МенюСервис.Строки.Добавить();
			НоваяСтрока.Название        = "Автодополнение";
			НоваяСтрока.Имя             = "СервисАвтодополнениеТекста";
			НоваяСтрока.Действие        = "КнопкаМенюСервисАвтодополнениеТекста";
			НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.Space,,Истина);			
			
			НоваяСтрока          = МенюСервис.Строки.Добавить();
			НоваяСтрока.Имя      = "СервисРазделитель3";
		
			НоваяСтрока          = МенюСервис.Строки.Добавить();
			НоваяСтрока.Название = "Сформировать код для отладки";
			НоваяСтрока.Имя      = "СервисСформироватьКодДляОтладки";
			НоваяСтрока.Действие = "КнопкаМенюСервисСформироватьКодДляОтладки";
			
			НоваяСтрока          = МенюСервис.Строки.Добавить();
			НоваяСтрока.Название = "Отладка на сервере";
			НоваяСтрока.Имя      = "СервисОтладкаНаСервере";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Скопировать обработку для отладки";
			Уровень2.Имя      = "СкопироватьОбработкуДляОтладки";
			Уровень2.Действие = "КнопкаМенюСервисСкопироватьОбработкуДляОтладки";
			//Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			//Уровень2.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Имя      = "ДополнительноРазделитель3";
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Загрузить запросы для отладки";
			Уровень2.Имя      = "ЗагрузитьЗапросыДляОтладки";
			Уровень2.Действие = "КнопкаМенюСервисЗагрузитьЗапросыДляОтладки";
			//Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			//Уровень2.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Загрузить сохраненные печатные формы";
			Уровень2.Имя      = "ЗагрузитьСохраненныеПечатныеФормы";
			Уровень2.Действие = "КнопкаМенюСервисЗагрузитьСохраненныеПечатныеФормы";
			//Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			//Уровень2.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Загрузить сохраненные схемы СКД";
			Уровень2.Имя      = "ЗагрузитьСохраненныеСхемыСКД";
			Уровень2.Действие = "КнопкаМенюСервисЗагрузитьСохраненныеСхемыСКД";
			//Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			//Уровень2.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
			Уровень2          = НоваяСтрока.Строки.Добавить();
			Уровень2.Название = "Загрузить сериализованные объекты";
			Уровень2.Имя      = "ЗагрузитьСериализованныеОбъекты";
			Уровень2.Действие = "КнопкаМенюСервисЗагрузитьСериализованныеОбъекты";
			//Уровень2.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			//Уровень2.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
		КонецЕсли;
		
	ИначеЕсли ИмяМеню = "Запросы" Тогда
		
		Если Не ДляУправляемойФормы Тогда 
			
			МенюЗапросы          = лМеню.Строки.Добавить();
			МенюЗапросы.Название = "Запросы";
			МенюЗапросы.Имя      = "КнопкаМенюЗапросы";
			
			НоваяСтрока          = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Название = "Все документы";
			НоваяСтрока.Имя      = "ЗапросыВсеДокументы";
			НоваяСтрока.Действие = "КнопкаМенюЗапросыВсеДокументы";
			
			НоваяСтрока          = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Название = "Выбранные документы";
			НоваяСтрока.Имя      = "ЗапросыВыбранныеДокументы";
			НоваяСтрока.Действие = "КнопкаМенюЗапросыВыбранныеДокументы";
			
			НоваяСтрока          = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Название = "Все справочники";
			НоваяСтрока.Имя      = "ЗапросыВсеСправочники";
			НоваяСтрока.Действие = "КнопкаМенюЗапросыВсеСправочники";
			
			НоваяСтрока          = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Название = "Выбранные справочники";
			НоваяСтрока.Имя      = "ЗапросыВыбранныеСправочники";
			НоваяСтрока.Действие = "КнопкаМенюЗапросыВыбранныеСправочники";
			
			НоваяСтрока          = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Имя      = "ЗапросыРазделитель";
			
			НоваяСтрока = МенюЗапросы.Строки.Добавить();
			НоваяСтрока.Название = "Выбрать метаданное для запроса...";
			НоваяСтрока.Имя      = "ЗапросыВыбратьМетаданноеДляЗапроса";
			НоваяСтрока.Действие = "КнопкаМенюЗапросыВыбратьМетаданноеДляЗапроса";							
		КонецЕсли;		
	ИначеЕсли ИмяМеню = "Информация" Тогда
		
		МенюИнформация          = лМеню.Строки.Добавить();
		МенюИнформация.Название = "Информация";
		МенюИнформация.Имя      = "КнопкаМенюИнформация";
		МенюИнформация.Картинка = Новый Картинка(ПолучитьМакет("Картинка_Информация"), Истина);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Список изменений";
		НоваяСтрока.Имя      = "ИнформацияСписокИзменений";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("changelog", ПутьКАртинке);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Отправить отзыв";
		НоваяСтрока.Имя      = "ИнформацияОтправитьОтзыв";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("mail__pencil", ПутьКАртинке);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Другие разработки автора";
		НоваяСтрока.Имя      = "ИнформацияДругиеРазработкиАвтора";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("drill", ПутьКАртинке);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Стать спонсором";
		НоваяСтрока.Имя      = "ИнформацияDonate";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("piggy_bank", ПутьКАртинке);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Сайт автора";
		НоваяСтрока.Имя      = "ИнформацияСайтАвтора";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("home", ПутьКАртинке);
		
		НоваяСтрока          = МенюИнформация.Строки.Добавить();
		НоваяСтрока.Название = "Используемые иконки";
		НоваяСтрока.Имя      = "ИнформацияFugueIcons";
		НоваяСтрока.Действие = "ВыборМенюИнформация";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("FugueIcons", ПутьКАртинке);
		
		// НоваяСтрока          = МенюИнформация.Строки.Добавить();
		// НоваяСтрока.Имя      = "ИнформацияРазделитель1";
		//
		// НоваяСтрока          = МенюИнформация.Строки.Добавить();
		// НоваяСтрока.Название = "Подписаться на новости (RSS)";
		// НоваяСтрока.Имя      = "RSS";
		// НоваяСтрока.Действие = "ВыборМенюИнформация";
		// НоваяСтрока.Картинка = Новый Картинка(ПолучитьМакет("Картинка_RSS"), Истина);
		
	ИначеЕсли ИмяМеню = "Дополнительно" Тогда
		
		МенюДополнительно          = лМеню.Строки.Добавить();
		МенюДополнительно.Название = "Дополнительно";
		МенюДополнительно.Имя      = "КнопкаМенюДополнительно";
		МенюДополнительно.Картинка = ПолучитьВнешнююКартинку("addon", ПутьКАртинке);
		
		НоваяСтрока          = МенюДополнительно.Строки.Добавить();
		НоваяСтрока.Имя      = "ДополнительноРазделитель";
		
		НоваяСтрока          = МенюДополнительно.Строки.Добавить();
		НоваяСтрока.Название = "Поиск";
		НоваяСтрока.Имя      = "ДополнительноПоиск";
		НоваяСтрока.Действие = "КнопкаМенюДополнительноПоиск";
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F,, Истина, Истина);
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("find", ПутьКАртинке);
		
		
		Если Не ДляУправляемойФормы Тогда 
			
			НоваяСтрока          = МенюДополнительно.Строки.Добавить();
			НоваяСтрока.Имя      = "ДополнительноРазделитель1";
			
			НоваяСтрока          = МенюДополнительно.Строки.Добавить();
			НоваяСтрока.Название = "Открыть форму cписка метаданного из запроса";
			НоваяСтрока.Имя      = "ДополнительноОткрытьФормуСпискаМетаданногоИзЗапроса";
			НоваяСтрока.Действие = "КнопкаМенюДополнительноОткрытьФормуСпискаМетаданногоИзЗапроса";
			НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.M,, Истина);
			НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("open_list_metadata", ПутьКАртинке);
			
		КонецЕсли;
	
	ИначеЕсли ИмяМеню = "ПреобразованияКодаВЗапросИОбратно" Тогда

		КореньМеню          = лМеню.Строки.Добавить();
		КореньМеню.Название = "Получение кода 1С по запросу";
		КореньМеню.Имя      = "ПолучениеКода1СПоЗапросу";
		КореньМеню.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
	
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Получить код 1С по запросу (с выборкой)";
		НоваяСтрока.Имя      = "ПолучениеКода1СПоЗапросуПолучитьКод1ССВыборкой";
		НоваяСтрока.Действие = "КнопкаМенюПолучениеКода1СПоЗапросуПолучитьКод1ССВыборкой";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query1", ПутьКАртинке);
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,,);			
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Получить код 1С по запросу (с таблицей значений)";
		НоваяСтрока.Имя      = "ПолучениеКода1СПоЗапросуПолучитьКод1ССТаблицейЗначений";
		НоваяСтрока.Действие = "КнопкаМенюПолучениеКода1СПоЗапросуПолучитьКод1ССТаблицейЗначений";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query2", ПутьКАртинке);
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._2, Истина,,);			
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Получить код 1С по запросу (с обработкой результата)";
		НоваяСтрока.Имя      = "ПолучениеКода1СПоЗапросуПолучитьКод1ССОбработкойРезультата";
		НоваяСтрока.Действие = "КнопкаМенюПолучениеКода1СПоЗапросуПолучитьКод1ССОбработкойРезультата";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query3", ПутьКАртинке);
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._3, Истина,,);			
		
		// пункт меню "Получить запрос из кода 1С"
		КореньМеню          = лМеню.Строки.Добавить();
		КореньМеню.Название = "Вставить запрос из кода 1С";
		КореньМеню.Имя      = "ВставитьЗапросИзКода1С";
		КореньМеню.Картинка = ПолучитьВнешнююКартинку("create_from_code", ПутьКАртинке);
	
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Вставить запрос из кода 1С";
		НоваяСтрока.Имя      = "ВставитьЗапросИзКода1СПолучитьЗапросСОбработкой";
		НоваяСтрока.Действие = "КнопкаМенюВставитьЗапросИзКода1СПолучитьЗапросСОбработкой";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_code1", ПутьКАртинке);
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,, Истина);
	
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Вставить запрос из кода 1С (без обработки)";
		НоваяСтрока.Имя      = "ВставитьЗапросИзКода1СПолучитьЗапросБезОбработки";
		НоваяСтрока.Действие = "КнопкаМенюВставитьЗапросИзКода1СПолучитьЗапросБезОбработки";
		НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_code2", ПутьКАртинке);
		НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._2, Истина,, Истина);
	
	ИначеЕсли ИмяМеню = "ПодменюВременныеТаблицы" Тогда

		КореньМеню          = лМеню.Строки.Добавить();
		КореньМеню.Название = "Временные таблицы";
		КореньМеню.Имя      = "ПодменюВременныеТаблицы";
		КореньМеню.Картинка = ПолучитьВнешнююКартинку("ПодменюВременныеТаблицы", ПутьКАртинке);
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = гСвойстваПунктаМенюПоказатьВременнуюТаблицу().НазваниеКорня;
		НоваяСтрока.Имя      = гСвойстваПунктаМенюПоказатьВременнуюТаблицу().ИмяКорня;
		//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
		
		Уровень2          = НоваяСтрока.Строки.Добавить();
		Уровень2.Название = "Показать временную таблицу 1";
		Уровень2.Имя      = "ПоказатьВременнуюТаблицу1";
		Уровень2.Действие = гСвойстваПунктаМенюПоказатьВременнуюТаблицу().Действие;
	
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Показать выделенную временную таблицу";
		НоваяСтрока.Имя      = "ПоказатьВыделеннуюВременнуюТаблицу";
		НоваяСтрока.Действие = "КнопкаМенюПодменюВременныеТаблицыПоказатьВыделеннуюВременнуюТаблицу";
		//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
		//НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,,);			
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Перейти к описанию временной таблицы";
		НоваяСтрока.Имя      = "ПерейтиКОписаниюВременнойТаблицы";
		НоваяСтрока.Действие = "КнопкаМенюПодменюВременныеТаблицыПерейтиКОписаниюВременнойТаблицы";
		//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
		//НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,,);			
		
	ИначеЕсли ИмяМеню = "ПодменюТаблицыПакета" Тогда

		КореньМеню          = лМеню.Строки.Добавить();
		КореньМеню.Название = "Таблицы пакета";
		КореньМеню.Имя      = "ПодменюТаблицыПакета";
		КореньМеню.Картинка = ПолучитьВнешнююКартинку("ПодменюТаблицыПакета", ПутьКАртинке);
		
		НоваяСтрока          = КореньМеню.Строки.Добавить();
		НоваяСтрока.Название = "Показать таблицу пакета 1";
		НоваяСтрока.Имя      = "ПоказатьТаблицуПакета1";
		НоваяСтрока.Действие = гСвойстваПунктаМенюПоказатьТаблицуПакета().Действие;
		
	//	НоваяСтрока          = КореньМеню.Строки.Добавить();
	//	НоваяСтрока.Название = гСвойстваПунктаМенюПоказатьТаблицуПакета().НазваниеКорня;
	//	НоваяСтрока.Имя      = гСвойстваПунктаМенюПоказатьТаблицуПакета().ИмяКорня;
	//	//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
	//	
	//	
	//	Уровень2          = НоваяСтрока.Строки.Добавить();
	//	Уровень2.Название = "Показать таблицу пакета 1";
	//	Уровень2.Имя      = "ПоказатьТаблицуПакета1";
	//	Уровень2.Действие = гСвойстваПунктаМенюПоказатьТаблицуПакета().Действие;
	//
	//	НоваяСтрока          = КореньМеню.Строки.Добавить();
	//	НоваяСтрока.Название = "Показать выделенную таблицу пакета";
	//	НоваяСтрока.Имя      = "ПоказатьВыделеннуюТаблицуПакета";
	//	НоваяСтрока.Действие = "КнопкаМенюПодменюПодменюТаблицыПакетаПоказатьВыделеннуюТаблицуПакета";
	//	//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
	//	//НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,,);			
	//	
	//	НоваяСтрока          = КореньМеню.Строки.Добавить();
	//	НоваяСтрока.Название = "Перейти к описанию таблицы пакета";
	//	НоваяСтрока.Имя      = "ПерейтиКОписаниюТаблицыПакета";
	//	НоваяСтрока.Действие = "КнопкаМенюПодменюТаблицыПакетаПерейтиКОписаниюТаблицыПакета";
	//	//НоваяСтрока.Картинка = ПолучитьВнешнююКартинку("create_from_query", ПутьКАртинке);
	//	//НоваяСтрока.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша._1, Истина,,);			
		
	КонецЕсли;
	
	Если ВВидеСписка Тогда 
		Возврат ПолучитьМенюСписком(лМеню)
	Иначе
		Возврат лМеню;	
	КонецЕсли;
	
КонецФункции // гПолучитьМеню()

#КонецОбласти

#Область Работа_с_буфером

Функция гПолучитьТекстИзБуфера() Экспорт
	
	htmlfile = Новый COMОбъект("htmlfile"); 	
	Возврат htmlfile.parentWindow.clipboardData.getData("text");
	
	//лНазваниеЭлемента = "ПолеHTMLДокумента321432458767_"; Форма.ЭлементыФормы.Добавить(Тип("ПолеHTMLДокумента"), лНазваниеЭлемента, Ложь); лОкно = Форма.ЭлементыФормы[лНазваниеЭлемента].Документ.parentWindow; 
	//лСтрокаБуфера    = лОкно.ClipboardData.GetData("Text"); Форма.ЭлементыФормы.Удалить(Форма.ЭлементыФормы.Индекс(Форма.ЭлементыФормы.Найти(лНазваниеЭлемента))); 
	
КонецФункции // гПолучитьТекстИзБуфера()

Функция гСкопироватьТекстВБуфер(Текст, Форма = Неопределено) Экспорт 
	
	Если Форма = Неопределено Тогда 
		htmlfile = Новый COMОбъект("htmlfile"); лСтрокаБуфера = htmlfile.parentWindow.clipboardData.SetData("Text", Текст); 
	Иначе
		лНазваниеЭлемента = "ПолеHTMLДокумента321432458767_"; Форма.ЭлементыФормы.Добавить(Тип("ПолеHTMLДокумента"), лНазваниеЭлемента, Ложь); лОкно = Форма.ЭлементыФормы[лНазваниеЭлемента].Документ.parentWindow; 
		лСтрокаБуфера    = лОкно.ClipboardData.SetData("Text", Текст); Форма.ЭлементыФормы.Удалить(Форма.ЭлементыФормы.Индекс(Форма.ЭлементыФормы.Найти(лНазваниеЭлемента))); 
	КонецЕсли;
	
	Возврат лСтрокаБуфера
	
КонецФункции // гСкопироватьТекстВБуфер()

#КонецОбласти

#Область Работа_со_строками

Функция гПолучитьКоординатыОшибки(ТекстОшибки) Экспорт

	Если Не гИнициализацияVBScript() тогда
		Возврат Неопределено		
	КонецЕсли;
	
	гRegExp.Pattern = "{\([0-9]+, [0-9]+\)}";
	лМассив        = гRegExp.Execute(ТекстОшибки);
	
	Если лМассив.Count() = 0 Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	лРезультатРазбора = лМассив.Item(0).Value;
	
	гRegExp.Pattern = "[0-9]+";
	лМассив        = гRegExp.Execute(лРезультатРазбора);
	
	Если лМассив.Count() <> 2 Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	Возврат Новый Структура("Строка, Колонка", лМассив.Item(0).Value, лМассив.Item(1).Value);

КонецФункции // гПолучитьКоординатыОшибки()

// Парсит входящий код 1С на наличие кода с текстом запроса и установкой параметров запроса
// Параметры:
//  Код1С - Строка - код 1С с формированием текста запроса и его параметров
//  ПростаяОбработкаТекста - Булево - флаг режима простой обработки входящего текста 
//  	(без заполнения параметров и более детального получения текста запроса из кода)
//  
// Возвращаемое значение:
//  Структура: 
//  	Текст - текст - текст запроса
//  	Параметры - соответствие - Ключ это имя параметра, Значение - значение параметра
Функция гПолучитьЗапросИзТекста(Код1С, ПростаяОбработкаТекста) Экспорт

	лПараметрыЗапроса = Новый Соответствие;
	лТекстЗапроса     = Код1С;
	Если Не ПростаяОбработкаТекста И гИнициализацияVBScript() Тогда
		// \t	 - символ табуляции
		// \n	 - новая строка
		// \r	 - перевод каретки
		гRegExp.Pattern = "(^|\s+|\t+|""|\|)[Вв]+[Ыы]+[Бб]+[Рр]+[Аа]+[Тт]+[ь]+[\s\S\t\n\r]*"";";
		Массив = гRegExp.Execute(лТекстЗапроса);
				
		Если Массив.Count > 0 Тогда
			лТекстЗапроса = СокрЛП(Массив.Item(Массив.Count - 1).Value);
			лТекстЗапроса = СтрЗаменить(лТекстЗапроса,Символ(13) + Символ(10),Символы.ПС);

			// Заполнение параметров
			гRegExp.Pattern = "[Уу]+[Сс]+[Тт]+[Аа]+[Нн]+[Оо]+[Вв]+[Ии]+[Тт]+[Ьь]+[Пп]+[Аа]+[Рр]+[Аа]+[Мм]+[Ее]+[Тт]+[Рр]+\(([^\n]*)\);";
			Массив = гRegExp.Execute(Код1С);
			Если Массив.Count > 0 Тогда
				Для i = 0 по Массив.Count - 1 Цикл
					лВремСтрока = СокрЛП(Массив.Item(i).Value);
					гRegExp.Pattern = "\((.*)\)";
					МассивПараметров = гRegExp.Execute(лВремСтрока);
					Если МассивПараметров.Count > 0 Тогда
						лВремСтрока = СокрЛП(МассивПараметров.Item(МассивПараметров.Count - 1).Value);						
						лВремСтрока = Сред(лВремСтрока,2,СтрДлина(лВремСтрока) - 2); // убираем первую и последнюю скобки
						гRegExp.Pattern = "([^,\s\t]+[^,]*)";
						МассивПараметров = гRegExp.Execute(лВремСтрока);
						Если МассивПараметров.Count = 2 Тогда 
							лПараметрыЗапроса.Вставить(Вычислить(СокрЛП(МассивПараметров.Item(МассивПараметров.Count - 1).Value)), Вычислить(СокрЛП(МассивПараметров.Item(1).Value)));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// предварительная обработка кода 1с с запросом
	лТекстЗапроса = СтрЗаменить(лТекстЗапроса, "|", "");
	лТекстЗапроса = СтрЗаменить(лТекстЗапроса, """;", "");
	лТекстЗапроса = СтрЗаменить(лТекстЗапроса, Символ(34) + Символ(34), "_БывшаяДвойнаяКавычка_"); 
	лТекстЗапроса = СтрЗаменить(лТекстЗапроса, Символ(34), ""); 
	лТекстЗапроса = СтрЗаменить(лТекстЗапроса, "_БывшаяДвойнаяКавычка_", Символ(34)); 
	
	Возврат Новый Структура("Текст, Параметры", лТекстЗапроса, лПараметрыЗапроса);

КонецФункции // гПолучитьЗапросИзТекста()

Функция ПреобразоватьВUniCode(Знач СтрокаAnsi)
	
	Возврат СтрЗаменить(СтрокаAnsi, " ", "%20")
	
КонецФункции // ПреобразоватьВUniCode

// пРОЦЕДУРА ДУБЛЬ(!!!)
Функция гИнициализацияVBScript() Экспорт
	
	Если гRegExp <> Неопределено Тогда 
		гRegExp.Multiline  = True;
		гRegExp.Global     = True;
		гRegExp.IgnoreCase = True;
		гRegExp.Pattern    = "";
		Возврат Истина
	КонецЕсли;
	
	Попытка
		гRegExp = Новый COMОбъект("VBScript.RegExp");
	Исключение
		гRegExp = Неопределено;
		Сообщить("Ошибка инициализации VBScript.RegExp.", СтатусСообщения.Важное);
		Возврат False;
	КонецПопытки;
	
	гRegExp.Multiline  = True;
	гRegExp.Global     = True;
	гRegExp.IgnoreCase = True;
	
	Возврат True;
	
КонецФункции // ИнициализацияVBScript

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//    Если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  гРазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые
//  строки;
//  гРазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  гРазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  гРазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  гРазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  гРазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
Функция гРазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // гРазложитьСтрокуВМассивПодстрок()

Функция ПолучитьПоследнееСлово(Текст)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат ""
	КонецЕсли;
	
	лВременныйТекст = Новый ТекстовыйДокумент;
	лВременныйТекст.УстановитьТекст(Текст);
	лТекст = лВременныйТекст.ПолучитьСтроку(лВременныйТекст.КоличествоСтрок());
	
	гRegExp.Pattern="[\?a-zA-Zа-яА-я_]+$";
	Массив = гRegExp.Execute(лТекст);
	Если Массив.Count>0 тогда
		Результат = Массив.Item(Массив.Count-1).Value;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат
КонецФункции // ПолучитьПоследнееСлово()()

Функция ПолучитьПервоеСлово(Текст)
	гRegExp.Pattern="^[\?a-zA-Zа-яА-я_]+";
	Массив = гRegExp.Execute(Текст);
	Если Массив.Count>0 и Лев(Текст, 1) = Лев(Массив.Item(Массив.Count - 1).Value, 1) тогда
		Результат = Массив.Item(Массив.Count - 1).Value;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат
КонецФункции // ПолучитьПоследнееСлово()()

#КонецОбласти

#Область Работа_с_полем_кода

Функция гПолучитьСтруктуруТекстаДоИПослеКурсора(ПолеФормыСТекстом, СтруктураКоординат)Экспорт
	
	Результат = Новый Структура;
	
	// В структуре координат находятся текущие параметры выделения области текста
	// необходимо вернуть текст до позиции курсора и текст после позиции курсора
	// для этого выделяем область до позиции курсора , копируем ее , выделяем область после позиции курсора и копируем ее
	ПолеФормыСТекстом.УстановитьГраницыВыделения(1, 1, СтруктураКоординат.СтрокаКон, СтруктураКоординат.КолонкаКон);
	
	Результат.Вставить("ТекстДо",ПолеФормыСТекстом.ВыделенныйТекст);
	
	ПолеФормыСТекстом.УстановитьГраницыВыделения(СтруктураКоординат.СтрокаКон, СтруктураКоординат.КолонкаКон, ПолеФормыСТекстом.КоличествоСтрок(),
		Макс(СтруктураКоординат.КолонкаКон, СтрДлина(ПолеФормыСТекстом.ПолучитьСтроку(ПолеФормыСТекстом.КоличествоСтрок()) + 1)));
	
	Результат.Вставить("ТекстПосле", ПолеФормыСТекстом.ВыделенныйТекст);
	
	ПолеФормыСТекстом.УстановитьГраницыВыделения(СтруктураКоординат.СтрокаНач, СтруктураКоординат.КолонкаКон, СтруктураКоординат.СтрокаКон, СтруктураКоординат.КолонкаКон);
	
	Возврат Результат
	
КонецФункции // гПолучитьСтруктуруТекстаДоИПослеКурсора()

// ПРОЦЕДУРА ДУБЛЬ(!!!)
Функция гПолучитьГраницыВыделенияПоляФормы(ПолеФормы) Экспорт
	
	СтрокаНач	= 1;
	КолонкаНач	= 1;              
	СтрокаКон   = 1;
	КолонкаКон	= 1;
	ПолеФормы.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	Результат = Новый Структура();
	Результат.Вставить("СтрокаНач" , СтрокаНач);
	Результат.Вставить("КолонкаНач", КолонкаНач);
	Результат.Вставить("СтрокаКон" , СтрокаКон);
	Результат.Вставить("КолонкаКон", КолонкаКон);
	
	Возврат Результат;
	
КонецФункции // гПолучитьГраницыВыделенияПоляФормы()

Функция ПолучитьСтрокиПоФильтру(ИсходнаяСтрока, Фильтр)

	гRegExp.Pattern     = "^("+СтрЗаменить(Фильтр,"?","\?")+")[a-zA-Zа-яА-я_]*.*(\n|$)";
	Возврат гRegExp.Execute(ИсходнаяСтрока);

КонецФункции // ПолучитьСтрокиПоФильтру()


#КонецОбласти

#Область Контекстная_подсказка

функция гРежимыКонтекстнойПодсказки() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Метаданные", "Метаданные");
	Результат.Вставить("Параметры" , "Параметры");
	Результат.Вставить("Таблицы"   , "Таблицы");
	Результат.Вставить("ПодТаблицы", "ПодТаблицы");
	Результат.Вставить("Поля"      , "Поля");
	Результат.Вставить("Условия"   , "Условия");
	Результат.Вставить("Начало"    , "Начало");
	
	Возврат Результат

КонецФункции // гРежимыКонтекстнойПодсказки()

Функция гПродолжитьФормироватьКП(Режим, ВыбранноеЗначение) Экспорт
	
	Если Режим = гРежимыКонтекстнойПодсказки().Метаданные И НРег(ВыбранноеЗначение) = "константы" Тогда 
		Возврат Ложь
	КонецЕсли;
	
	лСписокРежимов = Новый Массив;
	лСписокРежимов.Добавить(гРежимыКонтекстнойПодсказки().Начало);
	лСписокРежимов.Добавить(гРежимыКонтекстнойПодсказки().Метаданные);

	Возврат лСписокРежимов.Найти(Режим) <> Неопределено

КонецФункции // гПродолжитьФормироватьКП()

Функция гПолучитьДанныеДляПодбораКП(ТекстЗапроса, ПозицияКурсора, ПутьККартинке, СтруктураКЭШ) Экспорт
	
	Если Не гИнициализацияVBScript() тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	// определяем режим контекстной подсказки
	лТекстЗапросаДоКурсора    = Лев(ТекстЗапроса, ПозицияКурсора);
	лТекстЗапросаПослеКурсора = Сред(ТекстЗапроса, ПозицияКурсора + 1);
	лСловоДоКурсора           = ПолучитьПоследнееСлово(лТекстЗапросаДоКурсора);
	лСловоПослеКурсора        = ПолучитьПервоеСлово(лТекстЗапросаПослеКурсора);
	лФильтр                   = лСловоДоКурсора;// + ?(СокрЛП(лСловоДоКурсора) = "", "", лСловоПослеКурсора); !!!???
	лСтрокаСоЗначениямиКП     = "";
	лМножественныйВыбор       = Ложь;
	лИмяКоллекции             = Неопределено;
	лИмяТаблицы               = Неопределено;
	
	лРежимКП = ПолучитьРежимКонтекстнойПодсказки(лТекстЗапросаДоКурсора, лТекстЗапросаПослеКурсора);
	
	Если лРежимКП = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначенияДляВыбора = Новый СписокЗначений;
	
	Если лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Параметры тогда
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Метаданные тогда
		
		лСписокМетаданных = СписокМетаданных(СтруктураКЭШ);
		Для каждого лМетаданное Из лСписокМетаданных Цикл
			лСтрокаСоЗначениямиКП = лСтрокаСоЗначениямиКП + ?(лСтрокаСоЗначениямиКП = "", "", Символы.ПС) + лМетаданное.Значение
		КонецЦикла; 
		
		лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
		лОкончание = ".";
		
		лИсключения = Новый Массив();
		лИсключения.Добавить("Константы");
		
		Для i = 0 по лМассив.Count-1 Цикл
			лМетаданное = лСписокМетаданных.НайтиПоЗначению(СокрЛП(лМассив.Item(i).Value));
			ЗначенияДляВыбора.Добавить(лМетаданное.Значение + ?(лИсключения.Найти(лМетаданное.Значение) = Неопределено, лОкончание, ""), лМетаданное.Значение, Ложь, лМетаданное.Картинка);
		КонецЦикла;
		
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Таблицы тогда
		
		гRegExp.Pattern    = "[\?a-zA-Zа-яА-я_]+\.[\?a-zA-Zа-яА-я_]*$";
		лМассив           = гRegExp.Execute(лТекстЗапросаДоКурсора);
		лРезультатРазбора = лМассив.Item(0).Value;
		лМетаданное       = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Лев(лРезультатРазбора, Найти(лРезультатРазбора, ".") - 1));
		
		Если лМетаданное = Неопределено Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		лИмяМетаданного = лМетаданное.Представление;
		лКартинка       = ПолучитьКартинкуПоМетаданному(лИмяМетаданного, СтруктураКЭШ);
		лМетаданные     = Вычислить("Метаданные[""" + лИмяМетаданного + """]");
		
		лСписокМетаданных = Новый СписокЗначений;
		Для Каждого лМетаданное из лМетаданные Цикл
			лСписокМетаданных.Добавить(лМетаданное.Имя, лМетаданное.Имя,,лКартинка);
			лСтрокаСоЗначениямиКП = лСтрокаСоЗначениямиКП + ?(лСтрокаСоЗначениямиКП = "", "", Символы.ПС) + лМетаданное.Имя;
		КонецЦикла;
		
		Если лСписокМетаданных.Количество() > 0 Тогда 
			лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
			лОкончание = "";
			
			Для i = 0 по лМассив.Count-1 Цикл
				лМетаданное = лСписокМетаданных.НайтиПоЗначению(СокрЛП(лМассив.Item(i).Value));
				ЗначенияДляВыбора.Добавить(лМетаданное.Значение + лОкончание, лМетаданное.Представление, Ложь, лМетаданное.Картинка);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().ПодТаблицы тогда
		
		гRegExp.Pattern    = "[\?a-zA-Zа-яА-я_]+\.[\?a-zA-Zа-яА-я_]+\.[\?a-zA-Zа-яА-я_]*$";
		лМассив           = гRegExp.Execute(лТекстЗапросаДоКурсора);
		лРезультатРазбора = лМассив.Item(0).Value;
		лМетаданное       = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Лев(лРезультатРазбора, Найти(лРезультатРазбора, ".") - 1));
		Если лМетаданное = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		лИмяМетаданного = лМетаданное.Представление;
		лИмяТаблицы     = Лев(Сред(лРезультатРазбора, СтрДлина(лИмяМетаданного) + 1), Найти(Сред(лРезультатРазбора, СтрДлина(лИмяМетаданного) + 1), ".") - 1);
		
		лСписокКоллекцийОбъектаМетаданных = СписокКоллекцийОбъектаМетаданных(лИмяМетаданного, лИмяТаблицы, СтруктураКЭШ, ПутьККартинке);
		
		Для Каждого лМетаданное из лСписокКоллекцийОбъектаМетаданных Цикл
			лСтрокаСоЗначениямиКП = лСтрокаСоЗначениямиКП + ?(лСтрокаСоЗначениямиКП = "", "", Символы.ПС) + лМетаданное.Значение;
		КонецЦикла;
		
		Если лСтрокаСоЗначениямиКП = "" Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
		лОкончание = ?(СокрЛП(лСловоПослеКурсора) <> "", " ", "");
		
		Для i = 0 по лМассив.Count-1 Цикл
			лКоллекция = лСписокКоллекцийОбъектаМетаданных.НайтиПоЗначению(СокрЛП(лМассив.Item(i).Value));
			ЗначенияДляВыбора.Добавить(лКоллекция.Значение + лОкончание, лКоллекция.Представление, Ложь, лКоллекция.Картинка);
		КонецЦикла;
		
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Поля тогда
		
		гRegExp.Pattern = "[a-zA-Zа-яА-я_]+[0-9a-zA-Zа-яА-я_]*(\.[a-zA-Zа-яА-я_]+[0-9a-zA-Zа-яА-я_]*){1,3}";
		Если гRegExp.Test(лТекстЗапросаПослеКурсора) Тогда 
			Массив = гRegExp.Execute(лТекстЗапросаПослеКурсора);
			лИсходныйПутьКМетаданному = Массив.Item(0).Value;
			лМетаданное = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Лев(лИсходныйПутьКМетаданному, Найти(лИсходныйПутьКМетаданному, ".") - 1));
			Если лМетаданное = Неопределено Тогда 
				Возврат Неопределено
			КонецЕсли;
			лИмяМетаданного = лМетаданное.Представление;
			лОстатокОтИмени = Сред(лИсходныйПутьКМетаданному, СтрДлина(Лев(лИсходныйПутьКМетаданному, Найти(лИсходныйПутьКМетаданному, ".") - 1)) + 2);
			лПозицияТочки = Найти(лОстатокОтИмени, ".");
			Если лПозицияТочки = 0 Тогда 
				лИмяТаблицы = лОстатокОтИмени;
			Иначе
				лИмяТаблицы = Лев(лОстатокОтИмени, лПозицияТочки - 1);
				лИмяКоллекции = Прав(лОстатокОтИмени, СтрДлина(лОстатокОтИмени) - лПозицияТочки);
			КонецЕсли;
		Иначе
			гRegExp.Pattern = "[\?a-zA-Zа-яА-я_]*$";
			Массив         = гRegExp.Execute(лТекстЗапросаПослеКурсора);
			лМетаданное    = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Массив.Item(0).Value);
			Если лМетаданное = Неопределено Тогда 
				Возврат Неопределено
			КонецЕсли;
			лИмяМетаданного = лМетаданное.Представление;
		КонецЕсли;
		
		лПоляОбъектовМетаданных = ПоляОбъектовМетаданных(лИмяМетаданного, лИмяТаблицы, лИмяКоллекции, ПутькКартинке, СтруктураКЭШ);
		
		Если лПоляОбъектовМетаданных = Неопределено Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		Для Каждого лПоле из лПоляОбъектовМетаданных Цикл
			лСтрокаСоЗначениямиКП = лСтрокаСоЗначениямиКП + ?(лСтрокаСоЗначениямиКП = "", "", Символы.ПС) + лПоле.Значение;
		КонецЦикла;
		
		Если лСтрокаСоЗначениямиКП = "" Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
		лОкончание = ?(СокрЛП(лСловоПослеКурсора) <> "", " ", "");
		
		Для i = 0 по лМассив.Count-1 Цикл
			лКоллекция = лПоляОбъектовМетаданных.НайтиПоЗначению(СокрЛП(лМассив.Item(i).Value));
			ЗначенияДляВыбора.Добавить(лКоллекция.Значение + лОкончание, лКоллекция.Представление, Ложь, лКоллекция.Картинка);
		КонецЦикла;
		
		лМножественныйВыбор = Истина;
		
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Условия тогда
		
		
		гRegExp.Pattern = "[a-zA-Zа-яА-я_]+[0-9a-zA-Zа-яА-я_]*(\.[a-zA-Zа-яА-я_]+[0-9a-zA-Zа-яА-я_]*){1,3}";
		Если гRegExp.Test(лРежимКП.Текст) Тогда 
			Массив = гRegExp.Execute(лРежимКП.Текст);
			лИсходныйПутьКМетаданному = Массив.Item(0).Value;
			лМетаданное = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Лев(лИсходныйПутьКМетаданному, Найти(лИсходныйПутьКМетаданному, ".") - 1));
			Если лМетаданное = Неопределено Тогда 
				Возврат Неопределено
			КонецЕсли;
			лИмяМетаданного = лМетаданное.Представление;
			лОстатокОтИмени = Сред(лИсходныйПутьКМетаданному, СтрДлина(Лев(лИсходныйПутьКМетаданному, Найти(лИсходныйПутьКМетаданному, ".") - 1)) + 2);
			лПозицияТочки = Найти(лОстатокОтИмени, ".");
			Если лПозицияТочки = 0 Тогда 
				лИмяТаблицы = лОстатокОтИмени;
			Иначе
				лИмяТаблицы = Лев(лОстатокОтИмени, лПозицияТочки - 1);
				лИмяКоллекции = Прав(лОстатокОтИмени, СтрДлина(лОстатокОтИмени) - лПозицияТочки);
			КонецЕсли;
		Иначе
			гRegExp.Pattern = "[\?a-zA-Zа-яА-я_]*$";
			Массив         = гRegExp.Execute(лТекстЗапросаПослеКурсора);
			лМетаданное    = СписокМетаданных(СтруктураКЭШ).НайтиПоЗначению(Массив.Item(0).Value);
			Если лМетаданное = Неопределено Тогда 
				Возврат Неопределено
			КонецЕсли;
			лИмяМетаданного = лМетаданное.Представление;
		КонецЕсли;
		
		лПоляОбъектовМетаданных = ПоляОбъектовМетаданных(лИмяМетаданного, лИмяТаблицы, лИмяКоллекции, ПутькКартинке, СтруктураКЭШ);
		
		Если лПоляОбъектовМетаданных = Неопределено Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		Для Каждого лПоле из лПоляОбъектовМетаданных Цикл
			лСтрокаСоЗначениямиКП = лСтрокаСоЗначениямиКП + ?(лСтрокаСоЗначениямиКП = "", "", Символы.ПС) + лПоле.Значение;
		КонецЦикла;
		
		Если лСтрокаСоЗначениямиКП = "" Тогда 
			Возврат Неопределено
		КонецЕсли;
		
		лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
		лОкончание = ?(СокрЛП(лСловоПослеКурсора) <> "", " ", "");
		
		Для i = 0 по лМассив.Count-1 Цикл
			лКоллекция = лПоляОбъектовМетаданных.НайтиПоЗначению(СокрЛП(лМассив.Item(i).Value));
			ЗначенияДляВыбора.Добавить(лКоллекция.Значение + лОкончание, лКоллекция.Представление, Ложь, лКоллекция.Картинка);
		КонецЦикла;
		
		лМножественныйВыбор = Истина;
		
	ИначеЕсли лРежимКП.Режим = гРежимыКонтекстнойПодсказки().Начало тогда
		
		лСтрокаСоЗначениямиКП = 
		"ВЫБРАТЬ * ИЗ
		|ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ";
		
		лМассив    = ПолучитьСтрокиПоФильтру(лСтрокаСоЗначениямиКП, лФильтр);
		лОкончание = " ";
		
		Для i = 0 по лМассив.Count-1 Цикл
			ЗначенияДляВыбора.Добавить(СокрЛП(лМассив.Item(i).Value) + лОкончание, СокрЛП(лМассив.Item(i).Value));
		КонецЦикла;
		
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	Если лСловоДоКурсора = "" Тогда лСловоПослеКурсора = "" КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("ЗначенияДляВыбора"       , ЗначенияДляВыбора);
	Результат.Вставить("СловоДоКурсора"          , лСловоДоКурсора);
	Результат.Вставить("СловоПослеКурсора"       , лСловоПослеКурсора);
	Результат.Вставить("РежимКП"                 , лРежимКП);
	Результат.Вставить("ТекстЗапросаДоКурсора"   , лТекстЗапросаДоКурсора);
	Результат.Вставить("ТекстЗапросаПослеКурсора", лТекстЗапросаПослеКурсора);
	Результат.Вставить("МножественныйВыбор"      , лМножественныйВыбор);	
	
	Возврат Результат;
	
КонецФункции // гПолучитьДанныеДляПодбораКП()

Функция ПолучитьРежимКонтекстнойПодсказки(ТекстСлеваОтКурсора, ТекстСправаОтКурсора)
	
	Если ТекстСлеваОтКурсора = "" Тогда 
		Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Начало, "");
	КонецЕсли;
	
	// условия
	
	// грубый признак того, что нужно выбирать условия
	гRegExp.Pattern="(^|\s+|\(\s*)Выбрать\s+[\s\S]*\s+из\s+[\s\S]*где\s+[\s\S]*$";
	ГрубаяПроверка = гRegExp.Test(ТекстСлеваОтКурсора);
	
	Если ГрубаяПроверка тогда
		
		// обрамим нужным нам текст
		гRegExp.Pattern="из\s+[\s\S]+\s+где";
		Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
		ПромежуточныйТекст = Массив.Item(0).Value;
		
		гRegExp.Pattern="из(\s+)[a-zA-Zа-яА-я_]+($|\s|(\.[a-zA-Zа-яА-я_]+)*)+";
		Массив = гRegExp.Execute(ПромежуточныйТекст);
		Если Массив.Count>0 тогда
			Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Условия, Массив.Item(Массив.Count - 1).Value);
		КонецЕсли;
	КонецЕсли;
	
	// подтаблицы
	гRegExp.Pattern="(^|\s+|\(){0,1}Выбрать\s+[\s\S]*\s+из[\s]+[a-zA-Zа-яА-Я_?]+\.[a-zA-Zа-яА-Я_?]+\.[a-zA-Zа-яА-Я_?]*$";
	ГрубаяПроверка = гRegExp.Test(ТекстСлеваОтКурсора);
	
	Если ГрубаяПроверка тогда
		гRegExp.Pattern="[a-zA-Zа-яА-я_\.?]+$";
		Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
		Если Массив.Count > 0 тогда
			Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().ПодТаблицы, Массив.Item(Массив.Count - 1).Value);
		КонецЕсли;
	КонецЕсли;
	
	// таблицы
	гRegExp.Pattern="(^|\s+|\(){0,1}[\s\S]*\s+из[\s]+[a-zA-Zа-яА-Я_?]+\.[a-zA-Zа-яА-Я_?]*$";
	ГрубаяПроверка = гRegExp.Test(ТекстСлеваОтКурсора);
	
	Если ГрубаяПроверка тогда
		гRegExp.Pattern="[a-zA-Zа-яА-я_\.?]+$";
		Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
		Если Массив.Count > 0 И Прав(ТекстСлеваОтКурсора, 1) = 
				Прав(Массив.Item(Массив.Count - 1).Value, 1) Тогда // исключаем перенос строки
			Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Таблицы, Массив.Item(Массив.Count - 1).Value);
		КонецЕсли;
	КонецЕсли;
	
	// метаданные
	гRegExp.Pattern="(^|\s+|\(){0,1}Выбрать\s+[\s\S]*\s+из\s+[a-zA-Zа-яА-Я_?]*$";
	Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
	Если Массив.Count > 0 тогда
		Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Метаданные, Массив.Item(Массив.Count - 1).Value);
	КонецЕсли;
	
	// параметры
	гRegExp.Pattern="(^|\s+|\()[a-zA-Zа-яА-я_]+\s*=\s*&$";
	Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
	Если Массив.Count > 0 тогда
		Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Параметры, Массив.Item(Массив.Count - 1).Value);
	КонецЕсли;
	
	// поля
	// так как на весь шаблон vbscript глючит, проверяем по отдельности
	гRegExp.Pattern="(^|\s+|\(){0,1}Выбрать\s+[\s\S]*$";
	ЛеваяПроверкаШаблона = гRegExp.Test(ТекстСлеваОтКурсора);
	
	Если ЛеваяПроверкаШаблона Тогда 
		гRegExp.Pattern="([a-zA-Zа-яА-Я_,]*\s+|^)*ИЗ\s+[a-zA-Zа-яА-Я_]";
		ПраваяПроверкаШаблона = гRegExp.Test(ТекстСправаОтКурсора);
		
		Если ЛеваяПроверкаШаблона и ПраваяПроверкаШаблона тогда
			Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Поля);
		КонецЕсли;
	КонецЕсли;
	
	// начало запроса	
	Результат = новый Структура;
	гRegExp.Pattern="[\?a-zA-Zа-яА-я_)]+\s*$";
	Массив = гRegExp.Execute(ТекстСлеваОтКурсора);
	Если Массив.Count>0 тогда
		Возврат Новый Структура("Режим, Текст", гРежимыКонтекстнойПодсказки().Начало, Массив.Item(Массив.Count - 1).Value);
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции // ПолучитьРежимКонтекстнойПодсказки()


#КонецОбласти

#Область Формирование_кода

Функция гПолучитьПредустановленныйКодВставитьЦикл(СписокКолонокТаблицыСРезультатомЗапроса) Экспорт
	
	лТекстПредустановленногоКода = "Для каждого СтрокаЗапроса из РезультатЗапроса() Цикл";
	
	Для каждого лКолонкаЗапроса Из СписокКолонокТаблицыСРезультатомЗапроса Цикл
		Если ТипЗнч(СписокКолонокТаблицыСРезультатомЗапроса) = Тип("СписокЗначений") Тогда 
			лСтруктураКолонки = лКолонкаЗапроса.Значение;
		Иначе
			лСтруктураКолонки = лКолонкаЗапроса;
		КонецЕсли;
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|	// СтрокаЗапроса." + лСтруктураКолонки.Имя;
	КонецЦикла; 
	
	лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|КонецЦикла;
		|
		|Сообщить(""Обработка закончена."", СтатусСообщения.Важное);";
	
	Возврат лТекстПредустановленногоКода
	
КонецФункции // гПолучитьПредустановленныйКодВставитьЦикл()

Функция гПолучитьПредустановленныйКодРедактироватьРегистрСведений(ПолноеИмяОбъектаМетаданных, ТекстЗапроса) Экспорт
	
	лСтруктураДанныхПоРегистру = ПолучитьСтруктуруДанныхПоОбъектуМетаданных(ПолноеИмяОбъектаМетаданных);
	 
	Если лСтруктураДанныхПоРегистру = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	лТекстПредустановленногоКода = 
	"лПозиция = 0;	
	|
	|лРезультатЗапроса = РезультатЗапроса();
	|
	|Для каждого СтрокаЗапроса из лРезультатЗапроса Цикл
	|	
	|	лПозиция = лПозиция + 1;
	|
	|	лМенеджерЗаписей = " + ПолноеИмяОбъектаМетаданных + ".СоздатьМенеджерЗаписи();
	|
	|";
	
	#Если НаКлиенте Тогда
	лТекстПредустановленногоКода = СтрЗаменить(лТекстПредустановленногоКода, "лПозиция = лПозиция + 1;", "ОбработкаПрерыванияПользователя();
	|	лПозиция = лПозиция + 1;
	|	Состояние(""Выполнено "" + Окр(лПозиция / лРезультатЗапроса.Количество() * 100) + ""%"");");
	#КонецЕсли
	
	Если лСтруктураДанныхПоРегистру.Периодический Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + Символы.ПС;
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лМенеджерЗаписей.Период = СтрокаЗапроса.Период;
		|";
	КонецЕсли;
	
	Если лСтруктураДанныхПоРегистру.Измерения.Количество() > 0 Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|	// измерения
		|";
		Для каждого ТекИзмерение Из лСтруктураДанныхПоРегистру.Измерения Цикл
			лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лМенеджерЗаписей." + ТекИзмерение  + " = СтрокаЗапроса." + ТекИзмерение + ";
			|";
		КонецЦикла; 
	КонецЕсли;
	
	Если лСтруктураДанныхПоРегистру.Ресурсы.Количество() > 0 Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|	// ресурсы
		|";
		Для каждого ТекРесурс Из лСтруктураДанныхПоРегистру.Ресурсы Цикл
			лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лМенеджерЗаписей." + ТекРесурс  + " = СтрокаЗапроса." + ТекРесурс + ";
			|";
		КонецЦикла; 
	КонецЕсли;
	
	Если лСтруктураДанныхПоРегистру.Реквизиты.Количество() > 0 Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|	// реквизиты
		|";
		Для каждого ТекРеквизит Из лСтруктураДанныхПоРегистру.Реквизиты Цикл
			лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лМенеджерЗаписей." + ТекРеквизит  + " = СтрокаЗапроса." + ТекРеквизит + ";
			|";
		КонецЦикла; 
	КонецЕсли;
	
	Если лСтруктураДанныхПоРегистру.Свойство("Регистратор") Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
		|	// Регистратор
		|	лМенеджерЗаписей.Регистратор = СтрокаЗапроса.Регистратор;
		|";
	КонецЕсли;
	
	лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
	|	//лМенеджерЗаписей.Записать();
	|	//лМенеджерЗаписей.Удалить();
	|
	|КонецЦикла;
	|
	|Сообщить(""Обработка закончена."", СтатусСообщения.Важное);";
		
	Возврат лТекстПредустановленногоКода;
	
КонецФункции // гПолучитьПредустановленныйКодРедактироватьРегистрСведений()

Функция гПолучитьПредустановленныйКодРедактироватьДокумент(ПолноеИмяОбъектаМетаданных, ТекстЗапроса) Экспорт
	
	лСтруктураДанныхПоОбъектуМетаданных = ПолучитьСтруктуруДанныхПоОбъектуМетаданных(ПолноеИмяОбъектаМетаданных);
	 
	Если лСтруктураДанныхПоОбъектуМетаданных = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	лТекстПредустановленногоКода = 
	"лПозиция = 0;	
	|
	|лРезультатЗапроса = РезультатЗапроса();
	|
	|Для каждого СтрокаЗапроса из лРезультатЗапроса Цикл
	|	
	|	ОбработкаПрерыванияПользователя();
	|	лПозиция = лПозиция + 1;
	|	Состояние(""Выполнено "" + Окр(лПозиция / лРезультатЗапроса.Количество() * 100) + ""%"");
	|	
	|	лОбъект = СтрокаЗапроса.Ссылка.ПолучитьОбъект();";
	
	Если лСтруктураДанныхПоОбъектуМетаданных.Реквизиты.Количество() > 0 Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + Символы.ПС;
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	// реквизиты" + Символы.ПС;
		Для каждого ТекРеквизит Из лСтруктураДанныхПоОбъектуМетаданных.Реквизиты Цикл
			лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лОбъект." + ТекРеквизит  + " = СтрокаЗапроса." + ТекРеквизит + ";" + Символы.ПС;
		КонецЦикла; 
	КонецЕсли;
	
	лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
	|	//лОбъект.ОбменДанными.Загрузка = Истина;
	|	лРежимЗаписиДокумента = РежимЗаписиДокумента.Запись;
	|	//лРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения;
	|	//лРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение;
	|	лРежимПроведенияДокумента = РежимПроведенияДокумента.Неоперативный;
	|	//лРежимПроведенияДокумента = РежимПроведенияДокумента.Оперативный;
	|	//лОбъект.Записать(лРежимЗаписиДокумента, лРежимПроведенияДокумента);
	|
	|КонецЦикла;
	|
	|Сообщить(""Обработка закончена."", СтатусСообщения.Важное);";
	
	Возврат лТекстПредустановленногоКода;
	
КонецФункции // гПолучитьПредустановленныйКодРедактироватьДокумент()

Функция гПолучитьПредустановленныйКодРедактироватьСправочник(ПолноеИмяОбъектаМетаданных, ТекстЗапроса) Экспорт
	
	лСтруктураДанныхПоОбъектуМетаданных = ПолучитьСтруктуруДанныхПоОбъектуМетаданных(ПолноеИмяОбъектаМетаданных);
	 
	Если лСтруктураДанныхПоОбъектуМетаданных = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	лТекстПредустановленногоКода = 
	"лПозиция = 0;	
	|
	|лРезультатЗапроса = РезультатЗапроса();
	|
	|Для каждого СтрокаЗапроса из лРезультатЗапроса Цикл
	|	
	|	ОбработкаПрерыванияПользователя();
	|	лПозиция = лПозиция + 1;
	|	Состояние(""Выполнено "" + Окр(лПозиция / лРезультатЗапроса.Количество() * 100) + ""%"");
	|	
	|	лОбъект = СтрокаЗапроса.Ссылка.ПолучитьОбъект();";
	
	Если лСтруктураДанныхПоОбъектуМетаданных.Реквизиты.Количество() > 0 Тогда 
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + Символы.ПС;
		лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	// реквизиты" + Символы.ПС;
		Для каждого ТекРеквизит Из лСтруктураДанныхПоОбъектуМетаданных.Реквизиты Цикл
			лТекстПредустановленногоКода = лТекстПредустановленногоКода + "	лОбъект." + ТекРеквизит  + " = СтрокаЗапроса." + ТекРеквизит + ";" + Символы.ПС;
		КонецЦикла; 
	КонецЕсли;
	
	лТекстПредустановленногоКода = лТекстПредустановленногоКода + "
	|	//лОбъект.ОбменДанными.Загрузка = Истина;
	|	//лОбъект.Записать();
	|
	|КонецЦикла;
	|
	|Сообщить(""Обработка закончена."", СтатусСообщения.Важное);";
	
	Возврат лТекстПредустановленногоКода;
	
КонецФункции // гПолучитьПредустановленныйКодРедактироватьСправочник()


Функция гСформироватьКодЗапросаДля1С(ТекстЗапроса, ПараметрыЗапроса, Режим, ЗначениеИзСтрокиВнутр = Ложь) Экспорт

	лРасчетныеПараметрыЗапроса = гПолучитьПараметрыЗапроса(ТекстЗапроса, True);
	
	Результат = "";
	
	Результат = "Запрос = Новый Запрос;" + Символы.ПС;
	Результат = Результат + "Запрос.Текст =" + Символы.ПС;
	
	// Символ(34)  - " (кавычки)
	// Символ(13)  - cr (возврат каретки)
	текПервыйРаз = Истина;
	Для Сч = 1 по СтрЧислоСтрок(ТекстЗапроса) цикл
		ТекСтр = СтрЗаменить(СтрПолучитьСтроку(ТекстЗапроса, Сч), Символ(13), "");
		ТекСтр = СтрЗаменить(ТекСтр,Символ(34),Символ(34) + Символ(34));
		Если Лев(СокрЛП(ТекСтр),1)<> "|" Тогда
			Результат = Результат + ?(НЕ текПервыйРаз, Символы.ПС, "") + ?(текПервыйРаз, """", "|") + ТекСтр;
			текПервыйРаз = Ложь;
		КонецЕсли;
	КонецЦикла;
	Результат = Результат  + """;" + Символы.ПС;
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		
		Для Каждого ТекПараметрЗапроса Из лРасчетныеПараметрыЗапроса Цикл
			СтрокаСПараметром = ПараметрыЗапроса.Получить(ТекПараметрЗапроса.Имя);
			
			Если СтрокаСПараметром = Неопределено Тогда
				Сообщить("Не задан параметр """ + ТекПараметрЗапроса.Имя + """");
			Иначе
				лЗначениеПараметра = ?(ЗначениеИзСтрокиВнутр, ЗначениеИзСтроки(СтрокаСПараметром.Значение), СтрокаСПараметром.Значение);
				Если ТипЗнч(лЗначениеПараметра) = Тип("СписокЗначений") Тогда
					ЗначениеПараметра = "кзСписок" + ТекПараметрЗапроса.Имя;
					Результат = Результат + ЗначениеПараметра + " = Новый СписокЗначений;" + Символы.ПС;
					Для каждого ТекЗначениеСписка Из лЗначениеПараметра Цикл
						Результат = Результат + "кзСписок" + ТекПараметрЗапроса.Имя + ".Добавить(" + КодДляПолученияЗначения(ТекЗначениеСписка.Значение) + ");" + Символы.ПС;
					КонецЦикла;
				Иначе
					ЗначениеПараметра = КодДляПолученияЗначения(лЗначениеПараметра);
				КонецЕсли;
			КонецЕсли;
			
			Результат = Результат + "Запрос.УстановитьПараметр(""" + ТекПараметрЗапроса.Имя + """, " +
				?(СтрокаСПараметром = Неопределено, "", ЗначениеПараметра) + ");" + Символы.ПС;
				
		КонецЦикла;
		
		Результат = Результат + Символы.ПС;
		
	КонецЕсли;
	
	Если Режим = 0 Тогда
		Результат = Результат + "Результат = Запрос.Выполнить();" + Символы.ПС;
		Результат = Результат + "Выборка = Результат.Выбрать();" + Символы.ПС;
		Результат = Результат + "Пока Выборка.Следующий() Цикл" + Символы.ПС;
		Результат = Результат + "КонецЦикла;" + Символы.ПС;
	ИначеЕсли Режим = 1 Тогда
		Результат = Результат + "Результат = Запрос.Выполнить();" + Символы.ПС;
		Результат = Результат + "Выборка = Результат.Выгрузить();" + Символы.ПС;
		Результат = Результат + "Для каждого СтрокаТЗ Из Выборка Цикл" + Символы.ПС;
		Результат = Результат + "КонецЦикла;" + Символы.ПС;
	ИначеЕсли Режим = 2 Тогда
		Результат = "//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			|// Данный фрагмент построен конструктором.
			|// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			|" + Результат;			
		Результат = Результат + "Результат = Запрос.Выполнить();" + Символы.ПС;
		Результат = Результат + "Выборка = Результат.Выбрать();" + Символы.ПС;
		Результат = Результат + "Пока Выборка.Следующий() Цикл" + Символы.ПС;
		Результат = Результат + "КонецЦикла;" + Символы.ПС;		
		Результат = Результат + "//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // гСформироватьКодЗапросаДля1С()

#КонецОбласти

#Область Работа_с_запросом

Функция гПолучитьПараметрыЗапроса(ТекстЗапроса, БезСообщений = False) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Попытка
		ПараметрыЗапроса = Запрос.НайтиПараметры();
	Исключение
		Если Не БезСообщений Тогда
			Сообщить("Ошибка в запросе: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецЕсли;
		Возврат Новый СписокЗначений;
	КонецПопытки;
	
	Возврат ПараметрыЗапроса                         
	
КонецФункции // гПолучитьПараметрыЗапроса()

Функция гВременнаяТаблицаВТЗ(ИмяВременнойТаблицы, МенеджерВременныхТаблиц) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Попытка
			ВремЗапрос = Новый Запрос;
			ВремЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			ВремЗапрос.Текст = "ВЫБРАТЬ * ИЗ " + ИмяВременнойТаблицы;
			Результат = ВремЗапрос.Выполнить().Выгрузить();
		Исключение
			Сообщить("Ошибка получения временной таблицы [" + ИмяВременнойТаблицы + "] - " + ОписаниеОшибки()); // #рефакторинг оформить сообщение об ошибке в процедуру для единообразия
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции // гВременнаяТаблицаВТЗ()

#КонецОбласти


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормаВыбораТипов

Функция URIПоТипу(ТипСтр) Экспорт

	СвязьUriType = Новый Структура;
	СвязьUriType.Вставить("core", "Array,TypeDescription,ValueListType,ValueTable,UUID");
	СвязьUriType.Вставить("enterprise", "Bound,PointOfTime");
	СвязьUriType.Вставить("XML", "boolean,dateTime,string,decimal");
	//Результат.Вставить("сс", "http://v8.1c.ru/8.1/data/enterprise/current-config"); // ссылки
	
	Для Каждого URI из СвязьUriType Цикл 
		Если СтрНайти(URI.Значение, ТипСтр) > 0 Тогда 
			Возврат URIПространстваИменТипов()[URI.Ключ];
		КонецЕсли;
	КонецЦикла;
	
	Если СтрНайти(ТипСтр, ".") > 0 Тогда Возврат URIПространстваИменТипов().сс КонецЕсли;
	
	ТекстОшибки = СтрШаблон("Ошибка определения URI по имени типа [%1]. Данный тип пока не доступен в обработке.", ТипСтр);
	
	Сообщить(ТекстОшибки);
	
	Возврат Неопределено;
	
КонецФункции // URIПоТипу()

Функция URIПространстваИменТипов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("core", "http://v8.1c.ru/8.1/data/core"); // "Array", "TypeDescription", "ValueListType", "UUID"
	Результат.Вставить("enterprise", "http://v8.1c.ru/8.1/data/enterprise"); // "Bound", "PointOfTime"
	Результат.Вставить("XML", "http://www.w3.org/2001/XMLSchema"); // "boolean", "dateTime", "string", "decimal"
	Результат.Вставить("сс", "http://v8.1c.ru/8.1/data/enterprise/current-config"); // ссылки
	
	Возврат Результат;	
	
КонецФункции

// Формирует таблицу значений с подробной информацией по доступным типам
//
// Параметры:
//   ДоступныеТипы - Массив - элементы массива доступные для выбора типы - Тип("---")
//   Ошибки - Массив (Необязательный) - массив с возможными ошибками для передачи в вызывающую процедуру
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений с данными по доступным типам
//
Функция ДетальнаяИнформацияПоТипам(ДоступныеТипы, Ошибки, СеансовыеДанные = Неопределено)
	
	Перем ПутьККартинкам, ВидПараметраПроизвольныйКод;		
	
	ОписаниеТипаСтроки = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(999));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ПолноеИмя", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("КоллекцияXML", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("Коллекция", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("ИмяДляКонструктора", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("Имя", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("URIПространстваИмен", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("Представление", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("Картинка");
	Результат.Колонки.Добавить("Вид", ОписаниеТипаСтроки);
	Результат.Колонки.Добавить("ИндексТипаВКоллекции", Новый ОписаниеТипов("Число"));
	
	ИндексТипаВКоллекции = 0;
	КэшКартинкиКоллекций = Новый Соответствие;
	Для Каждого ТипДанных Из ДоступныеТипы Цикл 
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИндексТипаВКоллекции = ИндексТипаВКоллекции;
		НоваяСтрока.Представление = Строка(ТипДанных);
		
		ВидПараметраПроизвольныйКод = ВидыПараметров().ПроизвольныйКод;		
		Если ТипДанных = ВидПараметраПроизвольныйКод Тогда 
			НоваяСтрока.ИмяДляКонструктора = ВидПараметраПроизвольныйКод;
			НоваяСтрока.Вид = ВидПараметраПроизвольныйКод;
		// #ДЛЯ РЕДАКТИРОВАНИЯ# + Здесь необходимо прописать недостающие типы данных вручную
		//	Пример:
		//ИначеЕсли ТипДанных = Тип("Структура") Тогда 
		//	НоваяСтрока.ИмяДляКонструктора = "Структура";
		//  НоваяСтрока.Вид = ВидыПараметров().Структура;
		// #ДЛЯ РЕДАКТИРОВАНИЯ# - Здесь необходимо прописать недостающие типы данных вручную
		ИначеЕсли ТипЗнч(ТипДанных) = Тип("Тип") Тогда 
			
			ТипXML = СериализаторXDTO.XMLТип(ТипДанных);
			Если ТипXML <> Неопределено Тогда 

				НоваяСтрока.ИмяДляКонструктора  = ТипXML.ИмяТипа;
				НоваяСтрока.URIПространстваИмен = ТипXML.URIПространстваИмен;

				ПерваяЧастьТипаXML = СтрРазделить(НоваяСтрока.ИмяДляКонструктора, ".")[0];
				
				Если СтрНайти(НРег(ПерваяЧастьТипаXML), "ref") > 0 Тогда 
					
					НоваяСтрока.КоллекцияXML = ПерваяЧастьТипаXML;
					
					ТипВМетаданных = Метаданные.НайтиПоТипу(ТипДанных);

					НоваяСтрока.ПолноеИмя = ТипВМетаданных.ПолноеИмя();
					ЧастиПолногоИмени = СтрРазделить(НоваяСтрока.ПолноеИмя, ".");
					НоваяСтрока.Коллекция = ЧастиПолногоИмени[0];
					НоваяСтрока.Имя       = ЧастиПолногоИмени[1];
					
				КонецЕсли;
			КонецЕсли;
			
			Если ТипXML.URIПространстваИмен = URIПространстваИменТипов().core Тогда 
				НоваяСтрока.Вид = ВидыПараметров().НеОтображаемыйВФорме;
			Иначе
				НоваяСтрока.Вид = ВидыПараметров().ОтображаемыйВФорме;
			КонецЕсли;			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.ИмяДляКонструктора) Тогда 
			
			Результат.Удалить(НоваяСтрока);
			
			Ошибки.Добавить(СтрШаблон("Тип данных %1 не учтен в обработке. 
			|Необходимо доработать код (поиск: #ДЛЯ ДОБАВЛЕНИЯ# - Здесь необходимо прописать недостающие типы данных вручную)", 
			ТипДанных)
			);
			
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Имя) Тогда 
			НоваяСтрока.Имя = НоваяСтрока.ИмяДляКонструктора;
		КонецЕсли;

		Если ЗначениеЗаполнено(НоваяСтрока.Коллекция) Тогда 
			
			КартинкаКоллекции = КэшКартинкиКоллекций.Получить(НоваяСтрока.Коллекция);
			
			Если ЗначениеЗаполнено(КартинкаКоллекции) Тогда 
				НоваяСтрока.Картинка = КартинкаКоллекции;
			Иначе
				Попытка
					НоваяСтрока.Картинка = БиблиотекаКартинок[НоваяСтрока.Коллекция];
					КэшКартинкиКоллекций.Вставить(НоваяСтрока.Коллекция, НоваяСтрока.Картинка);
				Исключение
					КэшКартинкиКоллекций.Вставить(НоваяСтрока.Коллекция, Новый Картинка);
				КонецПопытки;
			КонецЕсли;			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Картинка) Тогда 			
			Если Не ЗначениеЗаполнено(ПутьККартинкам) Тогда 
				ПутьККартинкам = гЗначениеИзСеансовыхДанных(СеансовыеДанные, ПоляСеансовыхДанных().ПутьККартинкамТипов);
			КонецЕсли;			
			НоваяСтрока.Картинка = ПолучитьВнешнююКартинку(НоваяСтрока.ИмяДляКонструктора, ПутьККартинкам);
		КонецЕсли;
		
		ИндексТипаВКоллекции = ИндексТипаВКоллекции + 1;
		
	КонецЦикла;
	
	Результат.Сортировать("Вид, Коллекция, Представление");
	
	Результат.Индексы.Добавить("ИндексТипаВКоллекции");
	
	Возврат Результат;
	
КонецФункции // ДетальнаяИнформацияПоТипам()

Функция СформироватьТаблицуСТипами(АдресТЗСИнформациейПоТипам, УникальныйИдентификаторФормы, Ошибки, СеансовыеДанные = Неопределено) Экспорт
	
	Перем ДоступныеТипы;

	ДоступныеТипы = Метаданные().Реквизиты.ДоступныеТипыДанных.Тип.Типы();
	
	ДоступныеТипы.Добавить(Тип("Массив"));
	ДоступныеТипы.Добавить(Тип("МоментВремени"));
	ДоступныеТипы.Добавить(Тип("Граница"));
	ДоступныеТипы.Добавить(Тип("ТаблицаЗначений"));
	// #ДЛЯ РЕДАКТИРОВАНИЯ# + Здесь необходимо прописать недостающие типы данных вручную
	//	Пример:
	//  ДоступныеТипы.Добавить(Тип("Структура"));
	// #ДЛЯ РЕДАКТИРОВАНИЯ# - Здесь необходимо прописать недостающие типы данных вручную
	
	// технический тип(вид) данных
	ДоступныеТипы.Добавить(ВидыПараметров().ПроизвольныйКод);
	
	АдресТЗСИнформациейПоТипам = ПоместитьВоВременноеХранилище(
		ДетальнаяИнформацияПоТипам(ДоступныеТипы, Ошибки, СеансовыеДанные), УникальныйИдентификаторФормы);
		
	Возврат Не (ЗначениеЗаполнено(Ошибки) И Ошибки.Количество() > 0);
	
КонецФункции // СформироватьТаблицуСТипами()

Функция ВидыПараметров() Экспорт
	
	Перем Результат;
	
	Результат = Новый Структура;
	Результат.Вставить("ОтображаемыйВФорме", "ОтображаемыйВФорме");
	Результат.Вставить("НеОтображаемыйВФорме", "НеОтображаемыйВФорме");
	Результат.Вставить("ПроизвольныйКод", "ПроизвольныйКод");
	
	Возврат Результат;
	
КонецФункции

Функция ПространстваИмен() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("v8", "http://v8.1c.ru/data");
	Результат.Вставить("w3", "http://www.w3.org/2001/XMLSchema");
	
	Возврат Результат;
	
КонецФункции

//Функция ПолучитьВнешнююКартинку(ИмяКартинки, ПутьККартинке)
//	
//	Если Не ЕстьКартинкавоВнешнейБиблиотеке(ИмяКартинки) Тогда 
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	лПолныйПутьККартинке = ПутьККартинке + "\" + ИмяКартинки + ".png";
//	
//	Попытка		
//		Результат = Новый Картинка(лПолныйПутьККартинке);
//	Исключение
//		
//		Результат = Неопределено;
//		
//	КонецПопытки; 
//	
//	Возврат Результат
//	
//КонецФункции // ПолучитьВнешнююКартинку()

#КонецОбласти

#Область Универсальные_процедуры_и_функции

Функция ЗначениеИзСтроки(СтрокаJSON, ИмяФайла = "")
	
	Если ПустаяСтрока(СтрокаJSON) Тогда 
		Возврат "";
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Если ЗначениеЗаполнено(ИмяФайла) Тогда 
		ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	Иначе
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	КонецЕсли;

	Ошибка = "";
	Попытка
		ПроизвольноеЗначение = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);	
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;

	Если ПустаяСтрока(Ошибка) Тогда 
		ЧтениеJSON.Закрыть();
		Возврат ПроизвольноеЗначение
	КонецЕсли;
	
	#Если Сервер Тогда
	ПроизвольноеЗначение = ЗначениеИзСтрокиВнутр(СтрокаJSON);
	
	Возврат ПроизвольноеЗначение;
	#Иначе
	ВызватьИсключение Ошибка;
	#КонецЕсли
		
КонецФункции // ЗначениеИзСтроки()

Функция гТекстВТаблицуНаСервере(СтруктураПараметров) Экспорт
	
	Перем Текст, ИдентификаторФормы, Разделитель, ВернутьТЗ;
	
	СтруктураПараметров.Свойство("Текст"             , Текст);
	СтруктураПараметров.Свойство("ИдентификаторФормы", ИдентификаторФормы);
	
	Если Не СтруктураПараметров.Свойство("Разделитель", Разделитель) Тогда 
		Разделитель = Символы.Таб;
	КонецЕсли;
	
	лТаблицаЗначений = Новый ТаблицаЗначений;
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат лТаблицаЗначений;
	КонецЕсли;
	
	Если Разделитель = Неопределено Тогда 
		Разделитель = Символы.Таб;
	КонецЕсли;
	
	лТекстовыйДокумент = Новый ТекстовыйДокумент;	
	лТекстовыйДокумент.УстановитьТекст(Текст);
	
	лКоличествоКолонок = Неопределено;
	
	Для сч = 1 По лТекстовыйДокумент.КоличествоСтрок() Цикл
		
		лТекущаяСтрока = СокрЛП(лТекстовыйДокумент.ПолучитьСтроку(сч));
		
		Если ПустаяСтрока(лТекущаяСтрока) Тогда 
			Продолжить;
		КонецЕсли;
		
		лМассивКолонокСтрокиТаблицы = гРазложитьСтрокуВМассивПодстрок(лТекущаяСтрока, Разделитель);
		лКоличествоКолонокТек       = лМассивКолонокСтрокиТаблицы.Количество();
		
		Если лКоличествоКолонок <> Неопределено И лКоличествоКолонокТек <> лКоличествоКолонок Тогда 
			
			лТекстОшибки = гПодставитьПараметрыВСтроку("Количество колонок в первой строке (%1) отличается от количества колонок в текущей строке (%2)", 
				лКоличествоКолонок, лКоличествоКолонокТек);
				
			Если лКоличествоКолонокТек > лКоличествоКолонок Тогда 
				лКоличествоКолонокТек = лКоличествоКолонок;
			КонецЕсли;	
				
			Сообщить(лТекстОшибки, СтатусСообщения.Важное);
		КонецЕсли;
		
		Если сч = 1 Тогда 
			Для Сч1 = 0 По лКоличествоКолонокТек - 1 Цикл
				лКоличествоКолонок = лМассивКолонокСтрокиТаблицы.Количество();
				НоваяКолонка       = лТаблицаЗначений.Колонки.Добавить();
				НоваяКолонка.Имя   = "НоваяКолонка__" + Формат(Сч1, "ЧН=; ЧГ=0");
			КонецЦикла; 
		КонецЕсли;
		
		НоваяСтрока = лТаблицаЗначений.Добавить();
		
		Для сч2 = 0 По лКоличествоКолонокТек - 1 Цикл
			НоваяСтрока[сч2] = лМассивКолонокСтрокиТаблицы[сч2];
		КонецЦикла; 
	КонецЦикла; 
	
	Если ИдентификаторФормы = Неопределено Тогда 
		Возврат лТаблицаЗначений;
	Иначе
		Возврат ПоместитьВоВременноеХранилище(лТаблицаЗначений, ИдентификаторФормы);
	КонецЕсли;
	
КонецФункции // гТекстВТаблицуНаСервере()

Функция гПолучитьСледующееУникальноеИмя(Знач ИсходноеИмя, Коллекция, ИмяПоля = Неопределено) Экспорт
	
	Сч = 0;	
	Пока гНайтиЗначениеБезУчетаРегистра(ИсходноеИмя + ?(Сч = 0, "", Формат(Сч, "ЧГ=0")), Коллекция, ИмяПоля) <> Неопределено Цикл
		Сч = Сч + 1;
	КонецЦикла;

	Возврат ИсходноеИмя + ?(Сч = 0, "", Формат(Сч, "ЧГ=0"));
КонецФункции // гПолучитьСледующееУникальноеИмя()

Функция гНайтиЗначениеБезУчетаРегистра(Значение, Знач Коллекция, Поле = Неопределено, МетодПоиска = Неопределено, МножественныйВыбор = Ложь) Экспорт
	
	Если МножественныйВыбор Тогда 
		Результат = Новый Массив;
	КонецЕсли;
	
	Если МетодПоиска = гМетодыПоискаВСтроке().Вконце Тогда 
		лНаправлениеПоиска         = НаправлениеПоиска.СКонца;
	Иначе
		лНаправлениеПоиска         = НаправлениеПоиска.СНачала;
		лКорректныйРезультатПоиска = 1;
	КонецЕсли;
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если Поле = Неопределено Тогда 
			лЗначениеИзКоллекции = СтрокаКоллекции
		Иначе
			лЗначениеИзКоллекции = СтрокаКоллекции[Поле]
		КонецЕсли;
		
		Если МетодПоиска = Неопределено ИЛИ МетодПоиска = гМетодыПоискаВСтроке().Точно Тогда 
			Если НРЕГ(лЗначениеИзКоллекции) = НРЕГ(Значение) Тогда // #рефакторинг оптимизировать поиск через стандартные функции поиска
				Если Не МножественныйВыбор Тогда 
					Возврат СтрокаКоллекции
				КонецЕсли;
				Результат.Добавить(СтрокаКоллекции);
			КонецЕсли;
			
		Иначе
			
			Если МетодПоиска = гМетодыПоискаВСтроке().Вконце Тогда 
				лКорректныйРезультатПоиска = СтрДлина(Значение);
			КонецЕсли;
			
			лРезультатПоиска = СтрНайти(НРЕГ(лЗначениеИзКоллекции), НРЕГ(Значение), лНаправлениеПоиска);
			
			Если лРезультатПоиска = лКорректныйРезультатПоиска ИЛИ МетодПоиска = гМетодыПоискаВСтроке().Посередине И лРезультатПоиска > 0 Тогда 
				Если Не МножественныйВыбор Тогда 
					Возврат СтрокаКоллекции
				КонецЕсли;
				Результат.Добавить(СтрокаКоллекции);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если МножественныйВыбор Тогда 
		Возврат Результат
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции // гНайтиЗначениеБезУчетаРегистра()

Функция СоздатьКаталогРекурсивно(Путь)
	
	Если Путь = "" Тогда 
		Возврат Ложь
	КонецЕсли;
	
	лФайл = Новый Файл(Путь);
	Если лФайл.Существует() Тогда 
		Возврат Истина
	КонецЕсли;
	
	лМассив     = СтрокаВМассив(Путь, "\");
	лПодкаталог = "";
	Сч          = 0;
	Пока Сч < лМассив.Количество() - 1 Цикл
		лПодкаталог = лПодкаталог + ?(лПодкаталог = "", "", "\") + лМассив[Сч];
		Сч = Сч + 1
	КонецЦикла;
	
	СоздатьКаталогРекурсивно(лПодкаталог);
	
	СоздатьКаталог(Путь);
	
	лФайл = Новый Файл(Путь);                                                                             
	Возврат лФайл.Существует();
	
КонецФункции // СоздатьКаталогРекурсивно()

// Функция заменяет все некорректные символы на выбранный символ-заменитель
//
Функция гПреобразоватьВПравильноеНазвание(Знач ИсходноеНазвание, ДополнительныеСимволы = "") Экспорт
	
	Если СокрЛП(ИсходноеНазвание) = "" Тогда 
		Возврат "";
	КонецЕсли;
	
	ЗаменительНекорректныхСимволов = "_";
	ДоступныеСимволы               = ЗаменительНекорректныхСимволов + "qwertyuiopasdfghjklzxcvbnmйцукенгшщзхъфывапролджэячсмитьбю" + ДополнительныеСимволы;
	ДоступныеНеНачальныеСимволы    = "1234567890";
	
	сч = 0;
	Пока сч <= СтрДлина(ИсходноеНазвание) Цикл
		сч = сч + 1;
		лТекСимвол = Сред(НРег(ИсходноеНазвание), сч, 1);
		Если сч = 1 Тогда 
			Если Найти(ДоступныеСимволы, лТекСимвол) = 0 Тогда
				ИсходноеНазвание = ЗаменительНекорректныхСимволов + Сред(ИсходноеНазвание, 2); 
				сч = сч - 1;
			КонецЕсли;
		Иначе
			Если Найти(ДоступныеСимволы + ДоступныеНеНачальныеСимволы, лТекСимвол) = 0 Тогда
				ИсходноеНазвание = СтрЗаменить(ИсходноеНазвание, лТекСимвол, ЗаменительНекорректныхСимволов);
				сч = сч - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИсходноеНазвание
	
КонецФункции // гПреобразоватьВПравильноеНазвание()

Функция гПредставлениеЗначения(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда 
		Возврат "Таблица значений (Строк = " + Значение.Количество() + "; Колонок = " + Значение.Колонки.Количество() + ")" 
	//ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени"") Тогда 
	//ИначеЕсли ТипЗнч(Значение) = Тип("Граница"") Тогда 
	Иначе
		Возврат Строка(Значение);
	КонецЕсли;
КонецФункции // гПредставлениеТаблицы()

Функция СтрокаВМассив(ИсходнаяСтрока, Разделитель = ",", ДобавитьИсходнуюСтрокуВКонецМассива = Ложь, РазмерМассива = 0)
	
	Массив = "Массив = Новый Массив;Массив.Добавить("""+СтрЗаменить(ИсходнаяСтрока,Разделитель,""");Массив.Добавить(""")+""");";
	Выполнить(Массив); 
	
	УдаленныйФрагмент = "";
	
	Если РазмерМассива > 0 Тогда 
		Пока Массив.Количество() > РазмерМассива Цикл 
			УдаленныйФрагмент = Массив[Массив.Количество() - 1] + ?(УдаленныйФрагмент = "", "", Разделитель) + УдаленныйФрагмент;
			Массив.Удалить(Массив.Количество() - 1);
		КонецЦикла;
		
		Если ДобавитьИсходнуюСтрокуВКонецМассива И УдаленныйФрагмент <> "" Тогда 
			Массив.Добавить(УдаленныйФрагмент);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Массив
	
КонецФункции // СтрокаВМассив()

#КонецОбласти

#Область Сеансовые_данные

Функция ПоляСеансовыхДанных() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторСеанса", "ИдентификаторСеанса");
	Результат.Вставить("КаталогВременныхФайлов", "КаталогВременныхФайлов");
	Результат.Вставить("ПутьККартинкам", "ПутьККартинкам");
	Результат.Вставить("ПутьККартинкамТипов", "ПутьККартинкамТипов");	
	Результат.Вставить("ДоступныеТипыДанных", "ДоступныеТипыДанных"); // ??? Удалить ?
	Результат.Вставить("КЭШ", "КЭШ");
	
	Возврат Результат;
	
КонецФункции
	
Процедура гИнициализацироватьСеансовыеДанные(УникальныйИдентификатор, АдресСеансовыхДанных) Экспорт

	КаталогВременныхФайлов = КаталогВременныхФайловОбработки() + гПреобразоватьВПравильноеНазвание(гНазваниеОбработки()) + "\";
	
	СеансовыеДанные = Новый Структура();	
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().ИдентификаторСеанса, Новый УникальныйИдентификатор);
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().КаталогВременныхФайлов, КаталогВременныхФайлов);
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().ПутьККартинкам, ИзвлечьКартинкиОбработкиНаСервере("БиблиотекаКартинок", КаталогВременныхФайлов));
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().ПутьККартинкамТипов, ИзвлечьКартинкиОбработкиНаСервере("typesimages", КаталогВременныхФайлов));
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().ДоступныеТипыДанных, Метаданные().Реквизиты.ДоступныеТипыДанных.Тип.Типы());
	СеансовыеДанные.Вставить(ПоляСеансовыхДанных().КЭШ, Новый Структура);
	
	АдресСеансовыхДанных = ПоместитьВоВременноеХранилище(СеансовыеДанные, УникальныйИдентификатор);
	
КонецПроцедуры // гИнициализацироватьСеансовыеДанные()

Функция гЗначениеИзСеансовыхДанных(АдресСеансовыхДанных, Имя) Экспорт
	
	Перем Значение;
	
	
	Если ЭтоАдресВременногоХранилища(АдресСеансовыхДанных) Тогда 
		СеансовыеДанные = ПолучитьИзВременногоХранилища(АдресСеансовыхДанных);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СеансовыеДанные) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СеансовыеДанные.Свойство(Имя, Значение);
		
	Возврат Значение;
	
КонецФункции // гЗначениеИзСеансовыхДанных()

Процедура гЗначениеВСеансовыеДанные(Имя, Значение, СеансовыеДанные) Экспорт
	
	СеансовыеДанные.Вставить(Имя, Значение);
	
КонецПроцедуры // гЗначениеВСеансовыеДанные()

Функция гЗначениеИзКэшаСеансовыхДанных(ИмяВКэше, Значение, Знач СтруктураКЭШ) Экспорт
	
	// #рефакторинг переходный период, необходимо пересмотреть работу с кэшем
	Если СтруктураКЭШ = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(СтруктураКЭШ) Тогда 
		СтруктураКЭШ = ПолучитьИзВременногоХранилища(СтруктураКЭШ);
	КонецЕсли;
	
	Возврат СтруктураКЭШ.Свойство(ИмяВКэше, Значение);
	
КонецФункции // гЗначениеИзКэшаСеансовыхДанных()

Процедура гЗначениеВКэшСеансовыхДанных(ИмяВКэше, Значение, СтруктураКЭШИлиАдрес, УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	// #рефакторинг переходный период, необходимо пересмотреть работу с кэшем
	Если СтруктураКЭШИлиАдрес = Неопределено Тогда 
		СтруктураКЭШ = Новый Структура;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(СтруктураКЭШИлиАдрес) Тогда 
		Если УникальныйИдентификаторФормы <> Неопределено Тогда 
			СтруктураКЭШ = ПолучитьИзВременногоХранилища(СтруктураКЭШИлиАдрес);
			СтруктураКЭШ.Вставить(ИмяВКэше, Значение);
			СтруктураКЭШИлиАдрес = ПоместитьВоВременноеХранилище(СтруктураКЭШ, УникальныйИдентификаторФормы);
		КонецЕсли;
	Иначе
		СтруктураКЭШ.Вставить(ИмяВКэше, Значение);
	КонецЕсли;
	
КонецПроцедуры // гЗначениеВКэшСеансовыхДанных()

#КонецОбласти

#Область Работа_с_интернет

Функция ПолучитьHTTPСоединение(Сервер, НастройкиПрокси)

	Попытка
		Если ЗначениеЗаполнено(НастройкиПрокси) И НастройкиПрокси.Использовать Тогда 
			лПроксиСервер = Новый ИнтернетПрокси;
			лПроксиСервер.Установить(НастройкиПрокси.Протокол, 
				НастройкиПрокси.Сервер, 
				НастройкиПрокси.Порт, 
				?(НастройкиПрокси.ИспользоватьАутентификациюОС, Неопределено, НастройкиПрокси.Пользователь), 
				?(НастройкиПрокси.ИспользоватьАутентификациюОС, Неопределено, НастройкиПрокси.Пароль), 
				НастройкиПрокси.ИспользоватьАутентификациюОС);
			лСоединение = Новый HTTPСоединение(Сервер,,,, лПроксиСервер);
		Иначе
			лСоединение = Новый HTTPСоединение(Сервер);
		КонецЕсли;
		лСоединение = Новый HTTPСоединение(Сервер);
	Исключение
		ВызватьИсключение(ОписаниеОшибки() + Символы.ПС + "Попробуйте использовать/изменить настройки прокси.");
		// "Ошибка работы с Интернет:   Не могу установить соединение"
		Сообщить(, СтатусСообщения.Важное);
	КонецПопытки; 
	
	Возврат лСоединение;

КонецФункции // ПолучитьHTTPСоединение()

#КонецОбласти

#Область ДобавлениеВоВнешниеОбработки

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = Новый Структура;
    МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ИзменениеШтатногоРасписания");
	
    ПараметрыРегистрации.Вставить("Вид"            , "ДополнительнаяОбработка"); // может быть - ЗаполнениеОбъекта, 
	                                                                             // ДополнительныйОтчет, 
																				 // СозданиеСвязанныхОбъектов... 
    ПараметрыРегистрации.Вставить("Назначение"     , МассивНазначений);
    ПараметрыРегистрации.Вставить("Наименование"   , "Консоль запросов");        // имя под которым обработка будет 
	                                                                             // зарегистрирована в справочнике 
																				 // внешних обработок
    ПараметрыРегистрации.Вставить("Версия"         , ВерсияОбработки());
    ПараметрыРегистрации.Вставить("ВерсияБСП"      , "1.2.1.4");
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    ПараметрыРегистрации.Вставить("Информация"     , "Консоль запросов");        // так будет выглядеть описание  
	                                                                             // печ.формы для пользователя
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
    ДобавитьКоманду(ТаблицаКоманд, "Консоль запросов", "КонсольЗапросов", "ВызовКлиентскогоМетода", Истина);
                                  
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
    Возврат ПараметрыРегистрации;
	
КонецФункции // СведенияОВнешнейОбработке()

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    
    Возврат Команды;
    
КонецФункции

Функция ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
    
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление          = Представление;
    НоваяКоманда.Идентификатор          = Идентификатор;
    НоваяКоманда.Использование          = Использование;
    НоваяКоманда.ПоказыватьОповещение   = ПоказыватьОповещение;
    НоваяКоманда.Модификатор            = Модификатор;
    
КонецФункции

#КонецОбласти

#Область Работа_с_метаданными

// Возвращает строковое представление типа по значению.
//
// Параметры:
//	Значение - передаваемое значение.
//
Функция ИмяТипаИзЗначения(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		ИмяТипа = "Строка";
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		ИмяТипа = "Число";
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		ИмяТипа = "Булево";
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		ИмяТипа = "Дата";
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда
		ИмяТипа = "МоментВремени";
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда
		ИмяТипа = "Строка";
	Иначе	
		ИмяТипа = xmlТип(ТипЗнч(Значение)).ИмяТипа;
	КонецЕсли;
	
	Возврат ИмяТипа;
КонецФункции

Функция КодДляПолученияЗначения(Значение)
	
	Результат = Значение;
	Если Значение <> Неопределено Тогда
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
			ИмяМетаданного = Значение.Метаданные().Имя; 
			Если Значение.Пустая() Тогда
				Результат = "Справочники." + ИмяМетаданного + ".ПустаяСсылка()"
			ИначеЕсли Значение.Предопределенный Тогда
				Результат = "Справочники." + ИмяМетаданного + "." + 
						Справочники[ИмяМетаданного].ПолучитьИмяПредопределенного(Значение)
			Иначе    
				Если Метаданные.Справочники[ИмяМетаданного].ДлинаКода > 0 Тогда
					Результат = "Справочники." + ИмяМетаданного + ".НайтиПоКоду(""" + Значение.Код + """)"
				Иначе	
					Результат = "Справочники." + ИмяМетаданного + ".НайтиПоНаименованию(""" + Значение.Наименование + """, Истина)"
				КонецЕсли
			КонецЕсли;
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
            ИмяМетаданного = Значение.Метаданные().Имя; 
            Если Значение.Пустая() Тогда
                Результат = "Документы." + ИмяМетаданного + ".ПустаяСсылка()";
            Иначе    
                Результат = "Документы." + ИмяМетаданного + ".НайтиПоНомеру(""" + Значение.Номер + """)";
            КонецЕсли;
		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
			ИмяМетаданного = Значение.Метаданные().Имя; 
			Если Значение.Пустая() Тогда
				Результат = "ПланыВидовХарактеристик." + ИмяМетаданного + ".ПустаяСсылка()"
			ИначеЕсли Значение.Предопределенный Тогда
				Результат = "ПланыВидовХарактеристик." + ИмяМетаданного + "." + 
						ПланыВидовХарактеристик[ИмяМетаданного].ПолучитьИмяПредопределенного(Значение)
			Иначе    
				Если Метаданные.ПланыВидовХарактеристик[ИмяМетаданного].ДлинаКода > 0 Тогда
					Результат = "ПланыВидовХарактеристик." + ИмяМетаданного + ".НайтиПоКоду(""" + Значение.Код + """)"
				Иначе	
					Результат = "ПланыВидовХарактеристик." + ИмяМетаданного + ".НайтиПоНаименованию(""" + Значение.Наименование + """, Истина)"
				КонецЕсли
			КонецЕсли;
		ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
			ИмяМетаданного = Значение.Метаданные().Имя; 
			Если Значение.Пустая() Тогда
				Результат = "ПланыВидовРасчета." + ИмяМетаданного + ".ПустаяСсылка()"
			ИначеЕсли Значение.Предопределенный Тогда
				Результат = "ПланыВидовРасчета." + ИмяМетаданного + "." + 
						ПланыВидовРасчета[ИмяМетаданного].ПолучитьИмяПредопределенного(Значение)
			Иначе    
				Если Метаданные.ПланыВидовРасчета[ИмяМетаданного].ДлинаКода > 0 Тогда
					Результат = "ПланыВидовРасчета." + ИмяМетаданного + ".НайтиПоКоду(""" + Значение.Код + """)"
				Иначе	
					Результат = "ПланыВидовРасчета." + ИмяМетаданного + ".НайтиПоНаименованию(""" + Значение.Наименование + """, Истина)"
				КонецЕсли
			КонецЕсли;
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
			ИмяМетаданного = Значение.Метаданные().Имя; 
			Если Значение.Пустая() Тогда
				Результат = "Перечисления." + ИмяМетаданного + ".ПустаяСсылка()"
			Иначе    
				Результат = "Перечисления." + ИмяМетаданного + "." + Метаданные.Перечисления[ИмяМетаданного].ЗначенияПеречисления[Перечисления[ИмяМетаданного].Индекс(Значение)].Имя
			КонецЕсли;
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
			ИмяМетаданного = Значение.Метаданные().Имя; 
			Если Значение.Пустая() Тогда
				Результат = "ПланыСчетов." + ИмяМетаданного + ".ПустаяСсылка()"
			ИначеЕсли Значение.Предопределенный Тогда
				Результат = "ПланыСчетов." + ИмяМетаданного + "." + 
						ПланыСчетов[ИмяМетаданного].ПолучитьИмяПредопределенного(Значение)
			Иначе    
				Если Метаданные.ПланыСчетов[ИмяМетаданного].ДлинаКода > 0 Тогда
					Результат = "ПланыСчетов." + ИмяМетаданного + ".НайтиПоКоду(""" + Значение.Код + """)"
				Иначе	
					Результат = "ПланыСчетов." + ИмяМетаданного + ".НайтиПоНаименованию(""" + Значение.Наименование + """, Истина)"
				КонецЕсли
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
				Результат = "Дата(""" + Значение + """)"
        ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда
            Результат = "Новый МоментВремени(Дата(""" + Значение.Дата + """), " + КодДляПолученияЗначения(Значение.Ссылка) + ")";   			
		ИначеЕсли ТипЗнч(Значение) = Тип("ВидДвиженияНакопления") Тогда
				Результат = "ВидДвиженияНакопления." + Значение
		ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
				Результат = """" + Значение + """"
		ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
				Результат = Формат(Значение, "ЧГ = ")
		КонецЕсли;

	КонецЕсли;
		
	Возврат Результат 	
	
КонецФункции // КодДляПолученияЗначения()

Функция ЭтоСсылка(Тип)
	
	//Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)
	//ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)
	//ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип);
	
	XMLТипа = XMLТип(Тип);
	Если XMLТипа = Неопределено Тогда 
		Возврат Ложь
	КонецЕсли;
	
	Если Найти(XMLТипа.ИмяТипа, "Ref.") > 0 Тогда 
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ЭтоСсылка()

Функция ЭтоТипТабличнаяЧасть(Тип)
	
	// 1- й вариант (не полный)
	//Если Найти(Строка(Тип), "Документ табличная часть:") > 0 ИЛИ Найти(Строка(Тип), "Справочник табличная часть:") > 0 Тогда 
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	Если ОбъектМетаданных = Неопределено ИЛИ ТипЗнч(ОбъектМетаданных.Родитель()) = Тип("ОбъектМетаданныхКонфигурация") Тогда 
		Возврат Ложь
	Иначе
		Возврат ОбъектМетаданных.Родитель().ТабличныеЧасти.Найти(ОбъектМетаданных.Имя) <> Неопределено;
	КонецЕсли;
	
КонецФункции // ЭтоТипТабличнаяЧасть()

Функция СписокМетаданных(СтруктураКЭШ)

	Список = Новый СписокЗначений;
	
	Список.Добавить("ПланОбмена"            , "ПланыОбмена");
	Список.Добавить("КритерийОтбора"        , "КритерииОтбора");
	Список.Добавить("Константы"             , "Константы");
	Список.Добавить("Справочник"            , "Справочники");
	Список.Добавить("Документ"              , "Документы");
	Список.Добавить("Последовательность"    , "Последовательности");
	Список.Добавить("ЖурналДокументов"      , "ЖурналыДокументов");
	Список.Добавить("Перечисление"          , "Перечисления");
	Список.Добавить("ПланВидовХарактеристик", "ПланыВидовХарактеристик");
	Список.Добавить("ПланСчетов"            , "ПланыСчетов");
	Список.Добавить("ПланВидовРасчета"      , "ПланыВидовРасчета");
	Список.Добавить("РегистрСведений"       , "РегистрыСведений");
	Список.Добавить("РегистрНакопления"     , "РегистрыНакопления");
	Список.Добавить("РегистрБухгалтерии"    , "РегистрыБухгалтерии");
	Список.Добавить("РегистрРасчета"        , "РегистрыРасчета");
	Список.Добавить("БизнесПроцесс"         , "БизнесПроцессы");
	Список.Добавить("Задача"                , "Задачи");
	
	Если СтруктураКЭШ <> Неопределено Тогда 
		Для Каждого лТекМетаданное Из Список Цикл 
			лТекМетаданное.Картинка = ПолучитьКартинкуПоМетаданному(лТекМетаданное.Представление, СтруктураКЭШ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат  Список;

КонецФункции // СписокМетаданных()

Функция СписокКоллекцийОбъектаМетаданных(ИмяМетаданного, ИмяОбъектаМетаданных, СтруктураКЭШ, ПутьКАртинке)
	
	Перем лКартинка;
	
	СписокКоллекций = Новый СписокЗначений;
	
	лКартинка = ПолучитьКартинкуПоМетаданному(ИмяМетаданного, СтруктураКЭШ);
	
	Если ИмяМетаданного = "Справочники" ИЛИ ИмяМетаданного = "Документы" тогда
		
		лКартинка = ПолучитьКартинку("МетаданныеСвойстваОбъектовТабличнаяЧасть", ПутьКАртинке, СтруктураКЭШ);
		
		Попытка
			лОбъектМетаданных = Вычислить("Метаданные[""" + ИмяМетаданного + """][""" + ИмяОбъектаМетаданных + """]");
		Исключение
			Возврат СписокКоллекций;
		КонецПопытки; 
		
		лКоллекция = лОбъектМетаданных.ТабличныеЧасти;
		Для Каждого ЭлементКоллекции из лКоллекция Цикл
			СписокКоллекций.Добавить(ЭлементКоллекции.Имя, ЭлементКоллекции.Имя, , лКартинка);
		КонецЦикла;
		                                                     
	ИначеЕсли ИмяМетаданного = "РегистрыБухгалтерии" тогда
		
		СписокКоллекций.Добавить("Субконто()"         , "Субконто"         ,, лКартинка);
		СписокКоллекций.Добавить("ДвиженияССубконто()", "ДвиженияССубконто",, лКартинка);
		СписокКоллекций.Добавить("Остатки()"          , "Остатки"          ,, лКартинка);
		СписокКоллекций.Добавить("Обороты()"          , "Обороты"          ,, лКартинка);
		СписокКоллекций.Добавить("ОстаткиИОбороты()"  , "ОстаткиИОбороты"  ,, лКартинка);
		СписокКоллекций.Добавить("ОборотыДтКт()"      , "ОборотыДтКт"      ,, лКартинка);
		
	ИначеЕсли ИмяМетаданного = "РегистрыНакопления" тогда
		
		СписокКоллекций.Добавить("Обороты()"        , "Обороты"        ,, лКартинка);
		СписокКоллекций.Добавить("Остатки()"        , "Остатки"        ,, лКартинка);
		СписокКоллекций.Добавить("ОстаткиИОбороты()", "ОстаткиИОбороты",, лКартинка);
		
	ИначеЕсли ИмяМетаданного = "РегистрыРасчета" тогда
		
		лКартинка = ПолучитьКартинку("МетаданныеСвойстваОбъектовПерерасчет", ПутьКАртинке, СтруктураКЭШ);
		
		лОбъектМетаданных = Вычислить("Метаданные[""" + ИмяМетаданного + """][""" + ИмяОбъектаМетаданных + """]");
		
		лКоллекция = лОбъектМетаданных.Перерасчеты;
		
		Для Каждого ЭлементКоллекции из лКоллекция Цикл
			СписокКоллекций.Добавить(ЭлементКоллекции.Имя, ЭлементКоллекции.Имя,, лКартинка);
		КонецЦикла;
		
		СписокКоллекций.Добавить("ФактическийПериодДействия()", "ФактическийПериодДействия",, лКартинка);
		СписокКоллекций.Добавить("ДанныеГрафика"              , "ДанныеГрафика"            ,, лКартинка);
		
	ИначеЕсли ИмяМетаданного = "РегистрыСведений" тогда
		
		СписокКоллекций.Добавить("СрезПоследних()", "СрезПоследних",, лКартинка);
		СписокКоллекций.Добавить("СрезПервых()"   , "СрезПервых"   ,, лКартинка);
		
	ИначеЕсли ИмяМетаданного = "Последовательности" тогда
		
		СписокКоллекций.Добавить("Границы", "Границы",, лКартинка);
		
	ИначеЕсли ИмяМетаданного = "БизнесПроцесс" тогда
		
		СписокКоллекций.Добавить("Точки", "Точки");
		
	ИначеЕсли ИмяМетаданного = "Задача" тогда
	ИначеЕсли ИмяМетаданного = "КритерийОтбора" тогда
	ИначеЕсли ИмяМетаданного = "ЖурналыДокументов" тогда
	ИначеЕсли ИмяМетаданного = "ПланыВидовРасчета" тогда
	ИначеЕсли ИмяМетаданного = "ПланыВидовХарактеристик" тогда
	ИначеЕсли ИмяМетаданного = "ПланыОбмена" тогда
	ИначеЕсли ИмяМетаданного = "ПланыСчетов" тогда
	КонецЕсли;
	
	Возврат СписокКоллекций
	
КонецФункции // СписокКоллекцийОбъектаМетаданных()

Функция ПоляОбъектовМетаданных(ИмяМетаданного, ИмяОбъектаМетаданных, ИмяКоллекции, ПутьКАртинке, СтруктураКЭШ)
	
	СписокПолейМетаданного = Новый СписокЗначений;
	
	лЭтоРегистр = (Найти(ИмяМетаданного, "Регистры") = 1);
	
	Если ИмяМетаданного = "Константы" тогда
		
		лКартинка = ПолучитьКартинку("МетаданныеКонстанта", ПутьКАртинке, СтруктураКЭШ);
		
		Для каждого Константа Из Метаданные.Константы Цикл
			СписокПолейМетаданного.Добавить(Константа.Имя, Константа.Имя,, лКартинка);
		КонецЦикла; 
	Иначе

		Попытка
			Если ИмяКоллекции = Неопределено ИЛИ лЭтоРегистр тогда
				лОбъектМетаданных = Вычислить("Метаданные[""" + ИмяМетаданного + """][""" + ИмяОбъектаМетаданных + """]");
			Иначе
				лОбъектМетаданных = Вычислить("Метаданные[""" + ИмяМетаданного + """][""" + ИмяОбъектаМетаданных + """].ТабличныеЧасти[""" + ИмяКоллекции + """]");
			КонецЕсли;
		Исключение
			Возврат Неопределено
		КонецПопытки; 
		
		Если ИмяМетаданного = "Справочники" ИЛИ ИмяМетаданного = "Документы" ИЛИ ИмяМетаданного = "ПланыВидовХарактеристик" тогда
			
			лКартинка = ПолучитьКартинку("МетаданныеСвойстваОбъектовСтандартныеРеквизиты", ПутьКАртинке, СтруктураКЭШ);
			
			СписокПолейМетаданного.Добавить("Ссылка", "Ссылка",, лКартинка);
			
			Если ИмяКоллекции = Неопределено Тогда 
				СписокПолейМетаданного.Добавить("ПометкаУдаления", "ПометкаУдаления",, лКартинка);
				
				Если ИмяМетаданного = "Справочники" тогда
					СписокПолейМетаданного.Добавить("Предопределенный", "Предопределенный",, лКартинка);
					Если лОбъектМетаданных.Владельцы.Количество() > 0 Тогда 
						СписокПолейМетаданного.Добавить("Владелец", "Владелец",, лКартинка);
					КонецЕсли;
					Если лОбъектМетаданных.ДлинаКода > 0 Тогда 
						СписокПолейМетаданного.Добавить("Код", "Код",, лКартинка);
					КонецЕсли;
					Если лОбъектМетаданных.ДлинаНаименования > 0 Тогда 
						СписокПолейМетаданного.Добавить("Наименование", "Наименование",, лКартинка);
					КонецЕсли;
					Если лОбъектМетаданных.Иерархический Тогда 
						СписокПолейМетаданного.Добавить("ЭтоГруппа", "ЭтоГруппа",, лКартинка);
						СписокПолейМетаданного.Добавить("Родитель" , "Родитель" ,, лКартинка);
					КонецЕсли;
				ИначеЕсли ИмяМетаданного = "Документы" тогда
					СписокПолейМетаданного.Добавить("Номер"   , "Номер"   ,, лКартинка);
					СписокПолейМетаданного.Добавить("Дата"    , "Дата"    ,, лКартинка);
					СписокПолейМетаданного.Добавить("Проведен", "Проведен",, лКартинка);
				Иначе
					Возврат СписокПолейМетаданного
				КонецЕсли;
			КонецЕсли;
			
			лКартинка         = ПолучитьКартинку("МетаданныеСвойстваОбъектовРеквизит", ПутьКАртинке, СтруктураКЭШ);
			лРеквизитыОбъекта = лОбъектМетаданных.Реквизиты;
			Для Каждого Реквизит из лРеквизитыОбъекта Цикл
				СписокПолейМетаданного.Добавить(Реквизит.Имя, Реквизит.Имя,, лКартинка);
			КонецЦикла;
			
		ИначеЕсли лЭтоРегистр Тогда

			лКартинка = ПолучитьКартинку("МетаданныеСвойстваОбъектовРеквизит", ПутьКАртинке, СтруктураКЭШ);
			
			лСвойстваМетаданного = ПолучитьСтруктуруДанныхПоОбъектуМетаданных(ИмяМетаданного + "." + ИмяОбъектаМетаданных);
			
			Если лСвойстваМетаданного.Периодический Тогда 
				СписокПолейМетаданного.Добавить("Период", "Период",, лКартинка);
			КонецЕсли;
			
			Если лСвойстваМетаданного.Свойство("Регистратор") Тогда 
				СписокПолейМетаданного.Добавить("Регистратор", "Регистратор",, лКартинка);
			КонецЕсли;
			
			Если Найти("регистрыбухгалтерии_регистрынакопления", НРег(ИмяМетаданного)) > 0 Тогда 
				СписокПолейМетаданного.Добавить("ВидДвижения", "ВидДвижения",, лКартинка);
			КонецЕсли;
			
			лИзмеренияРегистра = лОбъектМетаданных.Измерения;
			Для Каждого Измерение из лИзмеренияРегистра Цикл
				СписокПолейМетаданного.Добавить(Измерение.Имя, Измерение.Имя,, лКартинка);
			КонецЦикла;
			
			лКартинка        = ПолучитьКартинку("МетаданныеСвойстваОбъектовРесурс", ПутьКАртинке, СтруктураКЭШ);
			лРесурсыРегистра = лОбъектМетаданных.Ресурсы;		
			Для Каждого Ресурс из лРесурсыРегистра Цикл
				
				Если ИмяКоллекции = "Обороты" тогда
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Оборот", Ресурс.Имя + "Оборот",, лКартинка);
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Приход", Ресурс.Имя + "Приход",, лКартинка);
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Расход", Ресурс.Имя + "Расход",, лКартинка);
				ИначеЕсли ИмяКоллекции = "Остатки" тогда
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Остаток", Ресурс.Имя + "Остаток",, лКартинка);
				ИначеЕсли ИмяКоллекции = "ОстаткиИОбороты" тогда
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "НачальныйОстаток", Ресурс.Имя + "НачальныйОстаток",, лКартинка);
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Приход"          , Ресурс.Имя + "Приход"          ,, лКартинка);
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "Расход"          , Ресурс.Имя + "Расход"          ,, лКартинка);
					СписокПолейМетаданного.Добавить(Ресурс.Имя + "КонечныйОстаток" , Ресурс.Имя + "КонечныйОстаток" ,, лКартинка);
				Иначе
					СписокПолейМетаданного.Добавить(Ресурс.Имя, Ресурс.Имя,, лКартинка);
				КонецЕсли;
			КонецЦикла;
			
			лКартинка = ПолучитьКартинку("МетаданныеСвойстваОбъектовРесурс", ПутьКАртинке, СтруктураКЭШ);
			
			лРеквизитыРегистра = лОбъектМетаданных.Реквизиты;		
			
			Для Каждого Ресурс из лРеквизитыРегистра Цикл
				СписокПолейМетаданного.Добавить(Ресурс.Имя, Ресурс.Имя,, лКартинка);
			КонецЦикла;
			
		ИначеЕсли ИмяМетаданного="Перечисления" тогда	
			
			лКартинка = ПолучитьКартинкуПоМетаданному(ИмяМетаданного, СтруктураКЭШ);
			
			СписокПолейМетаданного.Добавить("Ссылка" , "Ссылка" ,, лКартинка);
			СписокПолейМетаданного.Добавить("Порядок", "Порядок",, лКартинка);			
			
		ИначеЕсли ИмяМетаданного="ПланыВидовХарактеристик" тогда	
		ИначеЕсли ИмяМетаданного="ПланыВидовРасчета" тогда
		ИначеЕсли ИмяМетаданного="ПланыОбмена" тогда
		ИначеЕсли ИмяМетаданного="ПланыСчетов" тогда
		ИначеЕсли ИмяМетаданного="РегистрыРасчета" тогда
		ИначеЕсли ИмяМетаданного="Последовательности" тогда
		ИначеЕсли ИмяМетаданного="КритерийОтбора" тогда
		ИначеЕсли ИмяМетаданного="БизнесПроцесс" тогда
		ИначеЕсли ИмяМетаданного="Задача" тогда
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокПолейМетаданного
	
КонецФункции // ПоляОбъектовМетаданных()

Функция гСписокОбъектовМетаданныхИзТекста(Текст, ИмяМетаданного = Неопределено, РазмерСписка = 0, СтруктураКЭШ = Неопределено) Экспорт
	
	лСписокОбъектовМетаданных = Новый СписокЗначений;
	
	// Получаем регистр из запроса
	Если гИнициализацияVBScript() тогда
		
		лНастройкиДляПарсингаТекста = Новый СписокЗначений;
		
		лСписокМетаданныхПлатформы = СписокМетаданных(СтруктураКЭШ);
		
		Для Каждого лТекМетаданноеПлатформы Из лСписокМетаданныхПлатформы Цикл
			
			Если ИмяМетаданного = Неопределено ИЛИ Найти(ИмяМетаданного, лТекМетаданноеПлатформы.Представление) > 0 Тогда 
				лНастройкиДляПарсингаТекста.Добавить(ИмяМетаданного, лТекМетаданноеПлатформы.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого лНастройка Из лНастройкиДляПарсингаТекста Цикл
			
			гRegExp.Pattern = гRegExp.Pattern + ?(гRegExp.Pattern = "", "", "|") + лНастройка.Представление + "\.[a-zA-Zа-яА-я_]+[a-zA-Zа-яА-я_0-9]*";
			
		КонецЦикла; 
		
		Массив = гRegExp.Execute(НРег(Текст));
		
		Для каждого текЭлемент Из Массив Цикл
			
			Для Каждого лТекМетаданноеПлатформы Из лСписокМетаданныхПлатформы Цикл
				
				лТекПрефиксМетаданного = НРег(лТекМетаданноеПлатформы.Значение + ".");
				
				Если Найти(текЭлемент.Value, лТекПрефиксМетаданного) > 0 Тогда 
					текНазвание = СтрЗаменить(текЭлемент.Value, лТекПрефиксМетаданного, "");
					текЗначение = Вычислить(лТекМетаданноеПлатформы.Представление + "." + текНазвание);
					Если лСписокОбъектовМетаданных.НайтиПоЗначению(текЗначение) = Неопределено Тогда 
						лСписокОбъектовМетаданных.Добавить(текЗначение, Метаданные.НайтиПоТипу(Тип(текЗначение)).Синоним,, БиблиотекаКартинок[лТекМетаданноеПлатформы.Значение]);
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			
			Если РазмерСписка > 0 И лСписокОбъектовМетаданных.Количество() = РазмерСписка Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
			
		//	Если Найти(текЭлемент.Value, "документ.") > 0 Тогда 
		//		текНазвание = СтрЗаменить(текЭлемент.Value, "документ.", "");
		//		текЗначение = Документы[текНазвание];
		//		Если лСписокОбъектовМетаданных.НайтиПоЗначению(текЗначение) = Неопределено Тогда 
		//			лСписокОбъектовМетаданных.Добавить(текЗначение, Метаданные.НайтиПоТипу(Тип(текЗначение)).Синоним,, БиблиотекаКартинок.Документ);
		//		КонецЕсли;
		//	ИначеЕсли Найти(текЭлемент.Value, "справочник.") > 0 Тогда 
		//		текНазвание = СтрЗаменить(текЭлемент.Value, "справочник.", "");
		//		текЗначение = Справочники[текНазвание];
		//		Если лСписокОбъектовМетаданных.НайтиПоЗначению(текЗначение) = Неопределено Тогда 
		//			лСписокОбъектовМетаданных.Добавить(текЗначение, Метаданные.НайтиПоТипу(Тип(текЗначение)).Синоним,, БиблиотекаКартинок.Справочник);
		//		КонецЕсли;
		//	ИначеЕсли Найти(текЭлемент.Value, "регистрсведений.") > 0 Тогда 
		//		текНазвание = СтрЗаменить(текЭлемент.Value, "регистрсведений.", "");
		//		Если Метаданные.РегистрыСведений.Найти(текНазвание) <> Неопределено Тогда 
		//			текЗначение = РегистрыСведений[текНазвание]; 
		//			Если лСписокОбъектовМетаданных.НайтиПоЗначению(текЗначение) = Неопределено Тогда 
		//				лСписокОбъектовМетаданных.Добавить(текЗначение, Метаданные.НайтиПоТипу(Тип(текЗначение)).Синоним,, БиблиотекаКартинок.РегистрСведений);
		//			КонецЕсли;
		//		КонецЕсли;
		//	ИначеЕсли Найти(текЭлемент.Value, "регистрнакопления.") > 0 Тогда 
		//		текНазвание = СтрЗаменить(текЭлемент.Value, "регистрнакопления.", "");
		//		текЗначение = РегистрыНакопления[текНазвание];
		//		Если лСписокОбъектовМетаданных.НайтиПоЗначению(текЗначение) = Неопределено Тогда 
		//			лСписокОбъектовМетаданных.Добавить(текЗначение, Метаданные.НайтиПоТипу(Тип(текЗначение)).Синоним,, БиблиотекаКартинок.РегистрНакопления);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла; 
	КонецЕсли;
	
	Возврат лСписокОбъектовМетаданных
	
КонецФункции // гСписокОбъектовМетаданныхИзТекста

Функция ПолучитьИмяБазовогоТипаПоТипуОбъекта(ТипОбъекта, СтруктураКЭШ)
	
	Перем Результат;
	
		Если ТипОбъекта = Тип("ОписаниеТипов") Тогда 
			Результат = "ОписаниеТипов"
		Иначе     		
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипОбъекта);
			
			Если МетаданныеТипа = Неопределено Тогда 
				Результат = ""
			Иначе
			
				ИдИмяТипаВКэше = "ИмяБазовогоТипаПоТипуОбъекта_" + МетаданныеТипа.Имя;
				
				Если Не гЗначениеИзКэшаСеансовыхДанных(ИдИмяТипаВКэше, Результат, СтруктураКЭШ) Тогда
					
					Если Метаданные.РегистрыСведений.Содержит(МетаданныеТипа) Тогда
						
						Результат = "РегистрыСведений";
						
					ИначеЕсли Метаданные.Документы.Содержит(МетаданныеТипа) Тогда
						
						Результат = "Документы";
						
					ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
						
						Результат = "Справочники";	
						
					ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаданныеТипа) Тогда
						
						Результат = "РегистрыНакопления";	
						
					ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеТипа) Тогда
						
						Результат = "РегистрыБухгалтерии";	
						
					ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеТипа) Тогда
						
						Результат = "Перечисления";
						
					ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеТипа) Тогда
						
						Результат = "ПланыВидовХарактеристик";
						
					ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеТипа) Тогда
						
						Результат = "ПланыВидовРасчета";
						
					ИначеЕсли Метаданные.ПланыОбмена.Содержит(МетаданныеТипа) Тогда
						
						Результат = "ПланыОбмена";
						
					ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеТипа) Тогда
						
						Результат = "ПланыСчетов";
						
					ИначеЕсли Метаданные.Задачи.Содержит(МетаданныеТипа) Тогда
						
						Результат = "Задачи";
						
					ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаданныеТипа) Тогда
						
						Результат = "БизнесПроцессы";
						
					//ИначеЕсли МетаданныеТипа = Неопределено Тогда
					//	
					//	Результат = "УдалениеОбъекта";
						
					Иначе
						
						Результат = "";
						
					КонецЕсли;
					
					гЗначениеВКэшСеансовыхДанных(ИдИмяТипаВКэше, Результат, СтруктураКЭШ);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Возвращает коллекции метаданных из указанного фильтра ("Справочники, Документы и т.д."), определяя по исходному
// тексту первое элемент первой коллекции как значение по умолчанию
//
Функция гПолучитьСписокОбъектовМетаданныхИзТекста(ИсходныйТекст, ФильтрМетаданных, ЗначениеПоУмолчанию, СтруктураКЭШ) Экспорт
	
	СписокОбъектовМетаданных = Новый СписокЗначений;
	
	лМассивМетаданных = СтрокаВМассив(ФильтрМетаданных);
	
	Если лМассивМетаданных.Количество() > 0 Тогда 
		
		Для каждого лИмяОбъектаМетаданных Из лМассивМетаданных Цикл
			
			Для каждого лОбъектМетаданных Из Метаданные[лИмяОбъектаМетаданных] Цикл
				СписокОбъектовМетаданных.Добавить(НРег(лИмяОбъектаМетаданных + "." + лОбъектМетаданных.Имя), лОбъектМетаданных.Синоним,, ПолучитьКартинкуПоМетаданному(лИмяОбъектаМетаданных, СтруктураКЭШ));
			КонецЦикла; 
			
		КонецЦикла; 
		
		лСписокОбъектовМетаданныхИзТекста = гСписокОбъектовМетаданныхИзТекста(ИсходныйТекст, ФильтрМетаданных, 1);
		
		Если лСписокОбъектовМетаданныхИзТекста.Количество() > 0 Тогда 
			
			ЗначениеПоУмолчанию = НРег(ПолучитьИмяБазовогоТипаПоТипуОбъекта(Тип(лСписокОбъектовМетаданныхИзТекста[0].Значение), СтруктураКЭШ) + 
			"." + 
			Метаданные.НайтиПоТипу(Тип(лСписокОбъектовМетаданныхИзТекста[0].Значение)).Имя);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокОбъектовМетаданных 
	
КонецФункции // гПолучитьСписокОбъектовМетаданныхИзТекста()

Функция ПолучитьСтруктуруДанныхПоОбъектуМетаданных(ПолноеИмяОбъектаМетаданных)
	
	лПутьКМетаданному = СтрокаВМассив(ПолноеИмяОбъектаМетаданных, ".");
	
	лМетаданное = Метаданные[лПутьКМетаданному[0]][лПутьКМетаданному[1]];
	
	Если Найти(НРег(ПолноеИмяОбъектаМетаданных), "регистры") = 1 Тогда 
		
		ЭтоРегистрСведений = Метаданные.РегистрыСведений.Содержит(лМетаданное);
		
		Если ЭтоРегистрСведений Тогда 
			лПериодический = (лМетаданное.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
		Иначе
			лПериодический = Истина;
		КонецЕсли;
		
		лСтруктураПараметров = Новый Структура();
		лСтруктураПараметров.Вставить("Периодический", лПериодический);
		лСтруктураПараметров.Вставить("Измерения"    , Новый Массив);
		лСтруктураПараметров.Вставить("Ресурсы"      , Новый Массив);
		лСтруктураПараметров.Вставить("Реквизиты"    , Новый Массив);		
		
		Если Не ЭтоРегистрСведений ИЛИ лМетаданное.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда 
			лСтруктураПараметров.Вставить("Регистратор", Неопределено);
		КонецЕсли;
		
		Для каждого лИзмерение Из лМетаданное.Измерения Цикл
			лСтруктураПараметров.Измерения.Добавить(лИзмерение.Имя);
		КонецЦикла; 
		
		Для каждого лРесурс Из лМетаданное.Ресурсы Цикл
			лСтруктураПараметров.Ресурсы.Добавить(лРесурс.Имя);
		КонецЦикла; 
		
		Для каждого лРеквизит Из лМетаданное.Реквизиты Цикл
			лСтруктураПараметров.Реквизиты.Добавить(лРеквизит.Имя);
		КонецЦикла; 
		
	ИначеЕсли Найти(НРег(ПолноеИмяОбъектаМетаданных), "документы") = 1 Тогда 
		
		лСтруктураПараметров = Новый Структура();
		
		лПроведениеЗапретить = (лМетаданное.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить);
		
		лСтруктураПараметров.Вставить("ПроведениеЗапретить", лПроведениеЗапретить);
		лСтруктураПараметров.Вставить("Реквизиты"          , Новый Массив);
		
		Для каждого лРеквизит Из лМетаданное.Реквизиты Цикл
			лСтруктураПараметров.Реквизиты.Добавить(лРеквизит.Имя);
		КонецЦикла; 
		
	ИначеЕсли Найти(НРег(ПолноеИмяОбъектаМетаданных), "справочники") = 1 Тогда 
		
		лСтруктураПараметров = Новый Структура();
		
		лСтруктураПараметров.Вставить("Реквизиты", Новый Массив);
		
		Для каждого лРеквизит Из лМетаданное.Реквизиты Цикл
			лСтруктураПараметров.Реквизиты.Добавить(лРеквизит.Имя);
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат лСтруктураПараметров
	
КонецФункции // ПолучитьСтруктуруДанныхПоОбъектуМетаданных()

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта"
// Для остальных типов приводит тип к строке, например "Число".
//
Функция гПредставлениеТипа(Тип) Экспорт
	
	Представление = "";
	
	Если Тип <> ТипЗнч(Неопределено) И ЭтоСсылка(Тип) Тогда
		
		ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
		ИмяОбъекта = СтрокаВМассив(ПолноеИмя, ".")[1];
		
		Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "СправочникСсылка";
			
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ДокументСсылка";
			
		ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "БизнесПроцессСсылка";
			
		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланВидовХарактеристикСсылка";
			
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланСчетовСсылка";
			
		ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланВидовРасчетаСсылка";
			
		ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ЗадачаСсылка";
			
		ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПланОбменаСсылка";
			
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
			Представление = "ПеречислениеСсылка";
			
		КонецЕсли;
		
		Результат = ?(Представление = "", Представление, Представление + "." + ИмяОбъекта);
		
	Иначе
		
		Результат = Строка(Тип);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Предопределенные_значения

Функция гТипыИсточниковДанных() Экспорт
	Возврат Новый Структура("Пакет, Запрос, Код", "Пакет", "Запрос", "Код");
КонецФункции

Функция гРежимыФормированияКодаИзТекстаЗапроса() Экспорт
	Возврат Новый Структура("Выборка, ТЗ, ОбработкаРезультата", "Выборка", "ТЗ", "ОбработкаРезультата");
КонецФункции // гРежимыФормированияКодаИзТекстаЗапроса()

Функция гТипПараметраПоЗначению(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда 
		Возврат гТипыЗначенийПараметров().Список
	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда 
		Возврат гТипыЗначенийПараметров().ТаблицаЗначений
	ИначеЕсли ТипЗнч(Значение) = Тип("Граница") Тогда 
		Возврат гТипыЗначенийПараметров().Граница
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда 
		Возврат гТипыЗначенийПараметров().МоментВремени
	Иначе
		Возврат гТипыЗначенийПараметров().Значение
	КонецЕсли;

КонецФункции // гТипПараметраПоЗначению()

Функция гТипыЗначенийПараметров() Экспорт
	Возврат Новый Структура("Значение, Список, ТаблицаЗначений, Граница, МоментВремени",1,2,3,4,5)
КонецФункции // ТипыЗначенийПараметров()

Функция гСпособыВыгрузки() Экспорт
	Возврат Новый Структура("Таблица, Дерево",1,2);
КонецФункции // гСпособыВыгрузки()

Функция гТипыПредустановленногоКода() Экспорт
	Возврат Новый Структура("ВставитьЦикл,РедактироватьРегистрСведений,РедактироватьДокументы,РедактироватьСправочники", 
		"ВставитьЦикл", "РедактироватьРегистрСведений", "РедактироватьДокументы", "РедактироватьСправочники");
КонецФункции

Функция гНазваниеОбработки(ВернутьПолноеНазвание = Истина) Экспорт
	
	лКраткоеНазвание = "Консоль запросов";
	
	Если ВернутьПолноеНазвание Тогда 
		Возврат лКраткоеНазвание + " " + ВерсияОбработки();
	Иначе
		Возврат лКраткоеНазвание;
	КонецЕсли;
	
КонецФункции // гНазваниеОбработки()

Функция гПрефиксСпецПоля() Экспорт
	Возврат "_СпецПоле_"
КонецФункции

Функция гПараметрыСпецСтрокиДереваЗапросов() Экспорт
	Возврат Новый Структура("Параметр, Значение", "СлужебнаяСтрокаДереваЗапросов", "СлужебнаяСтрокаДереваЗапросов!№;%:?*()_+/\=-0987654321ё");
КонецФункции

Функция гРежимыОткрытияФормы() Экспорт

	Возврат Новый Структура("Расшифровка, ПоказатьТаблицу", "Расшифровка", "ПоказатьТаблицу");

КонецФункции // гРежимыОткрытияФормы()

Функция гРежимыЗакрытияФормыВводаПроизвольногоКода() Экспорт

	Возврат Новый Структура("Выполнить, Сохранить, Отменить", "Выполнить", "Сохранить", "Отменить");

КонецФункции // гРежимыЗакрытияФормыВводаПроизвольногоКода()

Функция ЦветСсылкиСпецПоля()

	Возврат Новый Цвет(0,0,255);

КонецФункции

Функция гСвойстваРеквизитаРезультатЗапроса() Экспорт
	
	Свойства = Новый Структура();
	Свойства.Вставить("ИмяЭлементаРодителя"     , "ГруппаРезультатЗапроса");
	Свойства.Вставить("ИмяРеквизита"            , "РезультатЗапроса"); // название должно совпадать с реквизитом обычной формы!!!
	Свойства.Вставить("ПрефиксДляПолей"         , "_");
	Свойства.Вставить("ЗаголовокРеквизита"      , "Результат");
	Свойства.Вставить("ШиринаКолонкиПоУмолчанию", 10);
	
	Возврат Свойства

КонецФункции // гСвойстваРеквизитаРезультатЗапроса()

Функция гСвойстваПунктаМенюПоказатьВременнуюТаблицу() Экспорт
	
	Свойства = Новый Структура();
	Свойства.Вставить("ИмяКорня"     , "ПоказатьВременнуюТаблицу");
	Свойства.Вставить("НазваниеКорня", "Показать временную таблицу");
	Свойства.Вставить("Действие"     , "КнопкаМенюПодменюВременныеТаблицыПоказатьВременнуюТаблицу");
	
	Возврат Свойства
	
КонецФункции // гСвойстваПунктаМенюПоказатьВременнуюТаблицу()

Функция гСвойстваПунктаМенюПоказатьТаблицуПакета() Экспорт
	
	Свойства = Новый Структура();
	Свойства.Вставить("ИмяКорня"     , "ПодменюТаблицыПакета");
	//Свойства.Вставить("ИмяКорня"     , "ПоказатьТаблицуПакета");
	//Свойства.Вставить("НазваниеКорня", "Показать таблицу пакета");
	Свойства.Вставить("Действие"     , "КнопкаМенюПодменюТаблицыПакетаПоказатьВременнуюТаблицу");
	
	Возврат Свойства
	
КонецФункции // гСвойстваПунктаМенюПоказатьТаблицуПакета()

// #рефакторинг - актуализировать список операций
Функция гОперацииСЗапросами() Экспорт
	
	// при изменении состава операций необходимо актуализировать функцию ПолучитьРежимДиалогаПоОперацииРаботыСФайлами()
	лСтруктура = Новый Структура;
	лСтруктура.Вставить("Открыть"                  , "Открыть файл с запросами");
	лСтруктура.Вставить("ЗагрузитьИзСтарогоФормата", "Загрузить из старого формата");
	лСтруктура.Вставить("Новый"                    , "Новый файл с запросами");
	лСтруктура.Вставить("Сохранить"                , "Сохранить запросы в файл");
	лСтруктура.Вставить("СохранитьКАК"             , "Сохранить как...");
	лСтруктура.Вставить("СохранитьВОблако"         , "Сохранить в облако");
	лСтруктура.Вставить("ЗагрузитьИзОблака"        , "Загрузить из облака");
	лСтруктура.Вставить("СоздатьСсылку"            , "Поделиться...");
	лСтруктура.Вставить("Выполнить"                , "Выполнить");
	лСтруктура.Вставить("ВыполнитьУдаленно"        , "ВыполнитьУдаленно");
	
	лСтруктура.Вставить("ЗагрузитьЗапросыДляОтладки"       , "Загрузить запросы для отладки");
	
	Возврат лСтруктура;

КонецФункции // гОперацииСЗапросами()

Функция гСтроковыеКонстанты(ИмяКонстанты) Экспорт
	
	Если ИмяКонстанты = "ИмяНовогоФайлаЗапроса" Тогда 
		Возврат "Запросы от " + Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM.yyyy ЧЧ_ММ_сс'");
	ИначеЕсли ИмяКонстанты = "ИмяНовогоПакетаЗапроса" Тогда 
		Возврат "Запросы от " + Формат(ТекущаяДатаСеанса(), "ДФ='yyyyddMM'");
	ИначеЕсли ИмяКонстанты = "ПрефиксФайлаСоСхемойСКД" Тогда 
		Возврат "СКД_";
	ИначеЕсли ИмяКонстанты = "РасширениеФайлаДанныхДляОтладки" Тогда 
		Возврат "debug_data";
	ИначеЕсли ИмяКонстанты = "ПрефиксФайлаСПечатнойФормой" Тогда 
		Возврат "ПечФорма_";
	ИначеЕсли ИмяКонстанты = "ПрефиксФайлаССериализованнымОбъектом" Тогда 
		Возврат "XDTO_";
	ИначеЕсли ИмяКонстанты = "ВсеКолонкиЗначениеЭлемента" Тогда 
		Возврат "__Все колонки__";
	Иначе
		ВызватьИсключение "Константа " + ИмяКонстанты + " не определена";
	КонецЕсли;	
КонецФункции // гСтроковыеКонстанты()

Функция гМетодыПоискаВСтроке() Экспорт
	Возврат Новый Структура("Точно, Вначале, Вконце, Посередине", "Точно", "Вначале", "Вконце", "Посередине");
КонецФункции

Функция гЭтоЗапись(Режим) Экспорт
	Возврат (Режим = гОперацииСЗапросами().Сохранить ИЛИ Режим = гОперацииСЗапросами().СохранитьКАК ИЛИ Режим = гОперацииСЗапросами().СохранитьВОблако);
КонецФункции

Функция гЗаголовокОбработки(ИмяПользователяВОблаке, ИмяФайлаСЗапросом) Экспорт
	
	ЗаголовокФормы = НСтр("ru = '%гНазваниеОбработки% %ИмяПользователяВОблаке% | %ИмяФайлаСЗапросом%'");
	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, "%гНазваниеОбработки%"    , гНазваниеОбработки());
	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, "%ИмяПользователяВОблаке%", ?(ЗначениеЗаполнено(ИмяПользователяВОблаке), " | " + ИмяПользователяВОблаке, ""));
	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, "%ИмяФайлаСЗапросом%"     , ?(ЗначениеЗаполнено(ИмяФайлаСЗапросом), ИмяФайлаСЗапросом, "<не записан>"));
	
	Возврат ЗаголовокФормы
	
КонецФункции // гЗаголовокОбработки()

Функция гИндексыКартинокДляТиповИсточниковДанных() Экспорт
	
	лТипыИсточниковДанных = гТипыИсточниковДанных();
	
	лРезультат = Новый Соответствие;
	лРезультат.Вставить(лТипыИсточниковДанных.Пакет , 0);
	лРезультат.Вставить(лТипыИсточниковДанных.Запрос, 1);
	лРезультат.Вставить(лТипыИсточниковДанных.Код   , 2);
	
	Возврат лРезультат;
	
КонецФункции // гИндексыКартинокДляТиповИсточниковДанных()

Функция гИдентификаторНовогоОбъектаВОблаке() Экспорт
	Возврат "_new_";
КонецФункции // гСтруктураНастроекПрокси()

Функция гСтруктураНастроекПрокси() Экспорт
	Возврат Новый Структура("Использовать, ИспользоватьАутентификациюОС, Протокол, Сервер, Порт, Пользователь, Пароль", Ложь, Истина);
КонецФункции // гСтруктураНастроекПрокси()
 
Функция ПутьКОблаку()
	Возврат "consquery.ru";
КонецФункции // ПутьКОблаку()

#КонецОбласти

#Область ДобавлениеРеквизитовНаФорму

Функция гПолучитьМассивРеквизитовДляДобавленияТаблицыНаФорму(УникальныйИдентификаторФормы, АдресРезультата, АдресСпискаСпецПолей = "", СоздатьДерево = Ложь) Экспорт
	
	СвойстваРеквизитаРезультатЗапроса = гСвойстваРеквизитаРезультатЗапроса();
	ИмяРеквизитаФормыРезультатЗапроса = СвойстваРеквизитаРезультатЗапроса.ИмяРеквизита;
	
	// создадим реквизит формы для таблицы
	ТипРеквизитаРезультатаЗапроса = Новый Массив;
	Если Не СоздатьДерево Тогда 
		ТипРеквизитаРезультатаЗапроса.Добавить(Тип("ТаблицаЗначений"));
	Иначе
		ТипРеквизитаРезультатаЗапроса.Добавить(Тип("ДеревоЗначений"));
	КонецЕсли;
	ОписаниеТипРеквизитаРезультатаЗапроса = Новый ОписаниеТипов(ТипРеквизитаРезультатаЗапроса);
	
	// Удаляем реквизит формы, связанный с таблицей значений
	МассивРеквизитовУдаления = Новый Массив;
	МассивРеквизитовУдаления.Добавить(ИмяРеквизитаФормыРезультатЗапроса);
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаФормыРезультатЗапроса, ОписаниеТипРеквизитаРезультатаЗапроса, "", СвойстваРеквизитаРезультатЗапроса.ЗаголовокРеквизита));
	
	// формируем колонки реквизита с таблицей по источнику данных
	
	// +++ для полей сложных типов(ТаблицаЗначений, Хранилище ...) формируем коллекцию спец полей
	СписокТиповСпецПолей = Новый Массив;
	СписокТиповСпецПолей.Добавить(Тип("ТаблицаЗначений"));
	СписокТиповСпецПолей.Добавить(Тип("ХранилищеЗначения"));
	СписокТиповСпецПолей.Добавить(Тип("Тип"));
	СписокТиповСпецПолей.Добавить(Тип("ДвоичныеДанные"));
	СписокТиповСпецПолей.Добавить(Тип("МоментВремени"));
	
	Если ЗначениеЗаполнено(АдресСпискаСпецПолей) Тогда 
		лСпецПоля = ПолучитьИзВременногоХранилища(АдресСпискаСпецПолей);
		УдалитьИзВременногоХранилища(АдресСпискаСпецПолей);
		АдресСпискаСпецПолей = Неопределено;
	Иначе
		лСпецПоля = Новый Структура();
	КонецЕсли;
	
	// --- для полей сложных типов(ТаблицаЗначений, Хранилище ...) формируем коллекцию спец полей
	ИсточникДанныхТЗ  = ПолучитьИзВременногоХранилища(АдресРезультата);
	КоличествоКолонок = ИсточникДанныхТЗ.Колонки.Количество();
	
	СтруктураСпецПолейДляПерезаполнения = Новый Структура;
	Сч = 0;
	Пока Сч < КоличествоКолонок Цикл
		
		Колонка            = ИсточникДанныхТЗ.Колонки[Сч];
		ИмяРеквизита       = Колонка.Имя;		
		НовоеИмяРеквизита  = ИмяРеквизита;
		ТипыТекущейКолонки = Колонка.ТипЗначения.Типы();
		
		ТипСпецПоля = "";
		Для каждого текТипСпецПоля Из СписокТиповСпецПолей Цикл
			Если ТипыТекущейКолонки.Найти(текТипСпецПоля) <> Неопределено Тогда 
				ТипСпецПоля = ТипСпецПоля + ?(ТипСпецПоля = "", "", ";") + Строка(текТипСпецПоля);
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ТипСпецПоля) Тогда
			
			лСпецПоля.Вставить(ИмяРеквизита, ТипСпецПоля);
			
			НовоеИмяРеквизита = гПрефиксСпецПоля() + ИмяРеквизита;
			
			ИсточникДанныхТЗ.Колонки.Вставить(Сч, НовоеИмяРеквизита, Новый ОписаниеТипов("Строка"), Колонка.Заголовок);
			Если ТипСпецПоля = "Тип" Тогда 
				СтруктураСпецПолейДляПерезаполнения.Вставить(ИмяРеквизита, НовоеИмяРеквизита);
			ИначеЕсли Не СоздатьДерево Тогда 
				ИсточникДанныхТЗ.ЗаполнитьЗначения(ТипСпецПоля, НовоеИмяРеквизита);
			КонецЕсли;
			Сч = Сч + 1;
			КоличествоКолонок = КоличествоКолонок + 1;
			
			ИтоговыйТипЗначения = Новый ОписаниеТипов("Строка");
			
		Иначе
			Если ТипыТекущейКолонки.Найти(Тип("Null")) <> Неопределено Тогда 
				ИтоговыйТипЗначения = Новый ОписаниеТипов(Колонка.ТипЗначения,,"Null");
			Иначе
				ИтоговыйТипЗначения = Новый ОписаниеТипов(Колонка.ТипЗначения);
			КонецЕсли;
		КонецЕсли;		
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(НовоеИмяРеквизита, ИтоговыйТипЗначения, ИмяРеквизитаФормыРезультатЗапроса));
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	Если СтруктураСпецПолейДляПерезаполнения.Количество() > 0 Тогда 
		Для Каждого СтрокаИсточникДанныхТЗ Из ИсточникДанныхТЗ Цикл
			Для Каждого КлючЗначение Из СтруктураСпецПолейДляПерезаполнения Цикл
				СтрокаИсточникДанныхТЗ[КлючЗначение.Значение] = СтрокаИсточникДанныхТЗ[КлючЗначение.Ключ]
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Результат = Новый Структура("МассивРеквизитов, МассивРеквизитовУдаления");
	Результат.МассивРеквизитов         = МассивРеквизитов;
	Результат.МассивРеквизитовУдаления = МассивРеквизитовУдаления;
	
	АдресСпискаСпецПолей = ПоместитьВоВременноеХранилище(лСпецПоля, УникальныйИдентификаторФормы);
	ПоместитьВоВременноеХранилище(ИсточникДанныхТЗ, АдресРезультата);
	
	Возврат Результат
	
КонецФункции // гПолучитьМассивРеквизитовДляДобавленияТаблицыНаФорму

Процедура гВывестиТаблицуНаФорму(Элементы, АдресРезультата, АдресСпискаСпецПолей, УсловноеОформление, СоздатьДерево = Ложь) Экспорт

	СвойстваРеквизитаРезультатЗапроса = гСвойстваРеквизитаРезультатЗапроса();
	ИмяРеквизитаФормыРезультатЗапроса = СвойстваРеквизитаРезультатЗапроса.ИмяРеквизита;
	ПрефиксДляПолейТаблицРезультата   = СвойстваРеквизитаРезультатЗапроса.ПрефиксДляПолей;
	
	ИсточникДанныхТЗ = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	// +++ добавляем элемент таблица на форму
	ЭлементФормыТЗ = Элементы.Найти(ИмяРеквизитаФормыРезультатЗапроса);
	Если ЭлементФормыТЗ = Неопределено Тогда 
		ЭлементФормыТЗ = Элементы.Добавить(ИмяРеквизитаФормыРезультатЗапроса, Тип("ТаблицаФормы"), Элементы.Найти(СвойстваРеквизитаРезультатЗапроса.ИмяЭлементаРодителя));
		ЭлементФормыТЗ.ПутьКДанным = ИмяРеквизитаФормыРезультатЗапроса;
		
		// устанавливаем обработчики таблицы
		СписокОбработчиковТЗ = Новый СписокЗначений;
		СписокОбработчиковТЗ.Добавить("Выбор"                , "РезультатЗапросаВыборЗначения");
		СписокОбработчиковТЗ.Добавить("ПередНачаломИзменения", "РезультатЗапросаПередНачаломИзменения");
		СписокОбработчиковТЗ.Добавить("ПриИзменении"         , "РезультатЗапросаПриИзменении");
		
		Для каждого ОбработчикТЗ Из СписокОбработчиковТЗ Цикл
			ЭлементФормыТЗ.УстановитьДействие(ОбработчикТЗ.Значение, ОбработчикТЗ.Представление);
		КонецЦикла; 
		
	Иначе
		Пока ЭлементФормыТЗ.ПодчиненныеЭлементы.Количество() > 0 Цикл 
			Элементы.Удалить(ЭлементФормыТЗ.ПодчиненныеЭлементы[0]);
		КонецЦикла;
	КонецЕсли;
	// --- добавляем элемент таблица на форму
	
	Если Не СоздатьДерево Тогда 
		ЭлементФормыТЗ.Отображение = ОтображениеТаблицы.Список;
	Иначе
		ЭлементФормыТЗ.Отображение = ОтображениеТаблицы.Дерево;
	КонецЕсли;
	
	// +++ формируем внешний вид элемента формы с таблицей значений
	лСпецПоля = ПолучитьИзВременногоХранилища(АдресСпискаСпецПолей);
	Для каждого Колонка Из ИсточникДанныхТЗ.Колонки Цикл
		Если лСпецПоля.Свойство(Колонка.Имя) Тогда 
			Продолжить;
		КонецЕсли;
		НоваяКолонка = Элементы.Добавить(ИмяРеквизитаФормыРезультатЗапроса + ПрефиксДляПолейТаблицРезультата + Колонка.Имя, Тип("ПолеФормы"), ЭлементФормыТЗ);
		НоваяКолонка.Вид               = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным       = ИмяРеквизитаФормыРезультатЗапроса + "." + Колонка.Имя;
		НоваяКолонка.Заголовок         = Колонка.Заголовок;
		НоваяКолонка.Ширина            = СвойстваРеквизитаРезультатЗапроса.ШиринаКолонкиПоУмолчанию;
		Если Найти(Колонка.Имя, гПрефиксСпецПоля()) = 1 Тогда
			НоваяКолонка.ГиперссылкаЯчейки = Истина;
			НоваяКолонка.ТолькоПросмотр    = Истина;
		КонецЕсли;
	КонецЦикла;
	// --- формируем внешний вид элемента формы с таблицей значений
	
	// +++ добавляем оформление для спец полей
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;	
	
	ОформлениеУО      = ЭлементУсловногоОформления.Оформление;
	ОтборУО           = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО = ЭлементУсловногоОформления.Поля;
	
	ОформлениеУО.УстановитьЗначениеПараметра("ЦветТекста", ЦветСсылкиСпецПоля());
	
	Для каждого СпецПоле Из лСпецПоля Цикл
		
		ОформляемоеПоле = ОформляемыеПоляУО.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяРеквизитаФормыРезультатЗапроса + гПрефиксСпецПоля() + СпецПоле.Ключ);	
		
		ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = ОформляемоеПоле.Поле;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ЭлементОтбора.Использование  = Истина;
		
	КонецЦикла; 
	// --- добавляем оформление для спец полей

КонецПроцедуры // гВывестиТаблицуНаФорму()

#КонецОбласти

Функция КаталогВременныхФайловОбработки()
	
	ВременныйФайл = Новый Файл(ПолучитьИмяВременногоФайла());
	
	Возврат ВременныйФайл.Путь
	
КонецФункции // КаталогВременныхФайловОбработки()

#Область Работа_с_картинками

// Извлекает файлы из архива, расположенного в макете обработки
// Параметры:
//   ИмяМакета - Строка
//
// Возвращаемое значение:
//   Строка - путь к месту выгрузки картинок
//
Функция ИзвлечьКартинкиОбработкиНаСервере(Знач ИмяМакета, Знач ВременныйКаталогОбработки)
	
	Перем ИмяАрхива, ВременныйФайл, ПутьККартинкам;

	ИмяАрхива = СтрШаблон("%1.zip", ИмяМакета);
	ПутьККартинкам = СтрШаблон("%1\%2", 
		"picture",
		ИмяМакета
	);

	ПутьККартинкам = ВременныйКаталогОбработки + гПреобразоватьВПравильноеНазвание(ПутьККартинкам, "\");
	
	Если СоздатьКаталогРекурсивно(ПутьККартинкам) Тогда 
		лИмяАрхиваСИконками = СтрШаблон("%1\%2", ПутьККартинкам, ИмяАрхива);
		ПолучитьМакет(ИмяМакета).Записать(лИмяАрхиваСИконками);
		лАрхив = Новый ЧтениеZipФайла(лИмяАрхиваСИконками);
		лАрхив.ИзвлечьВсе(ПутьККартинкам);
        лАрхив.Закрыть();
	Иначе
		ПутьККартинкам = Неопределено
	КонецЕсли;
	
	Возврат ПутьККартинкам

КонецФункции // ИзвлечьКартинкиОбработкиНаСервере()

Функция ЕстьКартинкавоВнешнейБиблиотеке(ИмяКартинки)
	
	Перем КартинкиБиблиотеки;
	
	КартинкиБиблиотеки = Новый Массив;
	
	КартинкиБиблиотеки.Добавить("addon");
	КартинкиБиблиотеки.Добавить("changelog");
	КартинкиБиблиотеки.Добавить("cloud_open");
	КартинкиБиблиотеки.Добавить("comment");
	КартинкиБиблиотеки.Добавить("create_from_code _copy");
	КартинкиБиблиотеки.Добавить("create_from_code");
	КартинкиБиблиотеки.Добавить("create_from_code1");
	КартинкиБиблиотеки.Добавить("create_from_code2");
	КартинкиБиблиотеки.Добавить("create_from_query");
	КартинкиБиблиотеки.Добавить("create_from_query1");
	КартинкиБиблиотеки.Добавить("create_from_query2");
	КартинкиБиблиотеки.Добавить("create_from_query3");
	КартинкиБиблиотеки.Добавить("create_from_query_copy");
	КартинкиБиблиотеки.Добавить("disks_black");
	КартинкиБиблиотеки.Добавить("download_cloud");
	КартинкиБиблиотеки.Добавить("drill");
	КартинкиБиблиотеки.Добавить("find");
	КартинкиБиблиотеки.Добавить("fugueicons");
	КартинкиБиблиотеки.Добавить("home");
	КартинкиБиблиотеки.Добавить("ico.zip");
	КартинкиБиблиотеки.Добавить("info");
	КартинкиБиблиотеки.Добавить("mail--pencil");
	КартинкиБиблиотеки.Добавить("mail__pencil");
	КартинкиБиблиотеки.Добавить("nocomment");
	КартинкиБиблиотеки.Добавить("open_list_metadata");
	КартинкиБиблиотеки.Добавить("paste_link");
	КартинкиБиблиотеки.Добавить("piggy_bank");
	КартинкиБиблиотеки.Добавить("proxy");
	КартинкиБиблиотеки.Добавить("question");
	КартинкиБиблиотеки.Добавить("save");
	КартинкиБиблиотеки.Добавить("saveas");
	КартинкиБиблиотеки.Добавить("saveas_local");
	КартинкиБиблиотеки.Добавить("savebranch");
	КартинкиБиблиотеки.Добавить("server_cloud");
	КартинкиБиблиотеки.Добавить("share");
	КартинкиБиблиотеки.Добавить("upload_cloud");
	КартинкиБиблиотеки.Добавить("менюзакрыть");
	КартинкиБиблиотеки.Добавить("менюпоказать");
	КартинкиБиблиотеки.Добавить("метаданныеhttpсервис");
	КартинкиБиблиотеки.Добавить("метаданныеhttpсервисы");
	КартинкиБиблиотеки.Добавить("метаданныеwebсервис");
	КартинкиБиблиотеки.Добавить("метаданныеwebсервисы");
	КартинкиБиблиотеки.Добавить("метаданныеwsссылка");
	КартинкиБиблиотеки.Добавить("метаданныеwsссылки");
	КартинкиБиблиотеки.Добавить("метаданныеxdtoпакет");
	КартинкиБиблиотеки.Добавить("метаданныеxdtoпакеты");
	КартинкиБиблиотеки.Добавить("метаданныебизнеспроцесс");
	КартинкиБиблиотеки.Добавить("метаданныебизнеспроцессы");
	КартинкиБиблиотеки.Добавить("метаданныевнешниеисточникиданных");
	КартинкиБиблиотеки.Добавить("метаданныевнешнийисточникданных");
	КартинкиБиблиотеки.Добавить("метаданныегруппакоманд");
	КартинкиБиблиотеки.Добавить("метаданныегруппыкоманд");
	КартинкиБиблиотеки.Добавить("метаданныедокумент");
	КартинкиБиблиотеки.Добавить("метаданныедокументы");
	КартинкиБиблиотеки.Добавить("метаданныежурналдокументов");
	КартинкиБиблиотеки.Добавить("метаданныежурналыдокументов");
	КартинкиБиблиотеки.Добавить("метаданныезадача");
	КартинкиБиблиотеки.Добавить("метаданныезадачи");
	КартинкиБиблиотеки.Добавить("метаданныеинтерфейс");
	КартинкиБиблиотеки.Добавить("метаданныеинтерфейсы");
	КартинкиБиблиотеки.Добавить("метаданныеконстанта");
	КартинкиБиблиотеки.Добавить("метаданныеконстанты");
	КартинкиБиблиотеки.Добавить("метаданныеконфигурация");
	КартинкиБиблиотеки.Добавить("метаданныекритерииотбора");
	КартинкиБиблиотеки.Добавить("метаданныекритерийотбора");
	КартинкиБиблиотеки.Добавить("метаданныенумератор");
	КартинкиБиблиотеки.Добавить("метаданныенумераторы");
	КартинкиБиблиотеки.Добавить("метаданныеобработка");
	КартинкиБиблиотеки.Добавить("метаданныеобработки");
	КартинкиБиблиотеки.Добавить("метаданныеобщаякартинка");
	КартинкиБиблиотеки.Добавить("метаданныеобщаякоманда");
	КартинкиБиблиотеки.Добавить("метаданныеобщаяформа");
	КартинкиБиблиотеки.Добавить("метаданныеобщие");
	КартинкиБиблиотеки.Добавить("метаданныеобщиекартинки");
	КартинкиБиблиотеки.Добавить("метаданныеобщиекоманды");
	КартинкиБиблиотеки.Добавить("метаданныеобщиемакеты");
	КартинкиБиблиотеки.Добавить("метаданныеобщиемодули");
	КартинкиБиблиотеки.Добавить("метаданныеобщиереквизиты");
	КартинкиБиблиотеки.Добавить("метаданныеобщиеформы");
	КартинкиБиблиотеки.Добавить("метаданныеобщиймакет");
	КартинкиБиблиотеки.Добавить("метаданныеобщиймодуль");
	КартинкиБиблиотеки.Добавить("метаданныеобщийреквизит");
	КартинкиБиблиотеки.Добавить("метаданныеопределяемыетипы");
	КартинкиБиблиотеки.Добавить("метаданныеопределяемыйтип");
	КартинкиБиблиотеки.Добавить("метаданныеотчет");
	КартинкиБиблиотеки.Добавить("метаданныеотчеты");
	КартинкиБиблиотеки.Добавить("метаданныепараметрсеанса");
	КартинкиБиблиотеки.Добавить("метаданныепараметрфункциональнойопции");
	КартинкиБиблиотеки.Добавить("метаданныепараметрысеанса");
	КартинкиБиблиотеки.Добавить("метаданныепараметрыфункциональныхопций");
	КартинкиБиблиотеки.Добавить("метаданныеперечисление");
	КартинкиБиблиотеки.Добавить("метаданныеперечисления");
	КартинкиБиблиотеки.Добавить("метаданныепланвидоврасчета");
	КартинкиБиблиотеки.Добавить("метаданныепланвидовхарактеристик");
	КартинкиБиблиотеки.Добавить("метаданныепланобмена");
	КартинкиБиблиотеки.Добавить("метаданныеплансчетов");
	КартинкиБиблиотеки.Добавить("метаданныепланывидоврасчета");
	КартинкиБиблиотеки.Добавить("метаданныепланывидовхарактеристик");
	КартинкиБиблиотеки.Добавить("метаданныепланыобмена");
	КартинкиБиблиотеки.Добавить("метаданныепланысчетов");
	КартинкиБиблиотеки.Добавить("метаданныеподписканасобытие");
	КартинкиБиблиотеки.Добавить("метаданныеподпискинасобытия");
	КартинкиБиблиотеки.Добавить("метаданныеподсистема");
	КартинкиБиблиотеки.Добавить("метаданныеподсистемы");
	КартинкиБиблиотеки.Добавить("метаданныепоследовательности");
	КартинкиБиблиотеки.Добавить("метаданныепоследовательность");
	КартинкиБиблиотеки.Добавить("метаданныерегистрбухгалтерии");
	КартинкиБиблиотеки.Добавить("метаданныерегистрнакопления");
	КартинкиБиблиотеки.Добавить("метаданныерегистррасчета");
	КартинкиБиблиотеки.Добавить("метаданныерегистрсведений");
	КартинкиБиблиотеки.Добавить("метаданныерегистрыбухгалтерии");
	КартинкиБиблиотеки.Добавить("метаданныерегистрынакопления");
	КартинкиБиблиотеки.Добавить("метаданныерегистрырасчета");
	КартинкиБиблиотеки.Добавить("метаданныерегистрысведений");
	КартинкиБиблиотеки.Добавить("метаданныерегламентноезадание");
	КартинкиБиблиотеки.Добавить("метаданныерегламентныезадания");
	КартинкиБиблиотеки.Добавить("метаданныероли");
	КартинкиБиблиотеки.Добавить("метаданныероль");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовграфа");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовграфы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовзначение");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовзначения");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовизмерение");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовизмерения");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовкоманда");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовкоманды");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовкуб");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовкубы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовмакет");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовмакеты");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовметод");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовметоды");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовоперации");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовоперация");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпараметр");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпараметры");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовперерасчет");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовперерасчеты");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовполе");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовполя");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпредопределенныеэлементы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпредопределенныйэлемент");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпризнакиучета");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпризнакиучетасубконто");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпризнакучета");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовпризнакучетасубконто");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовреквизит");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовреквизитадресации");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовреквизиты");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовреквизитыадресации");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовресурс");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовресурсы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовстандартнаятабличнаячасть");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовстандартныереквизиты");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовстандартныетабличныечасти");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовстандартныйреквизит");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтаблица");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтаблицаизмерений");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтаблицы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтаблицыизмерений");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтабличнаячасть");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовтабличныечасти");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовформа");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовформы");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовфункции");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовфункция");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовхарактеристика");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовхарактеристики");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовшаблонurl");
	КартинкиБиблиотеки.Добавить("метаданныесвойстваобъектовшаблоныurl");
	КартинкиБиблиотеки.Добавить("метаданныесправочник");
	КартинкиБиблиотеки.Добавить("метаданныесправочники");
	КартинкиБиблиотеки.Добавить("метаданныестили");
	КартинкиБиблиотеки.Добавить("метаданныестиль");
	КартинкиБиблиотеки.Добавить("метаданныефункциональнаяопция");
	КартинкиБиблиотеки.Добавить("метаданныефункциональныеопции");
	КартинкиБиблиотеки.Добавить("метаданныехранилищанастроек");
	КартинкиБиблиотеки.Добавить("метаданныехранилищенастроек");
	КартинкиБиблиотеки.Добавить("метаданныеэлементстиля");
	КартинкиБиблиотеки.Добавить("метаданныеэлементыстиля");
	КартинкиБиблиотеки.Добавить("метаданныеязык");
	КартинкиБиблиотеки.Добавить("метаданныеязыки");
	КартинкиБиблиотеки.Добавить("подменювременныетаблицы");
	
	КартинкиБиблиотеки.Добавить("accumulationrecordtype");
	КартинкиБиблиотеки.Добавить("accounttype");
	КартинкиБиблиотеки.Добавить("accountingrecordtype");
	КартинкиБиблиотеки.Добавить("boolean");
	КартинкиБиблиотеки.Добавить("bound");
	КартинкиБиблиотеки.Добавить("datetime");
	КартинкиБиблиотеки.Добавить("decimal");
	КартинкиБиблиотеки.Добавить("null");
	КартинкиБиблиотеки.Добавить("pointoftime");
	КартинкиБиблиотеки.Добавить("string");
	КартинкиБиблиотеки.Добавить("typedescription");
	КартинкиБиблиотеки.Добавить("uuid");
	КартинкиБиблиотеки.Добавить("binarydata");
	КартинкиБиблиотеки.Добавить("valuetree");
	КартинкиБиблиотеки.Добавить("picture");
	КартинкиБиблиотеки.Добавить("array");
	КартинкиБиблиотеки.Добавить("произвольный");
	КартинкиБиблиотеки.Добавить("valuelisttype");
	КартинкиБиблиотеки.Добавить("standardbeginningdate");
	КартинкиБиблиотеки.Добавить("standardperiod");
	КартинкиБиблиотеки.Добавить("valuetable");
	КартинкиБиблиотеки.Добавить("valuestorage");
	КартинкиБиблиотеки.Добавить("color");
	КартинкиБиблиотеки.Добавить("font");
	КартинкиБиблиотеки.Добавить(НРег(ВидыПараметров().ПроизвольныйКод));
	
	Возврат (КартинкиБиблиотеки.Найти(НРег(ИмяКартинки)) <> Неопределено)
	
КонецФункции // ЕстьКартинкавоВнешнейБиблиотеке()
	
// Возвращает картинку по имени на основании файла, выгруженного из макета с картинками
// Параметры:
//   ИмяКартинки - Строка - имя файла без расширения
//   ПутьККартинке - Строка - пусть к каталогу с файлами-картнками (см. функцию ИзвлечьКартинкиОбработкиНаСервере)
//   ВернутьАдрес - Булево - 
//   	Истина - картинка помещается во временное хранилище и возврается ее адрес в этом хранилище
//   	Ложь - возвращается сама картинка
//
// Возвращаемое значение:
//   [Строка | Картинка | Неопределено] - адрес во временном хранилище или сама картинка (см. параметр ВернутьАдрес)
//
Функция ПолучитьВнешнююКартинку(ИмяКартинки, ПутьККартинке, ВернутьАдрес = Ложь)
	
	Если Не ЕстьКартинкавоВнешнейБиблиотеке(ИмяКартинки) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьККартинке) Тогда 
		Возврат Неопределено; // #рефакторинг не должно быть такого
	КонецЕсли;
	
	лПолныйПутьККартинке = ПутьККартинке + "\" + ИмяКартинки + ".png";
	
	Попытка		
		
		Если ВернутьАдрес Тогда 
			Результат = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(лПолныйПутьККартинке))
		Иначе 
			Результат = Новый Картинка(лПолныйПутьККартинке);
		КонецЕсли;		
		
	Исключение
		
		Результат = Неопределено;
		
	КонецПопытки; 
	
	Возврат Результат
	
КонецФункции // ПолучитьВнешнююКартинку()

Функция ПолучитьКартинку(ИмяКартинки, ПутьККартинке, СтруктураКЭШ, Локальная = Неопределено)
	
	Перем Картинка;
	
	Если Локальная = Истина ИЛИ Локальная = Неопределено Тогда 
		
		Картинка = ПолучитьКартинкуПоМетаданному(ИмяКартинки, СтруктураКЭШ);
		
		Если ЗначениеЗаполнено(Картинка) Тогда 
			Возврат Картинка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Локальная = Ложь ИЛИ Локальная = Неопределено Тогда 
		
		Если Не гЗначениеИзКэшаСеансовыхДанных("Картинки_" + ИмяКартинки, Картинка, СтруктураКЭШ) Тогда 
			
			Картинка = ПолучитьВнешнююКартинку(ИмяКартинки, ПутьККартинке);
			
			гЗначениеВКэшСеансовыхДанных("Картинки_" + ИмяКартинки, Картинка, СтруктураКЭШ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Картинка) Тогда 
			Возврат Картинка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьКартинку

Функция ПолучитьКартинкуПоМетаданному(ИмяМетаданного, СтруктураКЭШ)
	
	Перем Результат;
	
	ИдКартинкиВКэше = "Картинки_Метаданные_" + ИмяМетаданного;
	
	Если Не гЗначениеИзКэшаСеансовыхДанных(ИдКартинкиВКэше, Результат, СтруктураКЭШ) Тогда
		
		Если ИмяМетаданного = "Константы" тогда
			Результат = БиблиотекаКартинок.Константа;
		ИначеЕсли ИмяМетаданного = "Справочники" тогда
			Результат = БиблиотекаКартинок.Справочник;
		ИначеЕсли ИмяМетаданного = "Документы" тогда
			Результат = БиблиотекаКартинок.Документ;
		ИначеЕсли ИмяМетаданного = "ЖурналыДокументов" тогда
			Результат = БиблиотекаКартинок.ЖурналДокументов;
		ИначеЕсли ИмяМетаданного = "Перечисления" тогда
			Результат = БиблиотекаКартинок.Перечисление;
		ИначеЕсли ИмяМетаданного = "ПланыВидовРасчета" тогда
			Результат = БиблиотекаКартинок.ПланВидовРасчета;
		ИначеЕсли ИмяМетаданного = "ПланыВидовХарактеристик" тогда
			Результат = БиблиотекаКартинок.ПланВидовХарактеристик;
		ИначеЕсли ИмяМетаданного = "ПланыОбмена" тогда
			Результат = БиблиотекаКартинок.ПланОбмена;
		ИначеЕсли ИмяМетаданного = "ПланыСчетов" тогда
			Результат = БиблиотекаКартинок.ПланСчетов;
		ИначеЕсли ИмяМетаданного = "РегистрыБухгалтерии" тогда
			Результат = БиблиотекаКартинок.РегистрБухгалтерии;
		ИначеЕсли ИмяМетаданного = "РегистрыНакопления" тогда
			Результат = БиблиотекаКартинок.РегистрНакопления;
		ИначеЕсли ИмяМетаданного = "РегистрыРасчета" тогда
			Результат = БиблиотекаКартинок.РегистрРасчета;
		ИначеЕсли ИмяМетаданного = "РегистрыСведений" тогда
			Результат = БиблиотекаКартинок.РегистрСведений;
		ИначеЕсли ИмяМетаданного = "Последовательности" тогда
			Результат = Новый Картинка(ПолучитьМакет("Картинка_Последовательности"), Истина);
		ИначеЕсли ИмяМетаданного = "КритерииОтбора" тогда
			Результат = БиблиотекаКартинок.КритерийОтбора;
		ИначеЕсли ИмяМетаданного = "БизнесПроцессы" тогда
			Результат = БиблиотекаКартинок.БизнесПроцесс;
		ИначеЕсли ИмяМетаданного = "Задачи" тогда
			Результат = БиблиотекаКартинок.Задача;
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
		гЗначениеВКэшСеансовыхДанных(ИдКартинкиВКэше, Результат, СтруктураКЭШ);
		
	КонецЕсли;		
	
	Возврат Результат
	
КонецФункции // ПолучитьКартинкуПоМетаданному

#КонецОбласти

#Область Вывод_сообщений

// Вставляет параметры в строку, учитывая, что в параметрах могут использоваться подстановочные слова %1, %2 и т.д.
Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
//
Функция гПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции // гПодставитьПараметрыВСтроку()

#КонецОбласти

#Область Печать_произвольных_коллекций

// Процедура формирует печатную форму
// Параметры:
//		ИсточникДанных          - {ТаблицаЗначений|ДеревоЗначений|СтрокаДереваЗначений|РезультатЗапроса} - источник данных для формирования печатной формы
//		ТабДок                  - ТабличныйДокумент - документ, в который выводится печатная форма
//		ДополнительныеПараметры - Структура - {ОбластьИерархическихЗаписей, ДетальнаяСтрока, КоличествоКолонок}
// 
Процедура ПечатьКоллекции(ИсточникДанных, ТабДок, ДополнительныеПараметры)
	
	Перем ФормаПрогрессора;
	
	Если ТипЗнч(ИсточникДанных) = Тип("ДеревоЗначений") ИЛИ ТипЗнч(ИсточникДанных) = Тип("СтрокаДереваЗначений") Тогда 
		лДанныеКоллекция = ИсточникДанных.Строки;
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("ТаблицаЗначений") Тогда 
		лДанныеКоллекция = ИсточникДанных;
	Иначе
		Возврат;
	КонецЕсли;
	
	Инд = 1;
	Для Каждого Выборка Из лДанныеКоллекция Цикл
		
		Инд = Инд + 1;
		
		#Если НаКлиенте Тогда
		ОбработкаПрерыванияПользователя();
		
		Если ДополнительныеПараметры.Свойство("ФормаПрогрессора", ФормаПрогрессора) Тогда 
			// +++ обновление индикатора прогресса
			ФормаПрогрессора.ЗначениеИндикатора = Инд;
			ФормаПрогрессора.НадписьСостоянияИндикатораТекущая = "Выводится " + Инд + " - я строка";
			// --- обновление индикатора прогресса
		КонецЕсли;
		#КонецЕсли
		
		Если ТипЗнч(Выборка) = Тип("СтрокаДереваЗначений") И Выборка.Строки.Количество() > 0 Тогда 
			ИсходнаяСтрока = ДополнительныеПараметры.ОбластьИерархическихЗаписей;
		Иначе
			ИсходнаяСтрока = ДополнительныеПараметры.ДетальнаяСтрока;
		КонецЕсли;
		
		Для ИндексКолонки = 0 По ДополнительныеПараметры.КоличествоКолонок - 1 Цикл
			Область             = ИсходнаяСтрока.Область(1, ИндексКолонки + 1);
			Область.Текст       = ЗначениеКВыводуНаПечать(Выборка[ИндексКолонки]);
			Область.Расшифровка = Выборка[ИндексКолонки];
		КонецЦикла;
		
		ТабДок.Вывести(ИсходнаяСтрока, ?(ТипЗнч(Выборка) = Тип("СтрокаДереваЗначений"),Выборка.Уровень(),0));
		
		Если ТипЗнч(Выборка) = Тип("СтрокаДереваЗначений") И Выборка.Строки.Количество() > 0 Тогда 
			ПечатьКоллекции(Выборка, ТабДок, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПечатьКоллекции() 

Функция ЗначениеКВыводуНаПечать(Значение)
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда 
		
		Результат = "";
		Для каждого ТекЗначение Из Значение Цикл
			Результат = Результат + ?(Результат = "", "", Символы.ПС) + ТекЗначение;
		КонецЦикла; 
		
	Иначе
		Результат = Значение
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции // ЗначениеКВыводу()

#КонецОбласти

Функция ПолучитьИмяСервераПоСтрокеСоединения()
	
	ДанныеПоПодключению = гРазложитьСтрокуВМассивПодстрок(СтрокаСоединенияИнформационнойБазы(), """");
	Если ДанныеПоПодключению[0] = "Srvr=" Тогда 
		ИмяСервера = ДанныеПоПодключению[1]; 
		ИмяСервера = Сред(ИмяСервера, 0, Найти(ИмяСервера, ":") - 1);
	Иначе
		ИмяСервера = Неопределено 
	КонецЕсли;
	
	Возврат ИмяСервера;
	
КонецФункции // ПолучитьИмяСервераПоСтрокеСоединения()

#КонецОбласти

#Область Инициализация


#КонецОбласти

// функция гМинимальныйРелизПлатформы() Экспорт
//	// критический 8.3.6.1977 - ЧтениеJSON
//	Возврат "8.3.6.1977"
//	// критический 8.3.8 - Изменен состав обработчиков при закрытии формы в упр режиме
//	Возврат "8.3.8"
// конецФункции

