
// Обработчик выбора строки в дереве
//
Процедура ДеревоЗапросовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ВладелецФормы.мРежимВыбораВеткиДерева = "ПеренестиВДругуюВетку" тогда
		РодительСтроки = ВыбраннаяСтрока;
		Пока РодительСтроки <> НеОпределено Цикл

			Если РодительСтроки = ТекущаяСтрокаВладельца Тогда
				ПоказатьПредупреждение(, "Нельзя выбирать в качестве копируемой строки саму строку
				               |или подчиненные ей строки. Выберите другую строку.");
				Возврат;
			КонецЕсли;

			РодительСтроки = РодительСтроки.Родитель;

		КонецЦикла;
	КонецЕсли;

	ОповеститьОВыборе(ВыбраннаяСтрока);

КонецПроцедуры // ДеревоЗапросовВыбор()

// Обработчик нажатия кнопки переноса на верхний уровень
//
Процедура КнопкаНаВерхнийУровеньНажатие(Элемент)

	ДеревоЗапросовВыбор(ЭлементыФормы.ДеревоЗапросов, ЭлементыФормы.ДеревоЗапросов.ТекущаяСтрока, Неопределено, Ложь)		
	
КонецПроцедуры // КнопкаНаВерхнийУровеньНажатие()