Перем мМинимальноеЗначениеАвтосохранения;

// Управляет доступностью элементов управления
//
// Параметры:
//	Нет.
//
Процедура УправлениеДиалогом()

	ЭлементыФормы.НадписьФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;
	ЭлементыФормы.ФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

// Обработчик изменения флажка автосохранения
//
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)

	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	УправлениеДиалогом();

КонецПроцедуры // ИспользоватьАвтосохранениеПриИзменении()

// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	Если ФрмИспользоватьАвтосохранение И ФрмИнтервалАвтосохранения < мМинимальноеЗначениеАвтосохранения Тогда 
		ФрмИнтервалАвтосохранения = мМинимальноеЗначениеАвтосохранения;
		Сообщить("Минимальное возможное значение - " + мМинимальноеЗначениеАвтосохранения, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ИспользоватьАвтосохранение = ФрмИспользоватьАвтосохранение;
	ИнтервалАвтосохранения = ФрмИнтервалАвтосохранения;
	Закрыть();

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	мМинимальноеЗначениеАвтосохранения = 60;
	
	ФрмИспользоватьАвтосохранение = ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения = ИнтервалАвтосохранения;

	УправлениеДиалогом();

КонецПроцедуры // ПередОткрытием()
